{"id":10860,"date":"2020-09-11T00:22:34","date_gmt":"2020-09-11T05:22:34","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=10860"},"modified":"2020-10-12T08:36:42","modified_gmt":"2020-10-12T13:36:42","slug":"should-students-choose-their-classes-university-design-problem-part-1","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2020\/09\/should-students-choose-their-classes-university-design-problem-part-1\/","title":{"rendered":"Should Students Choose Their Classes? (University Design Problem Part 1)"},"content":{"rendered":"\n<p>I am taking a class called &#8220;University Design Problem: Georgetown 2030.&#8221; It is an ambitious class: by the end of it, we hope to make a proposal to Georgetown that will create some lasting change in its educational policy. Part of this process is engaging the community, and getting everyone&#8217;s ideas on how education can be changed for the better. I was thinking about how to best do this, and realized that writing about the class on this blog can be a good way to engage you (and others) who are not taking the class with me. I am not sure how long this series will be, since I&#8217;ll be focusing in on things that stand out or interest me as the class progresses. Are you interested in following along? Consider subscribing through the subscription box on the right sidebar (bottom of the page on mobile)!  <\/p>\n\n\n\n<h2>In the past<\/h2>\n\n\n\n<p>In 1857, America&#8217;s higher education system was broken. At Harvard, &#8220;students were to master a restrictive sequence of required courses primarily in three subject areas: Latin, Greek, and mathematics.&#8221; (Davidson, 20). This represented a large mismatch, because students would go on to vocational studies (medicine, law, dentistry, science) where their university education was worthless. What accounted for this mismatch, and why hadn&#8217;t schools evolved?<\/p>\n\n\n\n<h2>The Industrial Revolution <\/h2>\n\n\n\n<p>Before the industrial revolution, most people lived on farms where they would raise and butcher their own animals. Families had to be self-sufficient units: cottage industries. This all changes when people begin working in factories, where their labor is owned by the factory owners. In exchange, these people are paid a wage. As operations scale up in this way, specialized experts trained by vocational schools and universities are desperately needed. Yet, schools like Harvard were still teaching the same out-of-date subjects and skills that they taught hundreds of years ago. Why?<\/p>\n\n\n\n<h2>Students could not choose their classes<\/h2>\n\n\n\n<p>In the past, students could not choose their subjects, and if they could, it was among a limited number of offerings. This forced students to take classes that they had little interest in, and little use for. Yet, this set-up is actually quite convenient for the university. As soon as students were able to choose their classes, certain classes fell drastically out of popularity. This forced universities to get rid of certain subjects, and add more sections of others. Inevitably, faculty would need to be changed depending on the demands of the students. Thus, the &#8220;strategic retirement&#8221; was introduced to the modern university.<\/p>\n\n\n\n<h2>What led to this change?<\/h2>\n\n\n\n<p>In 1869, Charles William Eliot becomes the president of Harvard, and he completely overhauls the university by emulating certain elements of European universities. At the time he was highly controversial, especially for his essay, &#8220;The New Education.&#8221; Yet, the change was necessary, and other colleges soon followed suit. Eliot was in favor of transforming education to be more relevant to students, yet he was actually against strictly technical\/vocational education, like some of the universities he researched in Germany. To Eliot, a balanced education will allow the student to become &#8220;an observant, reflecting, and sensible [&#8230;] well trained also to see, compare, reason, and decide.&#8221; Yet an education would also have to &#8220;include a vast deal of information and many practical exercises appropriate to the professions which the students have in view.&#8221; (Davidson, 32)<\/p>\n\n\n\n<h2>What about today?<\/h2>\n\n\n\n<p>As a Georgetown sophomore in the SFS (school of foreign service), I don&#8217;t get as much choice as I would like. All Georgetown SFS students must take 47 credit-hours of core requirements. As a prospective STIA major, I&#8217;m looking at another 25 credits of major requirements. On top of that, the foreign language requirement will add on another 30 credits or so depending on the student. That is a lot, and why I think the history of student choice is especially relevant to Georgetown. Should Georgetown students have less requirements to slog through? <\/p>\n\n\n\n<p>I personally believe so. A lot of requirements aren&#8217;t serving their intended purpose. For example, the new &#8220;Science for all&#8221; requirement forces all students to take an introductory science class. The idea is that everyone should take a science class before they leave Georgetown. Yet, it ignores the reality that a single science class isn&#8217;t going to be useful at all to the average graduate. In fact, I would argue that it is dangerous for students to take an intro science class and leave feeling confident in their knowledge of that subject. Often times, the introductory material is too simplified to be very useful (an example would be how someone might learn Newtonian physics without learning a lot of the exceptions and assumptions to go along with it). Compounding on this, a lot of &#8220;science for all&#8221; classes at Georgetown are taught like humanities classes anyway (I&#8217;m thinking of classes such as &#8220;Science in the News&#8221;- as a disclaimer, I have never actually taken this class, and am mostly just going off of the class description). I say this as someone who actually really enjoys science!<\/p>\n\n\n\n<p>A friend of mine at Grinnell College has an &#8220;open curriculum,&#8221; which means that there are 0 core requirements (though they still have major requirements). I personally love this idea, and believe that we should get rid of the core. On one hand, I would have definitely missed out on a lot of cool classes. On the other hand, I would be exclusively taking classes that I am actually interested in- after all, I chose them! School-specific courses are a tougher problem. Most SFS students would take a lot of the core international affairs classes even if they were not required, but it would be weird if someone went through their entire SFS experience without taking a single INAF class. Many of the required SFS-only classes are actually quite reasonable (such as the popular Maps of the Modern World), and my personal experience in SFS required courses has been very positive. I lean towards a great curtailment of many of the SFS requirements. This would force professors to modernize their teaching styles and update their curriculum to suit the tastes of students registering for classes. <\/p>\n\n\n\n<p>Anyway, that&#8217;s probably enough rambling. What do you think about the core requirements? Should Georgetown get rid of them and have an &#8220;open curriculum?&#8221; Let me know in the comments below, and thanks for reading!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Cited sources:<br>Davidson, Cathy N. <em>The New Education: How to Revolutionize the University to Prepare Students for a World in Flux<\/em>. Basic Books, 2017.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I am taking a class called &#8220;University Design Problem: Georgetown 2030.&#8221; It is an ambitious class: by the end of it, we hope to make a proposal to Georgetown that will create some lasting change in its educational policy. Part of this process is engaging the community, and getting everyone&#8217;s ideas on how education can &#8230; <a title=\"Should Students Choose Their Classes? (University Design Problem Part 1)\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2020\/09\/should-students-choose-their-classes-university-design-problem-part-1\/\" aria-label=\"More on Should Students Choose Their Classes? (University Design Problem Part 1)\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":10862,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[38],"tags":[41],"jetpack_featured_media_url":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-11-at-12.15.25-AM.png?fit=427%2C366&ssl=1","jetpack-related-posts":[{"id":5378,"url":"https:\/\/jorgezhang.com\/2020\/03\/universities-must-adopt-permanent-and-universal-as\/","url_meta":{"origin":10860,"position":0},"title":"Universities Must Adopt Permanent and Universal A's","date":"March 29, 2020","format":false,"excerpt":"What do we do about grades in the wake of Covid-19? We have to consider equity- for disadvantaged students, students applying to graduate schools, and anyone who cannot participate in class to their full ability due to the extreme circumstances. At Georgetown University, most students are in favor of \"Double…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/03\/a.png?fit=714%2C720&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5432,"url":"https:\/\/jorgezhang.com\/2020\/04\/narrative-evaluation-to-replace-letter-grades\/","url_meta":{"origin":10860,"position":1},"title":"Narrative Evaluation to Replace Letter Grades","date":"April 20, 2020","format":false,"excerpt":"A few weeks ago, I outlined why I believe that grades need to be abolished. The main argument is that grades have alienated students from the real purpose of education. Rather than learn, students obey their teacher's instructions as closely as possible to maximize their grade. Abolishing grades might actually…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/04\/narrative-evaluation.jpg?fit=800%2C800&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1460,"url":"https:\/\/jorgezhang.com\/2019\/04\/on-senioritis-guest-article\/","url_meta":{"origin":10860,"position":2},"title":"On Senioritis (Guest Article)","date":"April 8, 2019","format":false,"excerpt":"Guest article by Liam Schumm; I blog at https:\/\/liamschumm.com about coding and life. I've had a peculiar experience with \"senioritis\". Freshman year I took calculus, a class with many seniors. Many of my friends graduated in the next couple years, and I felt like I got early-onset senioritis. As somebody…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/Screen-Shot-2019-04-07-at-8.47.22-PM.png?fit=877%2C722&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":10860,"position":3},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":5710,"url":"https:\/\/jorgezhang.com\/2020\/06\/why-is-walter-payton-college-preps-student-matriculation-into-top-tier-universities-so-strong\/","url_meta":{"origin":10860,"position":4},"title":"Why is Walter Payton College Prep's Student Matriculation into top tier Universities so Strong?","date":"June 20, 2020","format":false,"excerpt":"Why is Walter Payton College Prep's student matriculation into top tier universities consistently strong, especially in comparison to other high schools in Illinois? Conventional wisdom suggests that this is the result of an extremely competitive environment, or the result of extraordinarily wealthy students. Yet, Payton is nowhere close to the…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/06\/IMG_20160212_110219-scaled.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1893,"url":"https:\/\/jorgezhang.com\/2019\/09\/washingcon-2019-board-game-convention-review\/","url_meta":{"origin":10860,"position":5},"title":"Washingcon 2019 Board Game Convention Review","date":"September 9, 2019","format":false,"excerpt":"Where else can you meet famous board game designers like Elizabeth Hargrave and Jon Gilmour, and then walk 5 minutes back to where you live? If you are a Georgetown University student, the answer is Washingcon (which is actually held directly on campus). Interestingly, Georgetown currently doesn't have a board…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/09\/IMG_20190908_152321.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/10860"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=10860"}],"version-history":[{"count":4,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/10860\/revisions"}],"predecessor-version":[{"id":10870,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/10860\/revisions\/10870"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/10862"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=10860"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=10860"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=10860"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}