{"id":1177,"date":"2019-03-01T01:19:10","date_gmt":"2019-03-01T01:19:10","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1177"},"modified":"2019-03-01T01:26:36","modified_gmt":"2019-03-01T01:26:36","slug":"response-to-cardboard-edison-feedback","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/03\/response-to-cardboard-edison-feedback\/","title":{"rendered":"Response to Cardboard Edison Feedback"},"content":{"rendered":"\n<p>In January I entered Daggers High into a contest called the Cardboard Edison Award. There were over 200 submissions, and 15 were selected as finalists. <\/p>\n\n\n\n<p>Unfortunately, Daggers High did not get selected this year, and if I am being honest I am pretty bummed about that. I get that there was a ton of competition, it just feels terrible to have worked hard on a game for 1.5 years and have it not qualify to the second round of a contest like this. I guess that is just how it is in the game design industry.<\/p>\n\n\n\n<p>All this being said, I am beyond grateful that they released judge comments. A lot of competitions do not even bother to give feedback, and Cardboard Edison could easily do the same to prevent criticism and complaints. I really respect that the contest makers made the decision to open up the gate for me to do just that: criticize and complain about the judge comments. Jokes aside, I got helpful feedback and I am not trying to claim that I should have &#8220;done better&#8221; or qualified as a finalist. I just wish to directly address the comments made by the judges as fairly as I can (I realize that I almost certainly failed at this as I am awfully biased in favor of my own game).<\/p>\n\n\n\n<p>It is very important to note that none of these judges played the game. They were reviewing my video submission and my rulebook. If you are interested, according to the site, &#8220;Submissions will be judged based on engagement, originality of theme, and originality of mechanics.&#8221;<\/p>\n\n\n\n<p><strong>Judge 1:<br>What was the game&#8217;s strongest point?<br><br>I like the variety of ways to earn RP and spend RP for various effects.&nbsp;<br><\/strong><\/p>\n\n\n\n<p>My guess is that this judge is referring to Integrity with &#8220;spend RP&#8221;.<\/p>\n\n\n\n<p><strong><br>What was the game&#8217;s weakest point?<br><br>You have some parts with additional rules like TOP classes and purchasing clubs from others. I worry that these add more rules baggage and possible confusion than they are worth.&nbsp;<\/strong><\/p>\n\n\n\n<p>I have been thinking about this. Though TOP Classes isn&#8217;t an additional rule: there is no in-game difference between a TOP Class and an honors class other than flavor. And while purchasing clubs from others could be removed, I would need to find a new solution to two issues:<\/p>\n\n\n\n<ol><li>Club deck running out, leading to players having excess Friends<\/li><li>The fact that the whole point of clubs is being easy sources of RP that can be taken away, while classes are <g class=\"gr_ gr_4 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del\" id=\"4\" data-gr-id=\"4\">worth less<\/g> RP but are permanent. Rebalancing issues would arise. <\/li><\/ol>\n\n\n\n<p>For those reasons, I think I will be keeping these &#8220;rules&#8221; unless I think of a better solution.<\/p>\n\n\n\n<p><strong>Any additional comments?<br><br>I really enjoy the theme. It’s pretty unique and ties into the mechanics well.&nbsp;<\/strong><\/p>\n\n\n\n<p>Thanks!<strong><br><br>I worry about the use of 3 sizes of cubes. Seems like it could be hard to easily distinguish them when not next to each other. Tokens with numbers on them would be easier.&nbsp;<br><\/strong><\/p>\n\n\n\n<p>Playtesters have brought this up. I am planning to remove the second size cube, and just have a 1 value cube and a 5 value cube. It also makes sense since this would be cheaper to print!<\/p>\n\n\n\n<p><strong>The FUN scores may be thematic, but having the score not be the points it’s worth is an extra level of thinking for the player to deal with. <br><\/strong><\/p>\n\n\n\n<p>This is a really good point. Thanks for the insight! At this point in time I&#8217;m leaning towards making this sacrifice for the theme. I feel that scores of &#8220;10&#8221;, &#8220;8&#8221;, and &#8220;4&#8221; on the FUN would be pretty silly and defeat the whole joke about how anything below a 34 is considered a &#8220;failure&#8221; to hyper competitive high school kids.<\/p>\n\n\n\n<p><strong><br>Judge 2<br><br>What was the game&#8217;s strongest point?<br><br>I&#8217;ve seen more than a couple of attempts at turning the high-school experience into a board game, but I have to say this looks like the most promising. Having to balance the various resources (stress, friends, grades, etc.) looks like it will give players the kind of tension that is very appropriate for a&nbsp;euro-style&nbsp;game like this.<\/strong><\/p>\n\n\n\n<p>Thanks! It would be really interesting to see these other high school themed games. I only know of 2 or 3 that are strictly high school theme, and not like &#8220;high schoolers who slay zombies&#8221;, etc.<\/p>\n\n\n\n<p><strong>What was the game&#8217;s weakest point?<br><br>I&#8217;m a little concerned about downtime, especially at higher player counts. The turns are fairly involved. (Would it be possible to split a given turn into smaller increments so that players don&#8217;t have to wait as long between turns?) I&#8217;m also a little concerned that having to play out your entire hand will make players feel less in control of their actions than they would want to be for this style of game; have playtesters mentioned feeling railroaded or wanting more control? Cards are flexible and can be used in different ways, so I&#8217;m not super-concerned about this.<\/strong><\/p>\n\n\n\n<p>This has been a persistent concern since day one and still is. That being said, I&#8217;m at least happy that the game went from 7+ hours to under 2 hours. I definitely agree with this judge and I think that this is the game&#8217;s biggest weakness. The secondary concern is also one that I am thinking about. The drafting solves most of this, but as some playtesters have pointed out, in a 3 player game you get stuck with the &#8220;worst&#8221; card you are initially dealt. I think that I will help solve this issue though with a rework to the Graff ability.<\/p>\n\n\n\n<p>This is something that only people who have played the game a lot tend to utilize, but Graff can be used to dump a card from your hand onto someone else. This way, you can get rid of cards that you don&#8217;t want to play. However, this version of Graff still forces each card dealt to be played. <\/p>\n\n\n\n<p>So my solution is to change Graff&#8217;s ability to the following: Draw 1 event card, return 1 to bottom. <\/p>\n\n\n\n<p>Funnily, this was the original Graff effect. However, it was changed since in a <g class=\"gr_ gr_65 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"65\" data-gr-id=\"65\">five player<\/g> game you run out of event cards. Now that the 5 player game doesn&#8217;t exist anymore, I think I will try out this new Graff effect and see how it goes.<strong><br><br>Any additional comments?<br><br>I&#8217;m rooting for this one to make it to the finals. If it does, be sure to have someone learn the game from the rulebook with you in the room so that you can iron out any wrinkles before sending the prototype!<\/strong><\/p>\n\n\n\n<p>Thanks!<strong><br><br>Judge 3:<br><br>What was the game&#8217;s strongest point?<br><br>The theme definitely lends itself to all kinds of hooks for game design.<\/strong><\/p>\n\n\n\n<p>Thanks. Right now I am trying to spin the game as something teenage gamers would really enjoy.<strong><br><br>What was the game&#8217;s weakest point?<br><br>I worry that at its core there&#8217;s not a lot of actual game mechanics happening. It seems to be powered mostly by what cards come up and how they interact. It also seems pretty dry for such a theme.<\/strong><\/p>\n\n\n\n<p>At first, I really hated this feedback. I still do since it hurts when someone says &#8220;there&#8217;s not a lot of actual game mechanics happening&#8221;. It&#8217;s not very helpful and misses the point of the game. This comment makes me doubt this judge spent much time at all on their review, because I feel that it could not be further from the truth.<\/p>\n\n\n\n<p>That being said, I now really appreciate this feedback for honesty. It means that on some level I failed. I was not engaging enough, or I didn&#8217;t explain the game well. And this is really important, especially when I am pitching a game. I&#8217;m not going to blame the judge, but I will talk about why I think their comment is wrong.<\/p>\n\n\n\n<p>I think what this judge missed is the fact that you have 5 (6 if you count the FUN) unique actions, 8 unique teacher abilities, the available clubs, getting Recs, flipping Essays, and more <g class=\"gr_ gr_15 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del\" id=\"15\" data-gr-id=\"15\">that<\/g> you can do on your turn. I think that means that the game is not &#8220;powered mostly by what cards come up&#8221;. It&#8217;s fair to call the game dry, but I wish they addressed the part where I discussed Daggers High as a satire, because this &#8220;dryness&#8221; was intentional. It&#8217;s not meant to be a fantasy academy. It&#8217;s meant to make fun of competitive high school students, and highlight how college applications are cutthroat.<strong><br>Any additional comments?<br><br><br>Judge 4:<br><br>What was the game&#8217;s strongest point?<br><br>This looks like a well-playtested game with a fresh theme and integrated mechanisms.&nbsp;<br><\/strong><\/p>\n\n\n\n<p>Thanks.<\/p>\n\n\n\n<p><strong><br>What was the game&#8217;s weakest point?<br><br>The game has a great theme, and the mechanisms <g class=\"gr_ gr_23 gr-alert gr_gramm gr_inline_cards gr_run_anim Grammar multiReplace\" id=\"23\" data-gr-id=\"23\">seems<\/g> sound. However, because we&#8217;re mixing heavier, more abstracted mechanisms with a lighter, more concrete theme, I have the feeling this will be a tricky sell to publishers, and to the general public.&nbsp;<\/strong><\/p>\n\n\n\n<p><strong>If the goal of the game is not publication, then that won&#8217;t be an issue. But if someone pitched me the theme of this game, I&#8217;d expect it to be a light 30-minute family game, not a crunchy 1-2 hour Euro. There are likely going to be a lot of folks saying, &#8220;wow, this looks complicated,&#8221; or &#8220;this wasn&#8217;t at all what I expected.&#8221; That makes for a tricky sell!<\/strong><\/p>\n\n\n\n<p><strong>I wish that it <g class=\"gr_ gr_9 gr-alert gr_gramm gr_inline_cards gr_run_anim Grammar multiReplace\" id=\"9\" data-gr-id=\"9\">weren&#8217;t<\/g> the <g class=\"gr_ gr_10 gr-alert gr_gramm gr_inline_cards gr_run_anim Punctuation only-del replaceWithoutSep\" id=\"10\" data-gr-id=\"10\">case,<\/g> and that lighter themes and heavier mechanisms were easier to mix. But that&#8217;s what I&#8217;ve personally encountered as a designer, and I think it will be a factor should this game ever hit the road to publication!<\/strong><\/p>\n\n\n\n<p>This is a really good point, but I think I have to disagree. I don&#8217;t think the public wants a light high school game. I know that because I have heard of this exact game. It failed on Kickstarter: <a href=\"https:\/\/www.kickstarter.com\/projects\/aaronmckinney\/kicking-class\/description\">https:\/\/www.kickstarter.com\/projects\/aaronmckinney\/kicking-class\/description<\/a><\/p>\n\n\n\n<p>And while I get that this is anecdotal evidence, there don&#8217;t exist any other light high school games on the market (that I know of). So I am very skeptical of the notion that Daggers High would find more appeal as a light game.<\/p>\n\n\n\n<p>So does that mean we&#8217;re doomed to never see a game about high school? I dunno, but I am 100% against remaking Daggers High as a light game. Personally, I am getting very tired of building castles and empires and I think other people are too. And it sounds like this judge feels the same way about light themes not being applied to heavier games. I appreciate the warning, but I&#8217;d rather be naive than give up.<\/p>\n\n\n\n<p><strong>Any additional comments?<\/strong><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>What do you think of the judge comments on Daggers High? Am I being too critical of the <g class=\"gr_ gr_35 gr-alert gr_gramm gr_inline_cards gr_run_anim Grammar multiReplace\" id=\"35\" data-gr-id=\"35\">judges<\/g> comments? Thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In January I entered Daggers High into a contest called the Cardboard Edison Award. There were over 200 submissions, and 15 were selected as finalists. Unfortunately, Daggers High did not get selected this year, and if I am being honest I am pretty bummed about that. I get that there was a ton of competition, &#8230; <a title=\"Response to Cardboard Edison Feedback\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/03\/response-to-cardboard-edison-feedback\/\" aria-label=\"More on Response to Cardboard Edison Feedback\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1092,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[1],"tags":[],"jetpack_featured_media_url":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/01\/cardboard-Edison-Logo.gif?fit=500%2C500&ssl=1","jetpack-related-posts":[{"id":1396,"url":"https:\/\/jorgezhang.com\/2019\/03\/why-you-should-submit-to-the-board-game-workshop-design-contest\/","url_meta":{"origin":1177,"position":0},"title":"Why you should submit to the Board Game Workshop Design Contest","date":"March 28, 2019","format":false,"excerpt":"Hey everyone! I've been working on Lord of Colors in my spare time for a while now, and since I don't currently have any long term plans with it, I figured I'd submit it to a contest to see how it does. I'm very interested to see what people have…","rel":"","context":"In &quot;Game Design&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/IMG_20190325_161120.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1164,"url":"https:\/\/jorgezhang.com\/2019\/02\/lords-of-color-pnp\/","url_meta":{"origin":1177,"position":1},"title":"Lord of Colors PnP","date":"February 23, 2019","format":false,"excerpt":"Edit: In the process of renaming the game to Lord of Colors (formerly Lords of CMYK, and before that Lords of Color). Also made a post on BGG: https:\/\/boardgamegeek.com\/thread\/2156196\/lords-color-1-3-players Hey everyone! Today I am bringing you the Print and Play for Lord of Colors. You can print it at home…","rel":"","context":"In &quot;Game Design&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/02\/Lords-of-Color-Logo.png?fit=1200%2C1056&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1419,"url":"https:\/\/jorgezhang.com\/2019\/03\/yearly-review-102nd-post\/","url_meta":{"origin":1177,"position":2},"title":"Yearly Review (102nd post!)","date":"March 31, 2019","format":false,"excerpt":"Hey everyone! It's the 102nd post of this blog, which is absolutely mind-boggling to think about. That means that in the past year, I've been writing roughly 1 blog post for every 3 days! So today, I thought that I would share some of the statistics with you, which I…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-31-at-12.03.13-PM.png?fit=1051%2C417&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1090,"url":"https:\/\/jorgezhang.com\/2019\/01\/video-submission-to-cardboard-edison\/","url_meta":{"origin":1177,"position":3},"title":"Video Submission to Cardboard Edison","date":"January 22, 2019","format":false,"excerpt":"Daggers High's submission video to Cardboard Edison 2019.","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/01\/cardboard-Edison-Logo.gif?fit=500%2C500&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":1177,"position":4},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":1096,"url":"https:\/\/jorgezhang.com\/2019\/02\/daggers-high-at-polar-vortex-2019\/","url_meta":{"origin":1177,"position":5},"title":"Daggers High at Polar Vortex 2019","date":"February 1, 2019","format":false,"excerpt":"Daggers High at the 2019 Polar Vortex convention.","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/02\/3p-January-Polar-Vortex.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1177"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1177"}],"version-history":[{"count":3,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1177\/revisions"}],"predecessor-version":[{"id":1180,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1177\/revisions\/1180"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1092"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1177"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1177"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1177"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}