{"id":1194,"date":"2019-03-05T20:29:23","date_gmt":"2019-03-05T20:29:23","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1194"},"modified":"2019-03-09T04:31:24","modified_gmt":"2019-03-09T04:31:24","slug":"andrew-yang-and-ubi","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/03\/andrew-yang-and-ubi\/","title":{"rendered":"Andrew Yang and UBI"},"content":{"rendered":"\n<p>Today, I donated to my first political campaign ever. <\/p>\n\n\n\n<p>I usually stay out of discussions of politics, especially online or among people I don&#8217;t know very well, since I&#8217;ve rarely had those discussions lead to anything productive. If anything, discussing politics usually comes down to two people not really listening to eachother, and walking away more entrenched in their views than before.<\/p>\n\n\n\n<p>That being said, you probably haven&#8217;t heard of Andrew Yang. And his proposal on Universal Base Income (UBI) hasn&#8217;t been seriously considered in Washington ever before. That&#8217;s why I want to share it with you: because I seriously believe that this discussion has merit. And Andrew Yang is gaining popularity very rapidly. Recently, he was on the Joe Rogan podcast, and he is already slated to be in the Democratic primary debates.<\/p>\n\n\n\n<p>Andrew Yang&#8217;s argument begins with the robot revolution. He claims that the robots aren&#8217;t coming: they are already here. He has a lot of convincing statistics, but I&#8217;ve been directly noticing the effects as well. Ghost malls, phone robots, and completely automated shipping have led to the loss of millions of jobs. Just recently, when I ordered a small order from DriveThruCards, the same service that made the cards for Daggers High, I made a mistake and accidentally made two orders instead of one order. I contacted their customer <g class=\"gr_ gr_18 gr-alert gr_gramm gr_inline_cards gr_run_anim Punctuation only-del replaceWithoutSep\" id=\"18\" data-gr-id=\"18\">service,<\/g> and was informed that their shipping process was <em>entirely automated<\/em>. As in, no humans were involved in the manufacturing and packing of the cards, and so there was no way to undo or change the order. No wonder DriveThruCards was so much cheaper than their competitors! <\/p>\n\n\n\n<p>I believe this will continue happening, as more and more jobs are eliminated. And it will likely impact the least skilled workers the most. That&#8217;s why Washington has been proposing massive retraining programs. Personally, I agree with Yang: these are just completely unrealistic. There aren&#8217;t enough STEM jobs to go around. And how likely is it that a <g class=\"gr_ gr_448 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling multiReplace\" id=\"448\" data-gr-id=\"448\">50 year old<\/g> truck driver is going to learn how to be a software engineer and compete with all of the 24-year-old college grads who are strapped with debt and desperate for a job? Very unlikely as it turns out, with success rates for these types of retraining programs being in the single digits.<\/p>\n\n\n\n<p>So what happens when millions of people lose their jobs to robots? According to Yang, this loss of jobs is unprecedented in the history of humanity. It&#8217;s impossible to predict the full effects, but when a large portion of Americans lose their jobs, there will surely be massive riots and economic collapse. That&#8217;s where Universal Base Income comes in. <\/p>\n\n\n\n<p>Yang plans to give a $1000 check every month to every US Citizen above the age of 18. Sound like Communism? It&#8217;s not: it&#8217;s actually pretty much the opposite. Yang has been describing it as a &#8220;capitalism that does not start at 0.&#8221; Benefits include more people starting small businesses, not just because it becomes easier to take care of basic needs, but because there is more money exchanging hands. It actually creates jobs by causing more money to be circulated: resulting in higher demand for services including luxury services that are harder to automate. Dubbed the &#8220;Freedom Dividend,&#8221; it&#8217;s money that goes to the shareholders of the US: the citizens. That&#8217;s why UBI has been fairly popular among many Libertarians, Republicans, and Democrats. It&#8217;s bi-partisan. <\/p>\n\n\n\n<p>Yang concedes that UBI is just one small step in solving the massive cultural and economic impacts that automation will have. But given that our current plan is to do nothing, it is a vastly attractive policy to me. Yang has a lot of other policies, some that I frankly disagree with. But his main focus is on UBI, which I think is something America needs to seriously consider. I&#8217;m hoping that his presence in the debates will force UBI to be addressed, and create change even if Yang is not elected president. <\/p>\n\n\n\n<p>If you&#8217;d like to donate to Andrew Yang, or read more about his policy stances, check out his website here: <a href=\"https:\/\/www.yang2020.com\/\">https:\/\/www.yang2020.com\/<\/a><\/p>\n\n\n\n<p>What do you think of Andrew Yang and UBI? Let me know in the comments below. Thanks for reading as always!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today, I donated to my first political campaign ever. I usually stay out of discussions of politics, especially online or among people I don&#8217;t know very well, since I&#8217;ve rarely had those discussions lead to anything productive. If anything, discussing politics usually comes down to two people not really listening to eachother, and walking away &#8230; <a title=\"Andrew Yang and UBI\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/03\/andrew-yang-and-ubi\/\" aria-label=\"More on Andrew Yang and UBI\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1195,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[9],"tags":[8],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/andrew-yang.jpeg?fit=474%2C474&ssl=1","jetpack-related-posts":[{"id":1836,"url":"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/","url_meta":{"origin":1194,"position":0},"title":"Board Game Designer, Artist, and Owner of Vindicated Entertainment. A Conversation with Vincent Baker","date":"July 7, 2019","format":false,"excerpt":"Vincent Baker is an impressive person in the board game industry. He started his path to becoming a board game entrepreneur while he was still in high school, and was nominated student entrepreneur of the year by YES Carolina in 2011. He's been busy since then, and you may have…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?fit=750%2C371&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1488,"url":"https:\/\/jorgezhang.com\/2019\/07\/shasn-rulebook-review-a-game-where-you-are-the-politician\/","url_meta":{"origin":1194,"position":1},"title":"Shasn Rulebook Review: A Game Where You are the Politician","date":"July 16, 2019","format":false,"excerpt":"Hey everyone. Today, I am here with a Rulebook Review of Shasn. This review will be split into two sections: First, I will talk about the rulebook quality. In the second section, I will talk a bit about the gameplay and theme. Please keep in mind that the first portion…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/shasn.jpg?fit=1030%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1808,"url":"https:\/\/jorgezhang.com\/2019\/07\/so-you-want-to-launch-a-board-game-on-kickstarter-read-this-first-2019\/","url_meta":{"origin":1194,"position":2},"title":"So, you want to launch a board game on Kickstarter? Read this first. (2019)","date":"July 3, 2019","format":false,"excerpt":"Hey everyone! Sorry for my one month hiatus from writing blog posts- during this time I have been managing the campaign for Daggers Highschool. Anyway, Kickstarter is what I want to talk about in this blog post. There's already a wealth of information on this topic online, and so for…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/cool-box-3.png?fit=960%2C540&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":1194,"position":3},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":1274,"url":"https:\/\/jorgezhang.com\/2019\/03\/building-an-audience\/","url_meta":{"origin":1194,"position":4},"title":"Building an Audience","date":"March 17, 2019","format":false,"excerpt":"Recently, I got a reminder to renew my website domain registration. That means that I have been working on building an audience for about a year now, and so today I thought I'd do an analysis of what has worked for me, and what has not. I will rate the…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/building-an-audeince.png?fit=1200%2C582&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1470,"url":"https:\/\/jorgezhang.com\/2019\/04\/what-makes-wingspan-soar-discussion-and-review\/","url_meta":{"origin":1194,"position":5},"title":"What makes Wingspan Soar? Discussion and Review","date":"April 9, 2019","format":false,"excerpt":"Hi everyone. Before I bring you this post, I wanted to mention that I am now a contributor for the Meeple Times. Because of that, you can also find this article onto the Meeple times website. You can find it here: https:\/\/meepletimes.com\/opinions\/what-makes-wingspan-soar-discussion-and-review\/ Hey everyone! Today I wanted to talk a…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/wingspan.jpg?fit=550%2C550&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1194"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1194"}],"version-history":[{"count":1,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1194\/revisions"}],"predecessor-version":[{"id":1196,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1194\/revisions\/1196"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1195"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1194"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1194"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1194"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}