{"id":1274,"date":"2019-03-17T18:05:06","date_gmt":"2019-03-17T23:05:06","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1274"},"modified":"2020-04-23T16:25:39","modified_gmt":"2020-04-23T21:25:39","slug":"building-an-audience","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/03\/building-an-audience\/","title":{"rendered":"Building an Audience"},"content":{"rendered":"\n<p>Recently, I got a reminder to renew my website domain registration. That means that I have been working on building an audience for about a year now, and so today I thought I&#8217;d do an analysis of what has worked for me, and what has not. I will rate the different things I have done based on time efficiency, the amount of reach, and interaction.<\/p>\n\n\n\n<p>As a short disclaimer, this is within the context of promoting my tabletop game, Daggers High, so the same things may not apply to others. As another disclaimer, I pretty much suck at building an audience and social media, and while I am getting better at it, you may want to get advice from someone who was more successful than I. Still, I hope you find this post interesting and informative.<\/p>\n\n\n\n<ol><li>Board Game Geek<\/li><li>Twitter<\/li><li>Personal Blog<\/li><li>Instagram<\/li><li>Facebook<\/li><li>Youtube<\/li><li>Reddit<\/li><li>Tabletop Simulator<\/li><\/ol>\n\n\n\n<h2>Board Game Geek<\/h2>\n\n\n\n<p>Time efficiency: 5\/5<br>Amount of reach: 4\/5<br>Interaction: 3\/5<\/p>\n\n\n\n<p>Board Game Geek tops the list because it requires almost no time investment, but generates followers interested in your board game. There are people who randomly browse new games, and so you can start getting people who are interested in your project to follow it without much investment. It is also easy to update your page, and each time you do you get Geek Gold :). In my experience, I unexpectedly ended up on a &#8220;Top 25 games to look out for in 2019&#8221; list just by adding Daggers High to BGG. I also was able to get in touch in reviewers who may be interested in such a game.<\/p>\n\n\n\n<h2>Twitter<\/h2>\n\n\n\n<p>Time efficiency: 4\/5<br>Amount of reach: 5\/5<br>Interaction: 2\/5<\/p>\n\n\n\n<p>Twitter is something I wish I set up 12 months ago. It&#8217;s amazingly easy to get connected with others in the board game community through Twitter because everyone is looking to help each other out. I literally just started using Twitter seriously about a month ago, and have since gained 87 followers (to a total of 147). While that is a small following, no other thing I have done on this list has generated nearly as many followers.<\/p>\n\n\n\n<p>That being said, and this could be because I haven&#8217;t gone to many conventions so I don&#8217;t actually know people on Twitter from meeting them face-to-face, interaction is generally lower. That means while I have a lot of followers compared to the other social media sites, they are less likely to interact with my posts. That&#8217;s not a knock on Twitter: I&#8217;m still learning how to use it, but so far it&#8217;s been an invaluable tool.<\/p>\n\n\n\n<h2>Personal Blog<\/h2>\n\n\n\n<p>Time efficiency: 1\/5<br>Amount of reach: 2\/5<br>Interaction: 3\/5<\/p>\n\n\n\n<p>So, I rated &#8220;personal blog&#8221; very low on basically all fronts, so why is it so high on this list? Well, the answer is I believe there are a lot of intangible benefits to running a personal blog\/website. It&#8217;s an amazing place to generate high level content, and somewhere to direct people to from the other social media sites. For example, when using Twitter, I often times will link a tweet to my personal blog. Thus, while the personal blog on its own will likely not be enough to build an audience, it can be invaluable when used with other social media sites.<\/p>\n\n\n\n<h2>Instagram<\/h2>\n\n\n\n<p>Time efficiency: 5\/5<br>Amount of reach: 3\/5<br>Interaction: 1\/5<\/p>\n\n\n\n<p>I have very little data on Instagram because I&#8217;ve only made 3 posts there, and basically put 0 effort into it. That being said, I&#8217;ve already gotten followers from within the board game community. I have no idea how they managed to find me, but I imagine that if I put a bit more time into Instagram it could potentially be a great place to build a following. That being said, because posting links is very troublesome with Instagram, I don&#8217;t think there is a lot of interaction. I intend to spend more time on Instagram in the future.<\/p>\n\n\n\n<h2>Facebook<\/h2>\n\n\n\n<p>Time efficiency: 2\/5<br>Amount of reach: 1\/5<br>Interaction: 3\/5<\/p>\n\n\n\n<p>I started trying to use Facebook to promote my game, but it&#8217;s honestly extremely difficult to find the opportunity to do so. I&#8217;ve joined about 10 or so groups on Facebook, and commenting here and there doesn&#8217;t seem to do anything. Nor does making a post in the group seem to generate long term followers. Many people ignore friend requests, and in general, I don&#8217;t think I&#8217;ve gotten anybody from Facebook to be interested in Daggers High at all other than people I was already friends with.<\/p>\n\n\n\n<p>That being said, if you are looking for advice, then Facebook is the way to go. People in Facebook groups will answer your questions basically immediately, and do so pretty bluntly and honestly. Many other creators also ask a lot of questions that are honestly an invaluable resource. As an added bonus, there are a lot of giveaways and interesting questions like &#8220;name your favorite theme&#8221; posts that can be entertaining. That&#8217;s why I currently use Facebook to find advice, but not so much in terms of promotion.<\/p>\n\n\n\n<h2>Youtube<\/h2>\n\n\n\n<p>Time efficiency: 0\/5<br>Amount of reach: 4\/5<br>Interaction: 1\/5<\/p>\n\n\n\n<p>So, when I was in middle school I played a lot of Yu-Gi-Oh!, and I would film myself playing online and post videos about it. A few of my videos were actually really popular, one of them getting 18k views, and I overall got about 100 subscribers. So my plan was to use this following to try and get engagement on Daggers High. Unfortunately, I don&#8217;t think many of my Yu-Gi-Oh! followers are interested in tabletop games, so my plan didn&#8217;t really pan out.<\/p>\n\n\n\n<p>The biggest issue is time efficiency. It takes soooo long to make a good video on Youtube, and even then it doesn&#8217;t get a lot of interaction unless you make a lot of videos. I have a ton of respect for other Youtube creators, because it really is much more difficult than it seems.<\/p>\n\n\n\n<h2>Reddit<\/h2>\n\n\n\n<p>Time efficiency: 3\/5<br>Amount of reach: 1\/5<br>Interaction: 3\/5<\/p>\n\n\n\n<p>Reddit is very much like Facebook, but you get less feedback in general. Now, this could be because I have very little karma, and also because I&#8217;m a noob at using Reddit. But personally, I haven&#8217;t found it to be very worthwhile from a time investment standpoint. <\/p>\n\n\n\n<h2>Tabletop Simulator<\/h2>\n\n\n\n<p>Time efficiency: 2\/5<br>Amount of reach: 1\/5<br>Interaction: 0\/5<\/p>\n\n\n\n<p>Alright, this isn&#8217;t really fair, because I haven&#8217;t promoted myself on Tabletop Simulator at all. I haven&#8217;t even actually played a game on Tabletop Simulator really. That being said, just putting a game on Tabletop Simulator took a lot of work, and it seemed pretty clunky and difficult to use. I kind of abandoned it and was hoping to see if people would discover it and start playing Daggers High online, but so far that has not happened. I&#8217;ve seen it being recommended as a place to put your game, but honestly, most people just aren&#8217;t willing to put in the time investment to check it out, and it hasn&#8217;t worked out for me.<\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>Overall, I think using a mix of all of these social media sites is a good idea. If I had to do it all over again, I would have started my presence on Social Media about 9 months earlier, and I would have also focused more on Board Game Geek and Twitter, and a little bit less on my personal blog. Over the summer I had the goal of making a blog post every single day, and while I managed to do that for a month and a half, it was very ineffective because of my lack of social media presence elsewhere.<\/p>\n\n\n\n<p>Anyone have tips for building an audience that they would like to share? Are my rankings wrong? What huge mistakes have I made? Let me know in the comments below, and thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Recently, I got a reminder to renew my website domain registration. That means that I have been working on building an audience for about a year now, and so today I thought I&#8217;d do an analysis of what has worked for me, and what has not. I will rate the different things I have done &#8230; <a title=\"Building an Audience\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/03\/building-an-audience\/\" aria-label=\"More on Building an Audience\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1275,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[11],"tags":[52,54],"jetpack_featured_media_url":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/building-an-audeince.png?fit=1256%2C609&ssl=1","jetpack-related-posts":[{"id":1532,"url":"https:\/\/jorgezhang.com\/2019\/04\/how-to-become-a-board-game-reviewer\/","url_meta":{"origin":1274,"position":0},"title":"How to become a Board Game Reviewer","date":"April 20, 2019","format":false,"excerpt":"You can be a board game reviewer who gets sent free games from board game companies to review, even if you have very little or no tabletop game experience. But you might not want to after you read this article. Part One: Adding Value The first thing you need to…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/reviewer.jpg?fit=640%2C347&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1419,"url":"https:\/\/jorgezhang.com\/2019\/03\/yearly-review-102nd-post\/","url_meta":{"origin":1274,"position":1},"title":"Yearly Review (102nd post!)","date":"March 31, 2019","format":false,"excerpt":"Hey everyone! It's the 102nd post of this blog, which is absolutely mind-boggling to think about. That means that in the past year, I've been writing roughly 1 blog post for every 3 days! So today, I thought that I would share some of the statistics with you, which I…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-31-at-12.03.13-PM.png?fit=1051%2C417&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1283,"url":"https:\/\/jorgezhang.com\/2019\/03\/shadow-era-ccg-review1\/","url_meta":{"origin":1274,"position":2},"title":"Shadow Era CCG Review","date":"March 20, 2019","format":false,"excerpt":"Hey everyone! I am a big fan of Shadow Era, the online collectible card game, and so I wanted to share the game with you all and a few reasons why I really like the game so much. As a disclaimer, I am currently on the Shadow Era Volunteer Design…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-18-at-8.10.15-PM.png?fit=1037%2C811&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1281,"url":"https:\/\/jorgezhang.com\/2019\/03\/a-brief-guide-to-board-game-geek\/","url_meta":{"origin":1274,"position":3},"title":"A Brief Guide to Board Game Geek","date":"March 20, 2019","format":false,"excerpt":"This post was inspired by Benjamin, who asked about tips for using Board Game Geek from the perspective of a game designer. Board Game Geek is super important for game designers to use, but also very unintuitive. It took me a very long time to get used to the site,…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-18-at-8.58.23-PM.png?fit=1200%2C684&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":720,"url":"https:\/\/jorgezhang.com\/2018\/08\/twilight-imperium-3rd-edition-review\/","url_meta":{"origin":1274,"position":4},"title":"Twilight Imperium 3rd Edition Review","date":"August 14, 2018","format":false,"excerpt":"I've talked about other board games before, but this is my first official board game review. Today I will be reviewing the longest board game I have ever played: Twilight Imperium 3rd Edition. I played in a five player game that took place over the course of 2 days and a…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1629,"url":"https:\/\/jorgezhang.com\/2019\/05\/colour-chess-rulebook-review\/","url_meta":{"origin":1274,"position":5},"title":"Colour Chess Rulebook Review","date":"May 7, 2019","format":false,"excerpt":"Colour Chess is a great variant that I enjoy even more than base Chess. As it turns out, \"Colour Chess\" is actually about 7 unique chess variants all packed into one. The flexibility of the components allow you to create non-standard boards and use non-standard chess pieces. If that was…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/colour-chess.jpg?fit=579%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1274"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1274"}],"version-history":[{"count":4,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1274\/revisions"}],"predecessor-version":[{"id":1279,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1274\/revisions\/1279"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1275"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1274"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1274"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1274"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}