{"id":1532,"date":"2019-04-20T23:14:11","date_gmt":"2019-04-21T04:14:11","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1532"},"modified":"2020-04-23T16:25:08","modified_gmt":"2020-04-23T21:25:08","slug":"how-to-become-a-board-game-reviewer","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/04\/how-to-become-a-board-game-reviewer\/","title":{"rendered":"How to become a Board Game Reviewer"},"content":{"rendered":"\n<p>You can be a board game reviewer who gets sent free games from board game companies to review, even if you have very little or no tabletop game experience. But you might not want to after you read this article.<\/p>\n\n\n\n<h4>Part One: Adding Value<\/h4>\n\n\n\n<p>The first thing you need to think about is how you are adding value to a board game creator. Adding value can be done in a few ways:<\/p>\n\n\n\n<ol><li><strong>Differentiation<\/strong>. This refers to what makes your reviews unique. A lot of the times, the answer is focusing on a particular type of game: solo games, euro games, family games, etc. For me, I saw that there wasn&#8217;t anybody writing about rulebook quality. I got started by reading rulebook PDFs for free via Twitter via &#8220;Rulebook Preview&#8221; series. This gave me enough credibility to start asking to review physical copies of each game for reviews that I call &#8220;Rulebook Reviews.&#8221; <\/li><li><strong>Audience<\/strong>. How many people are reading your stuff? I think that this sounds a lot more daunting than it really is. The truth is that the board game hobby is tiny, and so most reviewers have small audiences. That&#8217;s why a lot of the time, your audience is only part of the value equation. I&#8217;ll talk about this a bit more in the next section.<\/li><li><strong>Track Record<\/strong>. How many games have you reviewed in the past? I think that this offers a lot of value as it lets people compare your thoughts on Game A vs. Game B. This is pretty important as it gives people a better idea of what games you like, and what games you would not like so much.<\/li><\/ol>\n\n\n\n<p>The cost to start a blog, youtube channel, twitter, instagram, etc. is roughly $0, but building an audience can be challenging. For tips, you can refer to <a href=\"https:\/\/jorgezhang.com\/2019\/03\/17\/building-an-audience\/\"><strong>this<\/strong><\/a> article about building an audience.<\/p>\n\n\n\n<h4>Part Two: Competition<\/h4>\n\n\n\n<p>If you want to be a board game reviewer, you are going to have some stiff competition. There are hundreds of blogs, podcasts, and youtube channels for board game reviewers. Luckily, the board gaming hobby is quite small, with the largest reviewers having no more than a couple hundred thousand followers. That means that the barriers to entry are still low. Another thing working in your favor is the sheer number of new board games coming out. Even the largest channels with full-time creators cannot keep up with the high demand. That&#8217;s why a lot of games can&#8217;t find reviewers or those willing to do a Kickstarter Preview. This has gotten especially noticeable at the top. For example, the Dice Tower has around 200,000,000 subscribers as of this post, and they charge about $700 to preview a kickstarter game. That&#8217;s a lot of money for a board game buisiness where only 17% of newbie designers who sell their completed board game to a publisher will receive $1000 advance or more. These designers also tend to only receive about 5-8% of the wholesale price per copy sold- not a lot when you are talking about a product where a 5000 copy print run is considered a huge success (<a href=\"https:\/\/cardboardedison.com\/reports\/\">source<\/a>).<\/p>\n\n\n\n<p>Is it worth it for new creators to put down that much money up front for their game? In my opinion, that&#8217;s debatable. The reason Kickstarter Previews cost so much is likely due to high demand rather than value. Many creators may decide to move the cost of the preview onto their backers, but this is definitely risky as I&#8217;ve seen Kickstarter projects with Dice Tower previews flop. That&#8217;s why you aren&#8217;t really competing with these larger reviewers. As a tiny reviewer who doesn&#8217;t charge any money to preview or review a game, a lot of smaller or newer board game companies will likely be interested in working with you. <\/p>\n\n\n\n<p>I know that I have been using review and preview pretty interchangeably, so I wanted to clear that up. Kickstarter Previews generally cost money while reviews are generally free. That being said, due to the sheer number of board games coming out, there is plenty of room for a niche reviewer to get a copy to review.<\/p>\n\n\n\n<h4>Part Three: Advertise Yourself<\/h4>\n\n\n\n<p>So, how do you actually start? You could theoretically start reviewing games in your collection to build a track record, which would then attract publishers to you. There&#8217;s a much faster way that I ended up using and will talk about in this article, though it comes with it&#8217;s own downsides that I will mention as well.<\/p>\n\n\n\n<p>You are going to want to join this Facebook group: <a href=\"https:\/\/www.facebook.com\/groups\/boardgamereviewer\/\">https:\/\/www.facebook.com\/groups\/boardgamereviewer\/<\/a><\/p>\n\n\n\n<p>What is this group? Well, for the purposes of finding games to review, it is a place where a lot of small or completely new game publishers go to try and find reviewers or previewers. These publishers will make a post asking for reviewers, and if you are interested you can simply comment on that post saying that you would be interested. This comes with it&#8217;s own downsides, but I&#8217;ve found it to be consistently a good place to find new games to review.<\/p>\n\n\n\n<p>This may be defunct, but another way to try and find games to review is through Board Game Atlas&#8217; program here: <a href=\"https:\/\/www.boardgameatlas.com\/forum\/i1oLgr8lrE#CRxrd5AQaH\">https:\/\/www.boardgameatlas.com\/forum\/i1oLgr8lrE#CRxrd5AQaH<\/a>. The idea is that the list of 70+ (or however many it is now) reviewers would get an email every month with a list of games that board game designers want to get reviewed. I used this from the game designers end to get matched with Gaming Trend and Meeple Mechanics, which worked out pretty well!<\/p>\n\n\n\n<h4>Part Four: Why You Might Not Want to Review Games<\/h4>\n\n\n\n<p>I only started reviewing games a couple of months ago, and there are a lot of downsides that I didn&#8217;t anticipate when I first got into it. For me, I was mostly motivated by being able to help other game developers get their games reviewed, and getting cool unreleased games was a big plus. That being said, here are a few things I wish I knew before I started:<\/p>\n\n\n\n<ol><li><strong>Games you don&#8217;t enjoy<\/strong>. I find that it is very suboptimal to be sent a game that I don&#8217;t like. That&#8217;s why I only request games that I know I&#8217;ll be very likely to enjoy. Unfortunately, this hasn&#8217;t been foolproof, and there have been times where I received a game that I didn&#8217;t like that much. It is not a fun situation to be in when you have to tell the person who sent you a copy of their game that they spent several months\/years developing that you didn&#8217;t really like their game.<\/li><li><strong>Scheduling<\/strong>. A lot of companies will request that you not release content until their Kickstarter or until a certain date. That&#8217;s been pretty annoying for me to deal with at times, because it means I will often be waiting for weeks before I can release content. It makes having a schedule for blog posts very difficult.<\/li><li><strong>Time<\/strong>. It takes a ton of time to play a game and then make a review, and it ends up being a chore in many ways. Of course, this can go the other way when you get sent a hidden gem game that is simply fantastic- in those cases, reviewing games can be highly rewarding.<\/li><li><strong>Finding Gaming Friends<\/strong>. Most games require several people to play, and time playing tabletop games with friends can be very limited. To spend that valuable time playing prototype game after prototype game can feel like a waste, especially if the games turn out to be not very good. <\/li><\/ol>\n\n\n\n<p>I am very grateful that I am able to review games in the first place. It is really awesome to get a game that I love and be able to write great things about it. <\/p>\n\n\n\n<h4>Overall<\/h4>\n\n\n\n<p>It&#8217;s pretty easy to become a board game reviewer these days, but very difficult to keep reviewing games. In the end, it takes quite a lot of time for not much reward. That being said, if taking a look at unreleased or newly released games appeals to you, or if you want to support board game designers, I&#8217;d encourage you to give board game reviewing a try. After all, there&#8217;s a lot of demand for reviewers right now, so it is a good time to start.<\/p>\n\n\n\n<p>Would you want to be a board game reviewer? Let me know in the comments below, and thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You can be a board game reviewer who gets sent free games from board game companies to review, even if you have very little or no tabletop game experience. But you might not want to after you read this article. Part One: Adding Value The first thing you need to think about is how you &#8230; <a title=\"How to become a Board Game Reviewer\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/04\/how-to-become-a-board-game-reviewer\/\" aria-label=\"More on How to become a Board Game Reviewer\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1533,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[11],"tags":[52,54],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/reviewer.jpg?fit=640%2C347&ssl=1","jetpack-related-posts":[{"id":1488,"url":"https:\/\/jorgezhang.com\/2019\/07\/shasn-rulebook-review-a-game-where-you-are-the-politician\/","url_meta":{"origin":1532,"position":0},"title":"Shasn Rulebook Review: A Game Where You are the Politician","date":"July 16, 2019","format":false,"excerpt":"Hey everyone. Today, I am here with a Rulebook Review of Shasn. This review will be split into two sections: First, I will talk about the rulebook quality. In the second section, I will talk a bit about the gameplay and theme. Please keep in mind that the first portion…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/shasn.jpg?fit=1030%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1205,"url":"https:\/\/jorgezhang.com\/2019\/03\/rulebook-review-mardi-gras-cover-blown-planetary-destruction-and-domains\/","url_meta":{"origin":1532,"position":1},"title":"Rulebook Preview (Mardi Gras, Cover Blown, Planetary Destruction, and Domains)","date":"March 7, 2019","format":false,"excerpt":"Recently I have started to preview rulebooks for free! I'm doing it since I enjoy reading rulebooks, but also to share some of these amazing games that haven't yet made it to the market. The people making these games are other game designers just like me, and as someone who…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-07-at-4.23.17-PM.png?fit=647%2C408&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1311,"url":"https:\/\/jorgezhang.com\/2019\/03\/rulebook-review-the-institute-for-magical-arts\/","url_meta":{"origin":1532,"position":2},"title":"Rulebook Review: The Institute for Magical Arts","date":"March 20, 2019","format":false,"excerpt":"Hey everyone! While this post shares the same title as my previous series also called \"Rulebook Reviews,\" it is different in a major way: this game has been published and available to purchase. In fact, I have decided to rename my previous series to \"Rulebook Previews\" as they are mostly…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/IMG_20190205_172436.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1629,"url":"https:\/\/jorgezhang.com\/2019\/05\/colour-chess-rulebook-review\/","url_meta":{"origin":1532,"position":3},"title":"Colour Chess Rulebook Review","date":"May 7, 2019","format":false,"excerpt":"Colour Chess is a great variant that I enjoy even more than base Chess. As it turns out, \"Colour Chess\" is actually about 7 unique chess variants all packed into one. The flexibility of the components allow you to create non-standard boards and use non-standard chess pieces. If that was…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/colour-chess.jpg?fit=579%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1361,"url":"https:\/\/jorgezhang.com\/2019\/03\/mma-combat-game-rulebook-preview\/","url_meta":{"origin":1532,"position":4},"title":"MMA Combat Game Rulebook Preview","date":"March 24, 2019","format":false,"excerpt":"Hey everyone! This post is a Rulebook Preview for the MMA Combat Game. The point of this series is to highlight new unpublished games, and also hopefully highlight the importance of a great rulebook. Because this game is unpublished, I'll go over some of the things I liked and disliked…","rel":"","context":"In &quot;Game Design&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-23-at-9.40.06-PM.png?fit=577%2C784&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1671,"url":"https:\/\/jorgezhang.com\/2019\/05\/romance-of-the-nine-empires-rulebook-review\/","url_meta":{"origin":1532,"position":5},"title":"Romance of the Nine Empires: Rulebook Review","date":"May 13, 2019","format":false,"excerpt":"Romance of the Nine Empires is an LCG (Living Card Game), which means that unlike something like Magic the Gathering, the cards you buy are in pre-determined sets. This is really great for the wallet, as it means that you can guarantee a complete collection with the cost of a…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/romance-of-the-nine-empires-box-cover.jpg?fit=598%2C600&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1532"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1532"}],"version-history":[{"count":1,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1532\/revisions"}],"predecessor-version":[{"id":1534,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1532\/revisions\/1534"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1533"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1532"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1532"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1532"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}