{"id":1671,"date":"2019-05-13T16:59:25","date_gmt":"2019-05-13T16:59:25","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1671"},"modified":"2019-05-13T17:02:36","modified_gmt":"2019-05-13T17:02:36","slug":"romance-of-the-nine-empires-rulebook-review","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/05\/romance-of-the-nine-empires-rulebook-review\/","title":{"rendered":"Romance of the Nine Empires: Rulebook Review"},"content":{"rendered":"\n<p>Romance of the Nine Empires is an LCG (Living Card Game), which means that unlike something like Magic the Gathering, the cards you buy are in pre-determined sets. This is really great for the wallet, as it means that you can guarantee a complete collection with the cost of a single board game. I actually thought it was a CCG when I picked it up, as on the box it said that the 5 included decks were &#8220;World Championship&#8221; decks. Apparently, the reason the game bills itself as a collectible card game is due to a movie called <em>The Gamers: Hands of Fate<\/em>, which features a fictitious world championships for the fictitious collectible card game, Romance of the Nine Empires. Anyway, if I haven&#8217;t lost you already, just know that this is a self-contained boxed set with pre-made decks.<\/p>\n\n\n\n<h2>Gameplay<\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img data-attachment-id=\"1672\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/05\/romance-of-the-nine-empires-rulebook-review\/img_20190430_210137\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?fit=4000%2C3000&amp;ssl=1\" data-orig-size=\"4000,3000\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2.2&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;Mi A2 Lite&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1556658097&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;3.82&quot;,&quot;iso&quot;:&quot;640&quot;,&quot;shutter_speed&quot;:&quot;0.05&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"IMG_20190430_210137\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?fit=1024%2C768&amp;ssl=1\" loading=\"lazy\" width=\"4000\" height=\"3000\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?fit=640%2C480\" alt=\"\" class=\"wp-image-1672\" srcset=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?w=4000&amp;ssl=1 4000w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?resize=300%2C225&amp;ssl=1 300w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?resize=768%2C576&amp;ssl=1 768w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?resize=1024%2C768&amp;ssl=1 1024w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?resize=1800%2C1350&amp;ssl=1 1800w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?resize=576%2C432&amp;ssl=1 576w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?w=2400&amp;ssl=1 2400w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190430_210137.jpg?w=3600&amp;ssl=1 3600w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><figcaption>Unique gameplay!<\/figcaption><\/figure>\n\n\n\n<p>So, this is a Rulebook Review, but I decided to start with Gameplay. That&#8217;s because I&#8217;m a huge card game fan, and there&#8217;s a lot of really great stuff that goes on in Romance of the Nine Empires that is very unique that I need to share! Now, before I say anything else, know that the game borrows mechanically from <em>Legend of the Burning Sands<\/em>&nbsp;CCG, and so there are other games that offer similar experiences. That being said, this was my first exposure to it, so let&#8217;s jump right in!<\/p>\n\n\n\n<h4>No &#8220;Turns&#8221;<\/h4>\n\n\n\n<p>In most card games, players take long turns summoning allies, attacking each-other, summoning items, and whatever else, which allows for really broken combos and (potentially) waiting a long time for your opponent to finish. Not in Romance of the Nine Empires. In this game, players take turns being &#8220;The Ordained,&#8221; which is just a fancy name for the first player. This player takes 1 action, then the next player takes 1 action, and so on. I really like this format, because it can create a sense of urgency in your actions (I really need to summon this ally before my opponent declares an attack, even though I want to play this card first to draw more cards), and allows you to predict your opponents&#8217; plan and try to disrupt it. Players can pass their turn, but if both players pass consecutively then the season ends. There are 4 seasons: Spring, Summer, Autumn, and Winter. Each phase has different rules and allows you to do different things. The most important phases are probably Summer and Autumn, and I absolutely love the dichotomy between the two. In the Summer Phase you can launch 1 attack as an action against your opponent, hoping to blow up their stuff. In the Autumn Phase, you can launch 1 raid as an action against your opponent, hoping to steal their food. <\/p>\n\n\n\n<h4>Multiple Win Conditions<\/h4>\n\n\n\n<p>Because you can win by destroying all of your opponent&#8217;s castles, or by reducing their food to &#8220;0,&#8221; (thus starving them) this presents multiple win conditions. There&#8217;s yet another win condition, which is gaining enough popularity by taking on dangerous and heroic quests.<\/p>\n\n\n\n<h4>Complex Battles<\/h4>\n\n\n\n<p>I love, love, love combat in this game. In most card games, combat comes down to who deals the most damage. In Romance of the Nine Empires, it comes down to a delicious mix of having the initiative, assigning the correct units to each battle, playing tactic cards at the right times, and choosing whether to sacrifice your units or (if you are on defense) to sacrifice your castles.<\/p>\n\n\n\n<h4>Pre-built and balanced decks<\/h4>\n\n\n\n<p>I thought that the decks were generally pretty fair, and I especially loved the diversity in the decks. Each of the 5 decks tries to win in a completely different way: from stalling, raiding, attacking, buffing allies with items, and questing. <\/p>\n\n\n\n<h2>Organization – 4\/5<\/h2>\n\n\n\n<p><em>How easy is it to look up a rule? Can you easily find the section you are looking for? Is the rulebook organized in a logical order so that everything makes sense during the first read-through?<\/em><\/p>\n\n\n\n<p>I thought that it was pretty difficult to look up a rule, and had to rely a little bit on Board Game Geek to find out specific answers to edge-case rulings. Especially at first, I found that it was tough to decipher what the card text meant. This all being said, I think this is primarily due to the fact that the combat system was completely new to me. Once I forced myself through the first 2-3 games, things suddenly became very clear to me, and I was able to answer my own questions! By now I&#8217;ve probably played around a dozen games, and had I only played that first game I would have been a lot more critical of the rules. To be completely fair to the writers, it&#8217;s hard to describe something that your reader is entirely unfamiliar with, and as I became more accustomed to the game I actually started to feel that the rules were very well organized. I also really appreciated the starter guide, which instructed you to play the Ord vs. the Malchior, and to skip the Autumn phase. This helped when it came down to read the real rules, and made reading through them the first time much easier.<\/p>\n\n\n\n<h2>Clarity – 4\/7<\/h2>\n\n\n\n<p><em>How easy is it to understand the rules? Is the rulebook needlessly complex or not detailed enough? Could the rules be interpreted in multiple valid ways? Were there plenty of examples and images?<\/em><\/p>\n\n\n\n<p>As I mentioned in the previous section, the rules were sometimes very tough to decipher at first, and while this may be due to the complex gameplay, I think there could have been a couple things that would have made it a lot easier to get through the first few plays. Firstly, I think that it would have been a good idea to describe a little bit of the complex strategy. One of the things I really struggled with at first was understanding why you would want to have the first action in a battle, and some of the complex interactions when it came to defensive strategy (such as assigning multiple units to deal even more damage and get around immunity). The rulebook did provide examples of combat, but it took me many games to finally realize that I needed to change my approach to battling. Secondly, I think that the rules were a little bit light on graphics and heavy on text. I found that a bit unusual for a card game. Overall though, I thought that the rulebook struck a good balance between too complex and not detailed enough, but would have been helped by more examples, images, and clearer card text.<\/p>\n\n\n\n<h2>Teaching the Game – 2\/3<\/h2>\n\n\n\n<p><em>Does the rulebook help returning players to quickly relearn the game and explain it to others? Is it easy to determine any changes to the game based on player count? What about player aids?<\/em><\/p>\n\n\n\n<p>The starter guide was an invaluable resource, and the same tips that applied to your first game could be applied to teaching the game (for example, starting with the Ord vs. Malchior, and not explaining the Autumn phase until after mastering the base game). This being said, Player aids would have been nice to have, and the higher player count games felt glossed-over in the rules. I didn&#8217;t actually try the multi-player game, but apparently there are a few changes to the game, including alliances? It sounds very interesting and I do want to try it at some point, but the rules could definitely do a better job of summing up the differences between the 2 player and 3+ player games.<\/p>\n\n\n\n<h2>Overall – 10\/15<\/h2>\n\n\n\n<p><em>A score of 0-6 would be an unintelligible rulebook. A score of 7-9 is a rulebook that is mediocre and likely requires further research to learn all the rules, such as watching a how to play video. A score of 10-12 is a rulebook sufficient to stand on its own legs. A score of 13-15 is an excellent rulebook that has next to no issues and has admirable qualities that go above and beyond that add to the game, theme, or overall experience.<\/em><\/p>\n\n\n\n<p>A score of 10 is not bad, and I think it is appropriate as I didn&#8217;t feel like I had to overly rely on online resources to figure out how to play. I think that the game gets a bad rap for a bad rulebook, as I saw a lot of other users complaining about the rules being impossible to get through. The issue these people are having is probably due to the unique mechanics behind the game rather than a poorly written rulebook. That being said, I definitely think that the rules could have been improved to be more approachable to those who are less accustomed to collectible or living card games. I want to reiterate that a rulebook review score has no bearing on my opinion of the gameplay, because I think that the gameplay is phenomenal! This made struggling through the rules well worth it in the end.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img data-attachment-id=\"1673\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/05\/romance-of-the-nine-empires-rulebook-review\/img_20190501_215420\/#main\" data-orig-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?fit=579%2C772&amp;ssl=1\" data-orig-size=\"579,772\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"IMG_20190501_215420\" data-image-description=\"\" data-medium-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?fit=225%2C300&amp;ssl=1\" data-large-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?fit=579%2C772&amp;ssl=1\" loading=\"lazy\" width=\"579\" height=\"772\" src=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?resize=579%2C772&#038;ssl=1\" alt=\"\" class=\"wp-image-1673\" srcset=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?w=579&amp;ssl=1 579w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?resize=225%2C300&amp;ssl=1 225w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/IMG_20190501_215420.jpg?resize=576%2C768&amp;ssl=1 576w\" sizes=\"(max-width: 579px) 100vw, 579px\" data-recalc-dims=\"1\" \/><figcaption>Winning with my favorite deck: Holden<\/figcaption><\/figure>\n\n\n\n<p>What is your favorite legacy card game? Let me know in the comments below. Thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Romance of the Nine Empires is an LCG (Living Card Game), which means that unlike something like Magic the Gathering, the cards you buy are in pre-determined sets. This is really great for the wallet, as it means that you can guarantee a complete collection with the cost of a single board game. I actually &#8230; <a title=\"Romance of the Nine Empires: Rulebook Review\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/05\/romance-of-the-nine-empires-rulebook-review\/\" aria-label=\"More on Romance of the Nine Empires: Rulebook Review\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1674,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[6],"tags":[],"jetpack_featured_media_url":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/romance-of-the-nine-empires-box-cover.jpg?fit=598%2C600&ssl=1","jetpack-related-posts":[{"id":1488,"url":"https:\/\/jorgezhang.com\/2019\/07\/shasn-rulebook-review-a-game-where-you-are-the-politician\/","url_meta":{"origin":1671,"position":0},"title":"Shasn Rulebook Review: A Game Where You are the Politician","date":"July 16, 2019","format":false,"excerpt":"Hey everyone. Today, I am here with a Rulebook Review of Shasn. This review will be split into two sections: First, I will talk about the rulebook quality. In the second section, I will talk a bit about the gameplay and theme. Please keep in mind that the first portion…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/shasn.jpg?fit=1030%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1283,"url":"https:\/\/jorgezhang.com\/2019\/03\/shadow-era-ccg-review1\/","url_meta":{"origin":1671,"position":1},"title":"Shadow Era CCG Review","date":"March 20, 2019","format":false,"excerpt":"Hey everyone! I am a big fan of Shadow Era, the online collectible card game, and so I wanted to share the game with you all and a few reasons why I really like the game so much. As a disclaimer, I am currently on the Shadow Era Volunteer Design…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-18-at-8.10.15-PM.png?fit=1037%2C811&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1361,"url":"https:\/\/jorgezhang.com\/2019\/03\/mma-combat-game-rulebook-preview\/","url_meta":{"origin":1671,"position":2},"title":"MMA Combat Game Rulebook Preview","date":"March 24, 2019","format":false,"excerpt":"Hey everyone! This post is a Rulebook Preview for the MMA Combat Game. The point of this series is to highlight new unpublished games, and also hopefully highlight the importance of a great rulebook. Because this game is unpublished, I'll go over some of the things I liked and disliked…","rel":"","context":"In &quot;Game Design&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/03\/Screen-Shot-2019-03-23-at-9.40.06-PM.png?fit=577%2C784&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1385,"url":"https:\/\/jorgezhang.com\/2019\/04\/rulebook-preview-3-coreball-tasty-humans-forks-and-wizards-of-roygbiv\/","url_meta":{"origin":1671,"position":3},"title":"Rulebook Preview 3: CoreBall, Tasty Humans, Forks, and Wizards of Roygbiv","date":"April 21, 2019","format":false,"excerpt":"Hey everyone! Today I am back with another installment of my Rulebook Preview series. In this series, I take a look at tabletop games that have not yet been released. I have not played these games, but simply reviewed the rulebooks (hence Rulebook Preview). Anyway, without further ado, here are…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/rulebook-preview-3.jpg?fit=601%2C600&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1724,"url":"https:\/\/jorgezhang.com\/2019\/06\/rulebook-preview-7-paupers-ladder-empty-space-explorers-outpost-jazz-nights\/","url_meta":{"origin":1671,"position":4},"title":"Rulebook Preview 7: Pauper's Ladder, Empty Space Explorers, Outpost 18, Jazz Nights","date":"June 2, 2019","format":false,"excerpt":"Hey everyone! Today I am back with another installment of my Rulebook Preview series. In this series, I take a look at tabletop games that have not yet been released or have been very recently released. I have not played these games, but simply reviewed the rulebooks (hence Rulebook Preview).…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/06\/rulebook-preview-7.png?fit=601%2C600&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1712,"url":"https:\/\/jorgezhang.com\/2019\/05\/danger-the-game-a-review\/","url_meta":{"origin":1671,"position":5},"title":"Danger! The Game: A Review","date":"May 22, 2019","format":false,"excerpt":"Hey everyone! This game appeared in my Rulebook Preview series, which you can find here. The creators were kind enough to send a copy so that I could go ahead and properly review the game. I considered doing a Rulebook Review, but since I already touched on the rules in…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/danger-the-game.png?fit=900%2C506&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1671"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1671"}],"version-history":[{"count":2,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1671\/revisions"}],"predecessor-version":[{"id":1676,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1671\/revisions\/1676"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1674"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1671"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1671"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1671"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}