{"id":1786,"date":"2019-06-06T03:11:26","date_gmt":"2019-06-06T08:11:26","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1786"},"modified":"2020-04-23T16:16:27","modified_gmt":"2020-04-23T21:16:27","slug":"interview-with-the-friendly-boardgamer","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","title":{"rendered":"Interview with the Friendly Boardgamer"},"content":{"rendered":"\n<p>The Friendly Boardgamer just released an interview featuring me! You can check out the original article here:<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-link is-provider-the-friendly-boardgamer\"><div class=\"wp-block-embed__wrapper\">\nhttps:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/\n<\/div><\/figure>\n\n\n\n<p>Here is the article:<\/p>\n\n\n\n<p>This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about the gateway game Diplomacy, well….it was a gateway game for Jorge. His game Daggers Highschool is currently on <a href=\"https:\/\/www.kickstarter.com\/projects\/975340335\/daggers-highschool?ref=nav_search&amp;result=project&amp;term=daggers%20\">Kickstarter<\/a> and is due to finish on 27th June.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/thefriendlyboardgamer.files.wordpress.com\/2019\/06\/daggers_high_box_cover-2.jpg?w=1200\" alt=\"\" class=\"wp-image-728\" data-recalc-dims=\"1\"\/><\/figure>\n\n\n\n<p><strong>Can you tell me a little bit about yourself to get us started?<\/strong><\/p>\n\n\n\n<p>Sure! I’ve been a game designer and a blogger for 1-2 years now. I’ve made several games, though I’m still working on publishing my first one, Daggers High. The games I design are usually heavily based on real life. For example, Daggers high is about being a high school student at an elite high school trying to get into the best University. It matches my own experiences in high school, which is when I first started designing games. Another example is Lord of Colors, a game based on mixing and making colors using cyan, magenta, and yellow pigments. It’s based on the CMYK color system.&nbsp;<br><br>My blog is a personal blog, but I’ve expanded it to include game reviews and game design notes. I do Rulebook Reviews, as I noticed that rulebook quality is often times an afterthought with games, but is such an important part for any game. I also talk about (and occasionally make) escape room puzzles as another hobby. I work as a private tutor for high school students, which gives me a flexible schedule to work on my projects. I’m currently on a gap year after high school to work on my game designs, and I plan on attending Georgetown university this fall. Also, I forgot to mention this earlier, but I currently live near Chicago, in Illinois<\/p>\n\n\n\n<p><strong>Have board games been part of your life since childhood, or is this a relatively new interest for you?<\/strong><\/p>\n\n\n\n<p>When I was very young, I was into more of a roleplaying experience. I didn’t know it at the time, but the games my friends and I would play during recess or after school were very similar to RPGs like dungeons and dragons. I only started getting into board games in eighth grade, with my first real hobby board game being Diplomacy.&nbsp;<br><br>I know that a lot of people don’t consider that a great gateway game as it takes forever to play and has very confrontational elements, but I really fell in love with it. I’ve played over a hundred online games and been to local tournaments for the game, and started a high school club solely for Diplomacy. Attending these tournaments exposed me to a lot of other board games as well, such as twilight struggle or terraforming mars. Seeing how diverse and interesting board games could be is a large part of my inspiration for making them.<\/p>\n\n\n\n<p><strong>Not your typical gateway game but people get in to the hobby in many different ways and it is great to hear people’s stories.<br><br>So can you give us any more information about Daggers High, core mechanisms and style of gameplay?<\/strong><\/p>\n\n\n\n<p>Sure. Daggers High is a Euro game based on the idea that you and your peers all want to get into the highest ranked University in the world (the in-game name is Docufide University). If you’re familiar with the recent scandals involving very wealthy parents bribing and cheating their way into the top universities, the game goes a step further and really satiricalizes the whole process by exposing how game-able and trivial it can be at times. The main mechanic is action point allocation from drafting cards with different action point values and effects. Many of these effects can have very interactive abilities, but I wouldn’t necessarily categorize them as “Take That” as for the most part, they are inconveniences rather than cards that prevent a player from executing their strategy. This let’s the game have very tight gameplay right until the end, as the players can collaborate to try and stop a runaway leader. There’s a lot more to the game as well: like a push-your-luck stress mechanic that causes players who don’t relax enough to have a mental breakdown. Or the integrity and happiness resources that give you penalties for spending them but let you gain game changing abilities. Throughout the game you collect favors with your teachers, make friends, and obtain knowledge from studying (called stats). You spend these “resources” to get recommendation letters, club leadership roles, higher grades, essays, and more.&nbsp;<br><br>There’s a lot in each game (over 150 unique cards), and I’m currently very happy with the way it’s turned out as I feel it has captured all the crucial elements of the competitive high school experience without being too bloated or long. You can play it with 1-4 players, but I find it works best at 2 or 3.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img data-attachment-id=\"729\" data-permalink=\"https:\/\/jorgezhang.com\/2018\/08\/3d-printed-heads\/img_20180812_233808\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?fit=4608%2C3456&amp;ssl=1\" data-orig-size=\"4608,3456\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;LEX727&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1534117088&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;4.04&quot;,&quot;iso&quot;:&quot;125&quot;,&quot;shutter_speed&quot;:&quot;0.03030303030303&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"IMG_20180812_233808\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?fit=1024%2C768&amp;ssl=1\" src=\"https:\/\/thefriendlyboardgamer.files.wordpress.com\/2019\/06\/cool_box_3.jpg?w=1200\" alt=\"\" class=\"wp-image-729\" data-recalc-dims=\"1\"\/><\/figure>\n\n\n\n<p><strong>Sounds great and an interesting theme that I have not seen before, is Daggers High still in development?<\/strong><\/p>\n\n\n\n<p>Officially speaking, ever since I printed an initial run of prototype copies in December, Daggers High has past the development phase. That being said, I am happy to make changes to make the game better before and during the Kickstarter. So far there haven’t been many changes to change the game since it has been so extensively play-tested already and I am worried that I’ll change the balance too much by introducing a new change or card. There’s been one notable major change though with a change to Graff’s teacher ability. One of the most common comments was that it was difficult to control what event cards were in your hand. In part due to my decision to axe the five player option, there were enough cards in the deck to allow for this change, which allows you to draw a different event card from the deck (rather than swap cards with an opponent). So to answer the question, Daggers High is in a weird phase where the game is practically finalized but there is still room for fine tuning.<\/p>\n\n\n\n<p><strong>If you were to mention one thing that sets Dagers High apart from other games of its kind, what would you say?<\/strong><\/p>\n\n\n\n<p>Probably its relatability to teenagers. Something I have noticed time and time again when demoing Daggers High has been that those who are currently in high school (or just about to enter high school) tend to be big fans of the game. I think that the humor is especially relevant to them. Perhaps it also makes school seem less daunting and stressful. I would have answered that the theme sets this game apart, but a lot of games have unique themes these days. I believe that it’s not just the fact that the theme is unique, but the fact that this theme can engage and interest a younger audience, that sets apart Daggers High. My ultimate hope is that Daggers High can get more teenagers interested in board games, especially as they seem to be underrepresented in the hobby.<\/p>\n\n\n\n<p><strong>It has been great speaking to you Jorge and I wish you all the best with yourKickstarter campaign. If people want to get in touch with you or keep up to date with your future games how can they do this?<\/strong><\/p>\n\n\n\n<p>Thank you, Matt! I write a personal blog where I talk about my projects and games in general. You can subscribe to it by visiting&nbsp;<a href=\"http:\/\/www.jorgezhang.com\/\">http:\/\/www.jorgezhang.com<\/a>&nbsp;and scrolling all the way to the bottom. I’m also on Twitter @supermojorge. Those are probably the best places to get in touch with me, and I read and reply to just about every comment.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/thefriendlyboardgamer.files.wordpress.com\/2019\/06\/3p_march_.jpg?w=1200\" alt=\"\" class=\"wp-image-730\" data-recalc-dims=\"1\"\/><\/figure>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/thefriendlyboardgamer.files.wordpress.com\/2019\/06\/in_the_box.jpg?w=1200\" alt=\"\" class=\"wp-image-727\" data-recalc-dims=\"1\"\/><\/figure>\n\n\n\n<p>Thank you Matt for taking the time to interview me! What did you think of this interview? Let me know in the comments below. Thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about the gateway game Diplomacy, well….it was &#8230; <a title=\"Interview with the Friendly Boardgamer\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/\" aria-label=\"More on Interview with the Friendly Boardgamer\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1787,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[1,6],"tags":[51],"jetpack_featured_media_url":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/06\/Screen-Shot-2019-06-05-at-10.11.07-PM.png?fit=255%2C225&ssl=1","jetpack-related-posts":[{"id":1862,"url":"https:\/\/jorgezhang.com\/2019\/07\/purchase-daggers-high-on-the-game-crafter\/","url_meta":{"origin":1786,"position":0},"title":"Purchase Daggers High on The Game Crafter","date":"July 29, 2019","format":false,"excerpt":"Hi everyone! I thought that I would just take a moment to share the new progress I've had with Daggers High. You may be aware that Daggers High recently launched and failed on Kickstarter. Although this was disappointing, I still wanted to find a way to get Daggers High into…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/Screen-Shot-2019-07-28-at-9.36.30-PM.png?fit=937%2C651&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1555,"url":"https:\/\/jorgezhang.com\/2019\/04\/behind-the-scenes-animating-daggers-high\/","url_meta":{"origin":1786,"position":1},"title":"Behind the Scenes: Animating Daggers High","date":"April 26, 2019","format":false,"excerpt":"Today I released a video on my Youtube Channel for Daggers High. It's an animation that I created that is a how-to-play as well as a play-through of the game. https:\/\/youtu.be\/hKCECFQkTUA Daggers High: an animation I'm still a newbie to creating animation. It took me a couple hours to make…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/Screen-Shot-2019-04-25-at-9.38.58-PM.png?fit=1200%2C730&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1808,"url":"https:\/\/jorgezhang.com\/2019\/07\/so-you-want-to-launch-a-board-game-on-kickstarter-read-this-first-2019\/","url_meta":{"origin":1786,"position":2},"title":"So, you want to launch a board game on Kickstarter? Read this first. (2019)","date":"July 3, 2019","format":false,"excerpt":"Hey everyone! Sorry for my one month hiatus from writing blog posts- during this time I have been managing the campaign for Daggers Highschool. Anyway, Kickstarter is what I want to talk about in this blog post. There's already a wealth of information on this topic online, and so for…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/cool-box-3.png?fit=960%2C540&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1096,"url":"https:\/\/jorgezhang.com\/2019\/02\/daggers-high-at-polar-vortex-2019\/","url_meta":{"origin":1786,"position":3},"title":"Daggers High at Polar Vortex 2019","date":"February 1, 2019","format":false,"excerpt":"Daggers High at the 2019 Polar Vortex convention.","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/02\/3p-January-Polar-Vortex.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1742,"url":"https:\/\/jorgezhang.com\/2019\/05\/kickstarter-day-two-facebook-ads-kickstarter-updates-and-more-emails\/","url_meta":{"origin":1786,"position":4},"title":"Kickstarter Day Two: Facebook Ads, Kickstarter Updates, and more emails","date":"May 30, 2019","format":false,"excerpt":"Hey everyone! I decided to write another post about Kickstarter because there was just so much to do today! I don't know if I'll be writing a post for every day or not, but I potentially might if there are still things to do every day. Find the Kickstarter page…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/Screen-Shot-2019-05-29-at-9.04.15-PM.png?fit=1043%2C685&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":926,"url":"https:\/\/jorgezhang.com\/2018\/10\/board-game-geek-listing\/","url_meta":{"origin":1786,"position":5},"title":"Board Game Geek Listing","date":"October 13, 2018","format":false,"excerpt":"Hi everyone! I'm back for this week's post. Today I wanted to share something exciting: we got Daggers High listed on Board Game Geek.com! You can find the listing here: https:\/\/boardgamegeek.com\/boardgame\/260548\/daggers-high. This is pretty neat since it is another place to discuss and share things about the game. Also check…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/boardgamegeeklogo.jpg?fit=400%2C400&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1786"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1786"}],"version-history":[{"count":1,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1786\/revisions"}],"predecessor-version":[{"id":1788,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1786\/revisions\/1788"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1787"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1786"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1786"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1786"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}