{"id":1836,"date":"2019-07-07T15:19:30","date_gmt":"2019-07-07T20:19:30","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=1836"},"modified":"2020-04-23T16:16:46","modified_gmt":"2020-04-23T21:16:46","slug":"board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/","title":{"rendered":"Board Game Designer, Artist, and Owner of Vindicated Entertainment. A Conversation with Vincent Baker"},"content":{"rendered":"\n<p>Vincent Baker is an impressive person in the board game industry. He started his path to becoming a board game entrepreneur while he was still in high school, and was nominated student entrepreneur of the year by YES Carolina in 2011. He&#8217;s been busy since then, and you may have heard of his games including <a href=\"https:\/\/jorgezhang.com\/2019\/05\/18\/rulebook-preview-6-conspirator-spellslingers-techlandia-raid-boss\/#spellslingers\">Spellslingers<\/a>, Legendaria, and his upcoming Kickstarter campaign for the Otherworlds RPG Core Rulebook. <\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img data-attachment-id=\"1837\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/thumbnailjeffandvincent\/#main\" data-orig-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?fit=750%2C371&amp;ssl=1\" data-orig-size=\"750,371\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"ThumbnailJeffandVincent\" data-image-description=\"\" data-medium-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?fit=300%2C148&amp;ssl=1\" data-large-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?fit=750%2C371&amp;ssl=1\" loading=\"lazy\" width=\"750\" height=\"371\" src=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?resize=750%2C371&#038;ssl=1\" alt=\"\" class=\"wp-image-1837\" srcset=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?w=750&amp;ssl=1 750w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?resize=300%2C148&amp;ssl=1 300w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\" \/><figcaption>Vincent Baker (right)<\/figcaption><\/figure><\/div>\n\n\n\n<p><strong>You&#8217;ve designed everything from Spellslingers, a card game, to RPGs, like the one you are launching on Kickstarter very soon. What inspired you to make games? Are there some games that you&#8217;ve drawn inspirations from?<\/strong><\/p>\n\n\n\n<p>That&#8217;s a great question! On one hand, I&#8217;d like to say many things inspired me to make games. My father enjoyed gaming in all forms and allowed me to play several types of games when I was young. I&#8217;ve been making games for as long as I could remember. When I was a kid, creating a video game didn&#8217;t seem like much of an option for me. I also really loved the tangible feel of holding cards and dice. Being an artist; I could draw onto index cards and write with my pencil on paper and it just seemed to give me a lot more freedom than anything else. I remember playing Super Mario with my sister. We loved the game so much, but hated that we couldn&#8217;t play together or interact with the characters more, so I created a fun board game for us to play that also involved RPG mechanics. At that time, I didn&#8217;t realize what I was making, it was just something instinctual to me. In hindsight I should have known I was making great tabletop games, when my friends would come over and beg us to play these games I made, instead of the new video game that came out at the time.  I was naive and didn&#8217;t really think about game design being a skill.   Then, when I was a senior in high school, I had an entrepreneurship class. We were tasked with outlining a business idea. At that time I&#8217;d already released the Otherworlds Roleplaying Game, the year before in 2010. It&#8217;d been a long time passion project of mine since I was as kid, going back as far as I can remember. This game is my childhood imagination given form.  Anyways, seeing I excelled at creativity, my teacher declined my proposal of selling candy for my business idea. She felt it was a wasted opportunity and told me I had to pick something using my artwork and ideas. I was honestly stunned when she first said this to me, as she hadn&#8217;t declined anyone else, to my knowledge. Also, I had no idea that creating games was a viable avenue for me to choose as a career. In many ways I feel like that day changed my life significantly and put me on the path I&#8217;m currently on.   So maybe my inspiration came from that or maybe it&#8217;s just something embedded into my soul? It&#8217;s hard to say.  What I can say though is I just think it&#8217;s incredibly fun, discovering how to take a concept and transform it into a game. Anytime I do this, I always look for the simplest and most in depth version I can find. Those are possibly my favorite two concepts in game design and are they usually directly opposed to one another. I do believe though, that getting both of these aspects to work in tandem with one another creates at least part of an incredibly game.  As for games I&#8217;ve drawn inspiration from, that&#8217;s really tough. I&#8217;d say I&#8217;ve drawn inspiration from hundreds of games. Anything from Chess to modern day video game mechanics. I think every game has something you can learn from it and I&#8217;d say I&#8217;m constantly inspired by any game I play.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img data-attachment-id=\"1838\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/spellslingersbigbannerwebsite\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?fit=900%2C582&amp;ssl=1\" data-orig-size=\"900,582\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"SpellslingersBigBannerWebsite\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?fit=300%2C194&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?fit=900%2C582&amp;ssl=1\" loading=\"lazy\" width=\"900\" height=\"582\" src=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?resize=900%2C582&#038;ssl=1\" alt=\"\" class=\"wp-image-1838\" srcset=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?w=900&amp;ssl=1 900w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?resize=300%2C194&amp;ssl=1 300w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/SpellslingersBigBannerWebsite.jpg?resize=768%2C497&amp;ssl=1 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" data-recalc-dims=\"1\" \/><figcaption>Artwork for Spellslingers, a card game<\/figcaption><\/figure><\/div>\n\n\n\n<p><strong>It is amazing that your teacher recognized your potential and helped to put you on the path to designing games! I&#8217;m intrigued to learn more about how you started growing your business and where you are now, especially since you started while you were still in high school. Is it something you have been working on full time? Do you have any advice for aspiring game designers and entrepreneurs?<\/strong><\/p>\n\n\n\n<p>Definitely. I feel Mrs. Gray (the teacher who saw my potential) is an incredible teacher. Funny enough, she&#8217;s the only one to ever give me detention too, but that&#8217;s a whole other story for another time! For the first four years or so, I&#8217;d say that I didn&#8217;t put any significant amount of time into my business. Maybe 15-20 hours a week? Also, most of that time was spent just playing games with friends and claiming it was productive and in some ways it was, because it was playtesting my games, but I wasn&#8217;t doing what was needed to make Vindicated Entertainment grow. From around 2015 onward, I have been pushing harder and harder. Each year, I feel like I&#8217;m improving, removing tasks that aren&#8217;t as important and overall bettering my marketing and business ideas. I now easily work 30-50 hours a week on Vindicated Entertainment and around 35 hours managing a retail store for my day job. An average week for me last year was 72 hours.  It&#8217;s really odd really. I feel like many artists can sympathize with having art come natural to them. I wouldn&#8217;t say business comes natural to me. Some of it I enjoy a lot. I love the freedom, but I don&#8217;t always enjoy the process of learning a really hard new skill. My advice to any game designer or entrepreneur is to first be sure to be kind to yourself. It might sound silly, but if you&#8217;re getting into this business, it&#8217;s easy to either give up or to overwork yourself and be down on yourself during your failures. It&#8217;s important to realize that life doesn&#8217;t happen on your time, but things will work out. Just be kind and be patient. Now that my more soulful advice is out of the way, here&#8217;s some more typical advice. Be a student of knowledge and to take one action towards your goal, each and every day. You&#8217;re not going to learn much without hands on experience. It&#8217;s way better to fail and fall on your face over and over again. Don&#8217;t sit back and wait for things to be perfect.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img data-attachment-id=\"1842\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/vindicatedlogofbprofile\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?fit=1000%2C1000&amp;ssl=1\" data-orig-size=\"1000,1000\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"VindicatedLogoFBProfile\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?fit=300%2C300&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?fit=1000%2C1000&amp;ssl=1\" loading=\"lazy\" width=\"1000\" height=\"1000\" src=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?resize=1000%2C1000&#038;ssl=1\" alt=\"\" class=\"wp-image-1842\" srcset=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?w=1000&amp;ssl=1 1000w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?resize=150%2C150&amp;ssl=1 150w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?resize=300%2C300&amp;ssl=1 300w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/VindicatedLogoFBProfile.jpg?resize=768%2C768&amp;ssl=1 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><figcaption>Vindicated Entertainment<\/figcaption><\/figure><\/div>\n\n\n\n<p><strong>Excellent advice! It&#8217;s very neat to hear about what goes on behind the scenes. I know we were talking before this interview about how you playtested and balanced spellslingers, and I was quite impressed by how thoroughly you had thought through the many different playstyles to the game. How do you playtest your games? Do you do a lot of blind testing with random people, or have more of a dedicated and experienced group?<\/strong><\/p>\n\n\n\n<p>I playtest in a variety of ways. When I first started out, I playtested mostly by going to local stores and roping random people into play. I did that for years until I kept getting the same players over and over. In the last year and a half I&#8217;ve focused more on around twelve friends that I have, coming to my place, many whom I&#8217;ve met through this process. Additionally I also go to several cons and other events, to playtest there as well. Funny enough, I think once you playtest a few dozen times you&#8217;ll notice the same patterns arise, regardless of who you play with. As for playstyles, I always try and keep in mind that everyone might be playing the same game, but the way a person has fun with a game can vary. In Spellslingers for example, I acknowledged right out the gate that some people would love being aggressive, others defensive, some would like to help and make deals with others, while others would like to control the situation. With game design I always try to think of every possible angle a game could take and make that as much of a viable strategy as possible. Playtesting for me at least, helps me more with discovering points of confusion for players. As a game designer, if you hear the same point of confusion come up even just a couple times, you need to seriously consider addressing it.<\/p>\n\n\n\n<p><strong>Very cool. So, you are launching the Otherworlds RPG core rulebook on Kickstarter soon, a game you&#8217;ve been working on and refining for the last 10 years. How did you go about creating an entirely new RPG system, and what have you done to help differentiate Otherworlds from other RPGs?<\/strong><\/p>\n\n\n\n<p>Yeah, so funny enough, the game’s rules have already been out, but this is my first time putting everything in one place and calling it a “Core Rule Book.” If someone wanted, they could play Otherworlds right now by getting Otherworlds Zero and the Otherworlds Character Creation Guide. But I understand my Achilles heel as a game designer has been been straying from the path and being too confusing.  Really, that’s another lesson. Don’t confuse people! Don’t be cute with titles. People expect an RPG to have a “Core Rule Book” so deliver one haha.  You don’t have to reinvent everything, is what I need to keep telling myself. As for what makes Otherworlds different. First off I’d say it’s the blend of fantasy and science that it has. I like to call it “future fantasy” because when I say “science fantasy” people get the wrong idea. This isn’t Star Trek with magic. But more so, a fantasy adventure with guns and the lore of the game backs that premise up! Also, It’s worlds are dripping with lore that’s been developed for over a decade. Anthos is a world, where they have strange new magic surging throughout the planet, that’s enabled them some impressive technological advancements, however, it’s attracted a mysterious new threat &#8211; the Chimera! These dark beasts are attracted to this magic and have made expanding civilization all the more difficult. There’s also a steampunk planet, with cities ascended in the sky, and forbidden dungeons to explore from a war torn past. A gothic horror world with political intrigue and piracy happening on the end of the Black Sea and nine other worlds! There’s just so much too dive into!  From a mechanical perspective It’s a simple d6 system on the surface, yet deeply customizable. There’s a class system that allows for mixing class roles and functions, allowing for 3276 character class options in the core game just from how you want your skill tree set up, which determines how you’ll uniquely level your character. Combat is roughly three times as fast as your popular RPG titles, but also more dynamic. There’s the chance to disarm, trip, land extra attacks, and more, making it so every fight is tense, cinematic, and can change at any moment.  Monster variants allow for “mix and match” mechanics, so the players will have to think of battles more strategically. For those that love story, the game encourages the World Master (GM equivalent) to create characters from the concept of the character first and then tackle the mechanics of them afterward. Also, the system encourages granting permanent attribute bonuses and added dice to rolls when the players are creative.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img data-attachment-id=\"1839\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/otherworldsbanner2019\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?fit=900%2C582&amp;ssl=1\" data-orig-size=\"900,582\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"OtherworldsBanner2019\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?fit=300%2C194&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?fit=900%2C582&amp;ssl=1\" loading=\"lazy\" width=\"900\" height=\"582\" src=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?resize=900%2C582&#038;ssl=1\" alt=\"\" class=\"wp-image-1839\" srcset=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?w=900&amp;ssl=1 900w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?resize=300%2C194&amp;ssl=1 300w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/OtherworldsBanner2019.jpg?resize=768%2C497&amp;ssl=1 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" data-recalc-dims=\"1\" \/><figcaption>Otherworlds RPG<\/figcaption><\/figure><\/div>\n\n\n\n<p><strong>That&#8217;s really neat. I am looking forward to the Kickstarter! Is there anything else you want to add? Also, where can people go to find your company and projects?<\/strong><\/p>\n\n\n\n<p>Happy to hear it! I&#8217;d like to add, I recently released a game called Legendaria. It&#8217;s a hybrid between a tabletop RPG, social deduction game, and a play by email game. It&#8217;s perfect for anyone looking to play a roleplaying game, but doesn&#8217;t have time or can&#8217;t align their schedules with their friends or need players.  For information on Legendaria, Spellslingers, Otherworlds, and everything else I&#8217;m up to, check out <a href=\"http:\/\/vindicatedentertainment.com\">vindicatedentertainment.com<\/a>. That&#8217;s the absolute best place to be to check things out.  From there, you can join our Discord if you&#8217;d like to contribute to our games, find players, and talk games and anime. It&#8217;s a fun time for sure!<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img data-attachment-id=\"1840\" data-permalink=\"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/legendariabanner2019\/#main\" data-orig-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?fit=900%2C582&amp;ssl=1\" data-orig-size=\"900,582\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"LegendariaBanner2019\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?fit=300%2C194&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?fit=900%2C582&amp;ssl=1\" loading=\"lazy\" width=\"900\" height=\"582\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?resize=900%2C582&#038;ssl=1\" alt=\"\" class=\"wp-image-1840\" srcset=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?w=900&amp;ssl=1 900w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?resize=300%2C194&amp;ssl=1 300w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/LegendariaBanner2019.jpg?resize=768%2C497&amp;ssl=1 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" data-recalc-dims=\"1\" \/><figcaption>Legendaria game<\/figcaption><\/figure><\/div>\n\n\n\n<p>I really enjoyed talking to Vincent, and was inspired by his story. What would you have liked to ask Vincent? Let me know in the comments, and as always, thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Vincent Baker is an impressive person in the board game industry. He started his path to becoming a board game entrepreneur while he was still in high school, and was nominated student entrepreneur of the year by YES Carolina in 2011. He&#8217;s been busy since then, and you may have heard of his games including &#8230; <a title=\"Board Game Designer, Artist, and Owner of Vindicated Entertainment. A Conversation with Vincent Baker\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2019\/07\/board-game-designer-artist-and-owner-of-vindicated-entertainment-a-conversation-with-vincent-baker\/\" aria-label=\"More on Board Game Designer, Artist, and Owner of Vindicated Entertainment. A Conversation with Vincent Baker\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":1837,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[6],"tags":[51],"jetpack_featured_media_url":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/ThumbnailJeffandVincent.jpeg?fit=750%2C371&ssl=1","jetpack-related-posts":[{"id":1808,"url":"https:\/\/jorgezhang.com\/2019\/07\/so-you-want-to-launch-a-board-game-on-kickstarter-read-this-first-2019\/","url_meta":{"origin":1836,"position":0},"title":"So, you want to launch a board game on Kickstarter? Read this first. (2019)","date":"July 3, 2019","format":false,"excerpt":"Hey everyone! Sorry for my one month hiatus from writing blog posts- during this time I have been managing the campaign for Daggers Highschool. Anyway, Kickstarter is what I want to talk about in this blog post. There's already a wealth of information on this topic online, and so for…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/07\/cool-box-3.png?fit=960%2C540&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":1836,"position":1},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":1532,"url":"https:\/\/jorgezhang.com\/2019\/04\/how-to-become-a-board-game-reviewer\/","url_meta":{"origin":1836,"position":2},"title":"How to become a Board Game Reviewer","date":"April 20, 2019","format":false,"excerpt":"You can be a board game reviewer who gets sent free games from board game companies to review, even if you have very little or no tabletop game experience. But you might not want to after you read this article. Part One: Adding Value The first thing you need to…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/reviewer.jpg?fit=640%2C347&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1692,"url":"https:\/\/jorgezhang.com\/2019\/05\/rulebook-preview-6-conspirator-spellslingers-techlandia-raid-boss\/","url_meta":{"origin":1836,"position":3},"title":"Rulebook Preview 6: Conspirator, Spellslingers, Techlandia, Raid Boss","date":"May 18, 2019","format":false,"excerpt":"Hey everyone! Today I am back with another installment of my Rulebook Preview series. In this series, I take a look at tabletop games that have not yet been released or have been very recently released. I have not played these games, but simply reviewed the rulebooks (hence Rulebook Preview).…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/rulebook-preview-6.png?fit=601%2C600&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":926,"url":"https:\/\/jorgezhang.com\/2018\/10\/board-game-geek-listing\/","url_meta":{"origin":1836,"position":4},"title":"Board Game Geek Listing","date":"October 13, 2018","format":false,"excerpt":"Hi everyone! I'm back for this week's post. Today I wanted to share something exciting: we got Daggers High listed on Board Game Geek.com! You can find the listing here: https:\/\/boardgamegeek.com\/boardgame\/260548\/daggers-high. This is pretty neat since it is another place to discuss and share things about the game. Also check…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/boardgamegeeklogo.jpg?fit=400%2C400&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1775,"url":"https:\/\/jorgezhang.com\/2019\/06\/kickstarter-day-three-student-discounts-kicktraq-and-disabled-ad-account\/","url_meta":{"origin":1836,"position":5},"title":"Kickstarter Day Seven: Student Discounts, Kicktraq, and Disabled Ad Account","date":"June 4, 2019","format":false,"excerpt":"Hi everyone! It's been a while since I last posted one of these. In fact, an entire week has gone by! Wow, it's crazy to think that I've been managing this project for so long. Anyway, I just wanted to share a few things about the status of the project.…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/06\/Screen-Shot-2019-06-03-at-10.16.48-PM.png?fit=928%2C494&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1836"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=1836"}],"version-history":[{"count":2,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1836\/revisions"}],"predecessor-version":[{"id":1843,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/1836\/revisions\/1843"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/1837"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=1836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=1836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=1836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}