{"id":5225,"date":"2020-02-17T04:27:22","date_gmt":"2020-02-17T10:27:22","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=5225"},"modified":"2020-04-23T12:39:08","modified_gmt":"2020-04-23T17:39:08","slug":"bill-hackenbracht-wins-gud-con-2020","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/","title":{"rendered":"Bill Hackenbracht wins GUD Con 2020"},"content":{"rendered":"\n<p>After several months of planning and anticipation, Georgetown Board Games hosted GUD Con 2020, a 3-round, 2-day Diplomacy tournament. Most of the 24 attendees were relatively new to the game, and some had never played before. Also present were several highly experienced &#8220;Tournament Sharks,&#8221; but this time around they weren&#8217;t looking for blood. Rather, their priority was exposing the game they loved to newer players.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img data-attachment-id=\"5227\" data-permalink=\"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/gud-con-1\/#main\" data-orig-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?fit=1000%2C750&amp;ssl=1\" data-orig-size=\"1000,750\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2.2&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;Mi A2 Lite&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1581758518&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;3.819&quot;,&quot;iso&quot;:&quot;400&quot;,&quot;shutter_speed&quot;:&quot;0.058823529411765&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"GUD-CON-1\" data-image-description=\"\" data-medium-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?fit=1000%2C750&amp;ssl=1\" loading=\"lazy\" width=\"1000\" height=\"750\" src=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?resize=1000%2C750&#038;ssl=1\" alt=\"\" class=\"wp-image-5227\" srcset=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?w=1000&amp;ssl=1 1000w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?resize=300%2C225&amp;ssl=1 300w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?resize=768%2C576&amp;ssl=1 768w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?resize=576%2C432&amp;ssl=1 576w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-1.jpg?resize=600%2C450&amp;ssl=1 600w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><figcaption>Plenty of negotiations<\/figcaption><\/figure><\/div>\n\n\n\n<h2>Results<\/h2>\n\n\n\n<p>Bill Hackenbracht won the tournament with a whopping 113.68 points over his top 2 rounds, headed by his outstanding performance with a 17-center Turkey in round 1 &#8211; a result worth 76.86 points. In the same round, Brian Ecton had a strong 14-center Austria, worth 59.76 points. Both Bill and Brian are quite famous in the FTF tournament hobby, and their superior experienced showed. The other players were more careful by round 2, and managed to suppress Bill or Brian from another top score. In round 3, Bill Hackenbracht managed to secure his victory with a hard-fought top as Italy.<\/p>\n\n\n\n<p>Top board:<br>1. Bill Hackenbracht 113.68 (Best Italy\/Turkey)<br>2. Brian Ecton 60.29 (Best Austria)<br>3. Sam Pascal 53.42<br>4. Jonah Feldman 48.49 (Best England\/France)<br>5. Damian Garcia 41.42 (Best Germany)<br>6. David Leshchiner 37.43 (Best Russia)<br>7. Jonathan Frank 19.15<\/p>\n\n\n\n<p><strong>For the full results, click here: <a href=\"https:\/\/diplomacytv.com\/tournaments\/20\/scores\/\">https:\/\/diplomacytv.com\/tournaments\/20\/scores\/<\/a><\/strong><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img data-attachment-id=\"5232\" data-permalink=\"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/gud-con-bill\/#main\" data-orig-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?fit=1000%2C750&amp;ssl=1\" data-orig-size=\"1000,750\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"GUD-CON-Bill-\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?fit=1000%2C750&amp;ssl=1\" loading=\"lazy\" width=\"1000\" height=\"750\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?resize=1000%2C750&#038;ssl=1\" alt=\"\" class=\"wp-image-5232\" srcset=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?w=1000&amp;ssl=1 1000w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?resize=300%2C225&amp;ssl=1 300w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?resize=768%2C576&amp;ssl=1 768w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?resize=576%2C432&amp;ssl=1 576w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-.jpeg?resize=600%2C450&amp;ssl=1 600w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><figcaption>Champion Bill Hackenbracht<\/figcaption><\/figure><\/div>\n\n\n\n<h2>Thoughts from the Champion<\/h2>\n\n\n\n<p>Bill had high praise for the players at GUD Con, saying that they were easily the most intelligent group of people he had ever played with. Bill had a few take aways for the other players that he felt could help improve their game:<\/p>\n\n\n\n<p>1) <strong>Principled negotiations.<\/strong> Almost all of my moves and negotiations were an effort to find win-wins.  <br>2) <strong>Reading the board. <\/strong>Beleaguered opponents make excellent partners. <br>3) <strong>Don’t get out of position.<\/strong> Know your key terrain and don’t leave it vulnerable to the good graces of opponents. Don’t overcommit for only one, non-guaranteed center.  <br>4) <strong>Open with options. <\/strong>Avoid openings in ‘01 that commit you towards only one direction. Leave yourself with options, not burned bridges.  <br>5) <strong>End games when it makes sense.<\/strong> Use online or post-game kibitzing to practice your end game. In FtF its important for everyone to leave as happy as possible- getting ground out or spending 2 hours ordering support moves aren’t fun for most people.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img data-attachment-id=\"5229\" data-permalink=\"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/gud-con-2\/#main\" data-orig-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?fit=1000%2C750&amp;ssl=1\" data-orig-size=\"1000,750\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2.2&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;Mi A2 Lite&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1581758504&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;3.819&quot;,&quot;iso&quot;:&quot;400&quot;,&quot;shutter_speed&quot;:&quot;0.058823529411765&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"GUD-CON-2\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?fit=1000%2C750&amp;ssl=1\" loading=\"lazy\" width=\"1000\" height=\"750\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?resize=1000%2C750&#038;ssl=1\" alt=\"\" class=\"wp-image-5229\" srcset=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?w=1000&amp;ssl=1 1000w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?resize=300%2C225&amp;ssl=1 300w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?resize=768%2C576&amp;ssl=1 768w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?resize=576%2C432&amp;ssl=1 576w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-2.jpg?resize=600%2C450&amp;ssl=1 600w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><\/figure><\/div>\n\n\n\n<h2>Thoughts from the Tournament Director<\/h2>\n\n\n\n<p>As the TD, I often had to resist the temptation to kibitz on the games and give strategy advice to some of the newer players. Now that the tournament is over, I feel that it is a good chance to express a few of my thoughts. I agree with a lot of what Bill said in terms of strategical advice, and these tips compliment a lot of what I wrote on beginner&#8217;s FtF Diplomacy strategy <a href=\"https:\/\/jorgezhang.com\/diplomacy-resources\/\"><strong>here<\/strong><\/a>. While I sat out rounds 1 and 3, I had the opportunity to play in round 2 board 1 and actually play against some of the players at GUD Con (though my score was voided, to prevent a conflict of interest). I was playing as Germany on this board, while the two tournament leaders, Bill and Brian, were Russia and Italy respectively. My opening negotiations with Yuki (Turkey) and Sam (Austria) revealed that both players were worried of &#8211; or perhaps more aptly, intimidated by &#8211; Bill and Brian. Yuki, not wanting to get on Bill&#8217;s bad side, was planning to DMZ the Black Sea as a show of trust. For similar reasons, Sam had agreed to a DMZ in Galicia with Bill. I had the feeling that this could end up badly for at least one of them, and so I encouraged both to keep in mind that despite Bill&#8217;s experience, every player has the same amount of strength at the start of the game. This seemed to give them some confidence, and they ended up collaborating to jump Bill right out of the gate with an aggressive move to Armenia as well as a bounce in Galicia. <\/p>\n\n\n\n<p>In the western theatre, I was sitting across from Alex (Germany) and Jonah (France). While this was perhaps slightly unfair to Alex, I knew that he had to leave early, and so I ruled him out as a long-term alliance partner. That left working with Jonah. So, when Jonah asked if we could bounce in Burgundy, I told him that he could have it if he wanted it- I would not contest Burgundy at all. My hope was that Jonah might trust me and open to Picardy instead of to Burgundy- though if he chose to move to Burgundy it would not be the end of the world either. Jonah, wanting to be on the safe side, ended up taking Burgundy while I went to Ruhr with Munich. In this situation, I knew that a Burgundy-Munich move was very tempting for Jonah, and so I immediately proposed that I support his unit in Burgundy to Belgium. <\/p>\n\n\n\n<p>To my surprise, Jonah was not on board with me supporting his move to Belgium. My first thought was that Jonah surely intended to move Burgundy to Munich &#8211; otherwise, why would he forgo Belgium, a supply center? I decided to confront him about this and asked him outright whether he intended to take Munich or not. Jonah looked me in the eye and told me that he would not move to Munich, a strong indication that he was telling the truth. To figure out this puzzle, I talked with Alex, who after some intense questioning, revealed that he was bouncing with Jonah in Belgium. Jonah, who was set up to take both Spain and Portugal, didn&#8217;t want to create a target on his back by taking Belgium and having 6 supply centers at the end of 1901. Knowing that Jonah would not move to Munich, I figured that while Ruhr-Munich would be the safest move, it might also indicate to Jonah that I did not trust him, and also mean that I would no longer be in Ruhr (a key position for Germany to control). For that reason, I decided to order Ruhr-Belgium.<\/p>\n\n\n\n<p>As it turns out, this was an error on my part, as Brian Ecton (Italy) snuck into Munich with his unit in Tyrolia. I had completely forgotten about this possibility, and reflectively should have spent more time talking with Brian about his intentions with Tyrolia. Brian ended up building 2 fleets while Jonah decided to waive a build and only build F Brest. This gave me some hope as it indicated that Brian&#8217;s intention was to go after France, and sure enough, he proposed that I use Ruhr to support Munich into Burgundy. This gave me a large dilemma as I had already decided to work with France long term, and I didn&#8217;t want to throw that away by putting Brian into Burgundy. I told Brian what my concerns were, and he convinced me to his side by saying that I could work with him <em>AND<\/em> Jonah at the same time. The key was convincing Jonah that supporting Brian into Burgundy was the only way that I could retake Munich.<\/p>\n\n\n\n<p>It turns out that this was actually the case, as Bill (Russia) was quite upset by my decision to bounce him out of Sweden. He (perhaps rightfully) felt that I had completely screwed over his position by giving him no chance to defend against the Austria-Turkey alliance. My intuition was the Bill might be set on heading towards me in revenge, and so I decided to move Berlin-Silesia and Denmark-Baltic Sea as a security measure. This meant that even with French help from Burgundy, there was no way for me to effectively dislodge Brian from Munich without giving him a retreat to Kiel or Berlin. Meanwhile, I convinced Alex (England) to move Norway &#8211; Sweden to keep Bill out of Sweden, and told him that I would give him a supply center in Scandinavia if he did so. Unfortunately, Alex mis-ordered Norway-Sweden, and I was wrong about Bill moving to the Baltic (though I was correct about Bill&#8217;s Galicia-Silesia), and so I ended up in an awkward position in Scandinavia. Brian ended up following through on Munich &#8211; Burgundy, which Jonah was quite upset about. Jonah told me that the only way that I could make it up to him was to support his fleet into Belgium, something that I was very happy to do. <\/p>\n\n\n\n<p>Meanwhile, I told Alex that I would let him have Denmark as long as he agreed to use Norway to support Baltic-Sweden. As the fall moves were read, I got an incredibly lucky break with Bill moving Sweden-Denmark to bounce out Alex, and Alex supporting me into Sweden. At the same time, I retook Munich and skyrocketed to 6 centers. While this was happening, Sam and Yuki had a falling out, and Sam was now working with Bill against Yuki. At the same time, Sam snuck into Venice and angered Brian, resulting in a significantly weakened Italy. The board was in a perfect position for a strong French-German alliance to emerge, and so I didn&#8217;t deviate from this plan for the rest of the game. The game eventually ended with Jonah&#8217;s France on 10 centers, Sam&#8217;s Austria on 9 centers, and my Germany on 8 centers.<\/p>\n\n\n\n<p>There were a few takeaways that I&#8217;d like to highlight from this game. Firstly, newer players should remember that each power begins the game with the same amount of strength, and so they should avoid making large concessions to a highly skilled player &#8211; they have every right to demand an equal alliance. This worked out well for both Yuki and Sam (until Sam&#8217;s betrayal). Another takeaway is that one should be more wary of betraying two allies at once. Sam had two extremely strong allies (Italy and Turkey), but by betraying them both at once, his growth was arguably stunted and he let Bill back into the game (between 1903 and 1904, Sam actually went down from 7 centers to 6 due to a coalition of Yuki and Brian taking supply centers off of him). Finally, I am a strong believer in talking to every power on the map if one can, and this benefited me a lot in this game by giving me information on other players (such as realizing that there would be a bounce in Belgium) and preventing a potentially disastrous run-away Russia (by encouraging Yuki to not concede the Black Sea). It was only when I forgot to talk to Italy that I lost Munich, an exception that proves the rule.<\/p>\n\n\n\n<p>Echos of Bill&#8217;s wisdom can be found in this game. Brian arguably got out of position by pursuing such an aggressive assault on France. While the potential payoff was huge, Sam&#8217;s betrayal ultimately resulted in Brian&#8217;s elimination. Regardless of whether Sam&#8217;s betrayal was a good idea or not, by leaving an army in Venice as a deterrent, Brian would not have to rely on Sam&#8217;s good graces. Similarly, covering Munich in 1901 would have been prudent for me, especially given that both France and Italy were bordering it. It may have been advisable for Yuki to not burn bridges by opening to Armenia without Sam&#8217;s full support. A more equitable Austrian-Turkish alliance may have looked like an Austrian opening of Vienna-Galicia and Budapest-Rumania. Since Sam didn&#8217;t fully commit to attacking Bill, Sam was able to re-align himself with Bill to stab Yuki later in the game. Finally, it is always crucial to focus on what the other party gets in a negotiation. A good example of this is a negotiation I observed during Round 1 Game 1. At this point in the game, Turkey was looming on a solo, and so Isaac (Italy) was trying to convince Jonah (England) to give Belgium to Liam (France). Isaac&#8217;s logic was that Liam&#8217;s builds were potentially more valuable than Jonah&#8217;s, a valid reason to give up a build in a solo scenario. Jonah refused this trade, as Jonah didn&#8217;t feel like he was getting anything out of giving up a supply center. Isaac may have been more successful by pointing out that not giving Liam a build might result in a Turkish solo, meaning that Jonah would get an abysmal 0 points. In fact, one (somewhat risky) strategy Liam could have pursued in order to ensure his survival is demand that he get a supply center from Jonah &#8211; or else he would actively help Bill solo. Luckily for Liam and Isaac, Bill decided to call the game without holding the board hostage for a few hours in an attempt to escalate tensions or get a certain power to break rank. Perhaps this was a good call on Bill&#8217;s part- by being willing to end the game, he prevented the game from becoming too dreadful. The next time Isaac, Jonah, or Liam play with Bill, they&#8217;ll remember that Bill prioritized the enjoyment of the players at the table.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img data-attachment-id=\"5230\" data-permalink=\"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/gud-con-r1b1-final\/#main\" data-orig-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?fit=1000%2C750&amp;ssl=1\" data-orig-size=\"1000,750\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2.2&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;Mi A2 Lite&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1581775977&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;3.819&quot;,&quot;iso&quot;:&quot;500&quot;,&quot;shutter_speed&quot;:&quot;0.058823529411765&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"GUD-CON-R1B1-Final\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?fit=1000%2C750&amp;ssl=1\" loading=\"lazy\" width=\"1000\" height=\"750\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?resize=1000%2C750&#038;ssl=1\" alt=\"\" class=\"wp-image-5230\" srcset=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?w=1000&amp;ssl=1 1000w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?resize=300%2C225&amp;ssl=1 300w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?resize=768%2C576&amp;ssl=1 768w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?resize=576%2C432&amp;ssl=1 576w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-R1B1-Final.jpg?resize=600%2C450&amp;ssl=1 600w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-recalc-dims=\"1\" \/><figcaption>Bill&#8217;s 17 center Turkey<\/figcaption><\/figure><\/div>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>Everyone I talked to at GUD Con said that they had a good time, and would consider coming back to another Diplomacy tournament in the future. I was glad to hear this, as this is something that I prioritize as a TD. The positive response to GUD Con is encouraging, and so I plan to run a few more Diplomacy events in the future (once a month Diplomacy games). Are you in the Washington DC area and interested in playing Diplomacy? Let me know in the comments below, and I&#8217;ll add you to our mailing list!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After several months of planning and anticipation, Georgetown Board Games hosted GUD Con 2020, a 3-round, 2-day Diplomacy tournament. Most of the 24 attendees were relatively new to the game, and some had never played before. Also present were several highly experienced &#8220;Tournament Sharks,&#8221; but this time around they weren&#8217;t looking for blood. Rather, their &#8230; <a title=\"Bill Hackenbracht wins GUD Con 2020\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/\" aria-label=\"More on Bill Hackenbracht wins GUD Con 2020\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":5236,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[38],"tags":[50],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-1-1-e1581914554250.jpeg?fit=845%2C750&ssl=1","jetpack-related-posts":[{"id":812,"url":"https:\/\/jorgezhang.com\/2018\/09\/54th-post\/","url_meta":{"origin":5225,"position":0},"title":"54th post","date":"September 4, 2018","format":false,"excerpt":"Hey everyone! About a month and a half ago I decided to try out blogging by making a blog post every day. It's been great so far and I am planning on continuing daily posts- but I have made the decision to not make posts on weekends. This way the…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/09\/IMG_20180903_225651-1.jpg?fit=900%2C1200&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":939,"url":"https:\/\/jorgezhang.com\/2018\/11\/wdc-2018-aar\/","url_meta":{"origin":5225,"position":1},"title":"WDC 2018 AAR","date":"November 11, 2018","format":false,"excerpt":"A few weeks ago, I traveled to DC for the 2018 world championships of Diplomacy. The tournament featured 4 rounds, and so I thought I'd share a bit about each round, including several of the mistakes I made on several of my boards. I also want to talk a little bit…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?fit=402%2C364&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":5225,"position":2},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":720,"url":"https:\/\/jorgezhang.com\/2018\/08\/twilight-imperium-3rd-edition-review\/","url_meta":{"origin":5225,"position":3},"title":"Twilight Imperium 3rd Edition Review","date":"August 14, 2018","format":false,"excerpt":"I've talked about other board games before, but this is my first official board game review. Today I will be reviewing the longest board game I have ever played: Twilight Imperium 3rd Edition. I played in a five player game that took place over the course of 2 days and a…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":751,"url":"https:\/\/jorgezhang.com\/2018\/08\/diplomacy-and-king-making\/","url_meta":{"origin":5225,"position":4},"title":"Diplomacy and King Making","date":"August 15, 2018","format":false,"excerpt":"This Sunday I was at the Weasel Pyle for two games of Diplomacy. The Pyle is basically the last public games of the entire year for the Windy City Weasels, who play roughly tri-monthly. The players who have the highest scores per country at the end of the year get…","rel":"","context":"In &quot;Game Design&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_162714.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":1096,"url":"https:\/\/jorgezhang.com\/2019\/02\/daggers-high-at-polar-vortex-2019\/","url_meta":{"origin":5225,"position":5},"title":"Daggers High at Polar Vortex 2019","date":"February 1, 2019","format":false,"excerpt":"Daggers High at the 2019 Polar Vortex convention.","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/02\/3p-January-Polar-Vortex.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5225"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=5225"}],"version-history":[{"count":8,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5225\/revisions"}],"predecessor-version":[{"id":5239,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5225\/revisions\/5239"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/5236"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=5225"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=5225"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=5225"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}