{"id":5378,"date":"2020-03-29T17:38:07","date_gmt":"2020-03-29T17:38:07","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=5378"},"modified":"2020-04-23T12:34:57","modified_gmt":"2020-04-23T17:34:57","slug":"universities-must-adopt-permanent-and-universal-as","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2020\/03\/universities-must-adopt-permanent-and-universal-as\/","title":{"rendered":"Universities Must Adopt Permanent and Universal A&#8217;s"},"content":{"rendered":"\n<p>What do we do about grades in the wake of Covid-19? We have to consider equity- for disadvantaged students, students applying to graduate schools, and anyone who cannot participate in class to their full ability due to the extreme circumstances. At Georgetown University, most students are in favor of &#8220;Double A,&#8221; which limits the grades that a student can earn to an A or A-. Unlike &#8220;Universal Pass\/Fail&#8221; (as other schools like Harvard have implemented), Double A does not disadvantage students applying to graduate school\/jobs, and protects students from a failing grade. <\/p>\n\n\n\n<p>There has been immense resistance to the idea of giving everyone an A or A-, with many students complaining about the adverse effects of subsequent grade inflation. I also have qualms about Double A, because I feel it does not go far enough. In this post, I argue that we should give students an A in all classes, regardless of &#8220;performance.&#8221; This proposal is not my invention, and has been dubbed &#8220;Universal A.&#8221; I differ from the prevailing discussion by arguing that we should adopt this proposal permanently, and not just for one semester. <\/p>\n\n\n\n<h2>Grades have perverted the purpose of education<\/h2>\n\n\n\n<p>The purpose of education is to learn and gain knowledge. Yet, one only needs to glance at a modern college campus to know that students aren&#8217;t learning out of a pursuit of knowledge- they are learning in pursuit of an A. Examine your own gut reaction towards my proposal of abolishing grades. Perhaps your internal dialogue goes something to the tune of, &#8220;Nobody would learn anything if they knew they would get an A!&#8221; That is precisely what the problem is- learning has become a means to an end instead of the end itself. The result is that students hate learning. They complete their assignments as quickly as possible. They cheat on exams, and lie to their teachers. And once the grade has been obtained &#8211; desired or not &#8211; students throw their textbooks into the fire, never to return to the subject again.<\/p>\n\n\n\n<p>What has been lost in this frenzy? Teachers will find that they have very successfully caused their students to dutifully complete every assignment and test. But what they have really done is sacrifice the long term for the short term. The teacher has killed the love and passion for learning in exchange for blind, but committed, students. Under this model, it becomes very clear as to how the system of grades has been instituted and perpetuated: it takes dozens of committed teachers to inspire a student, but just one to extinguish their inspiration. Moreover, teachers who drive work from their students without regard for the students themselves are incentivized by a system that judges teachers for the resulting test scores of their students. <\/p>\n\n\n\n<p>What is education if not long term? This sacrifice seems to be short-sighted and foolish. Kids, who are born curious about the world, quickly find that they hate school (even if they happen to excel). This hatred of school frustrates teachers, who find that the only way they can get a student to learn is to threaten them with more grades. This exacerbates the problem further in a positive feedback loop until the kid can no longer handle the stress &#8211; perhaps they flunk out. The students who do make it through their childhood will find that college is more of the same: constant pressure to attain high grades so that they can obtain a good job. <\/p>\n\n\n\n<p>Perhaps this argument is persuasive, but something still nags you about abolishing grades. After all, it is the way that things have been done for hundreds of years! Aren&#8217;t grades necessary? How else would an employer be able to measure the ability of each student?<\/p>\n\n\n\n<h2>Grades don&#8217;t measure ability<\/h2>\n\n\n\n<p>They measure obedience. Anyone who has written an essay knows that getting a good grade requires tailoring the paper to the preferences of the professor, repeating back to them their own opinions. The same paper, graded by two different professors, may receive vastly different scores. More troubling is the arbitrary and non-standardized grading procedure across teachers, departments, majors, and schools. We all know that there are &#8220;easy&#8221; teachers and &#8220;hard&#8221; teachers. So, how come both A&#8217;s are worth the same?<\/p>\n\n\n\n<p>What about &#8220;class rank&#8221;? By considering a student relative to the other students in the class, one can definitively tell which of 2 students (who took the same class) is superior. It fails, however, as soon as you broaden the scope even a tiny bit. From year to year, certain cohorts of students are stronger or weaker. Thus, even under the same university, professor, and grading policies, one cannot definitively say that the rank 1 student from 2017 was better than the rank 5 student of 2018.<\/p>\n\n\n\n<p>Surely though, GPA must be accurate in the aggregate. After all, students will take well over 30 classes over their time in university. Won&#8217;t all these small discrepancies disappear? Unfortunately, under a system where even 1 or 2 bad grades can bar someone from attending the top law and medical schools, these discrepancies are largely unfair and arbitrary. Moreover, the system is easily gamed. Students can simply choose classes that don&#8217;t challenge them, repeat a subject that they are already familiar with, or take a class with an easy professor. The prime example of this is a student who, already fluent, begins their language at the beginners level. <\/p>\n\n\n\n<p>It is the student who challenges themselves by taking classes beyond their abilities who is punished by GPA. I have never, no matter how brilliant they are, met a student who knows everything. I have met many students who are capable of selecting classes such that it appears that they know everything.<\/p>\n\n\n\n<h2>Obedience is overvalued<\/h2>\n\n\n\n<p>GPA might have worked well for society when all we needed were &#8220;cogs in the machine&#8221; that could follow orders. We don&#8217;t need that anymore, because whether we like it or not, any job that solely requires obedience can be done by a robot. Innovation, creativity, and problem solving are the skills that will rule the future. As it turns out, these are precisely the skills that are stifled by grades! <\/p>\n\n\n\n<p>I saw this first-hand when my high school AP Language teacher abolished grades in his classroom. Among the various concerns was that our teacher was not preparing us well for the AP test. For most students, these concerns were quelled when they realized that the class proceeded like any other: my teacher would assign essays, have us take mock tests, and return feedback on our writing. This worked very well for AP Lang, a class where students would have to write a mix of personal and opinion pieces for the test. It became clear to me that students, without the restriction of a rubric, broke free of the &#8220;5 paragraph essay&#8221; and stale nature of most essays written for school. After inquiring about the AP scores, I was shocked to learn that they had substantially increased from previous years in which my teacher had taught the class with grades. It was this moment that I realized how effective a grade-less classroom could be: one where I was always excited for class, unafraid to take risks, and never as stressed as I was in my other classes.<\/p>\n\n\n\n<p>Risk-taking is punished by rubrics that dictate what should and must be written about. So, do we really want straight A students after all? Schools like MIT would say yes, because straight A students are more likely to get good grades in college. Well, no duh. CEOs and HR managers have a different story. Take the following quote from Laszlo Bock, senior vice president of people operations at&nbsp;Google (<a href=\"https:\/\/www.nytimes.com\/2013\/06\/20\/business\/in-head-hunting-big-data-may-not-be-such-a-big-deal.html?partner=socialflow&amp;smid=tw-nytimesbusiness\">source<\/a>):<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;One of the things we’ve seen from all our data crunching is that G.P.A.’s are worthless as a criteria for hiring, and test scores are worthless — no correlation at all except for brand-new college grads, where there’s a slight correlation. Google famously used to ask everyone for a transcript and G.P.A.’s and test scores, but we don’t anymore, unless you’re just a few years out of school. We found that they don’t predict anything.&#8221;<\/p><cite>Laszlo Bock, 2013<\/cite><\/blockquote>\n\n\n\n<h2>What about competition? Students won&#8217;t work hard if they aren&#8217;t competing with each-other.<\/h2>\n\n\n\n<p>Competition, while effective in a capitalist society, is brutally damaging in the classroom. When students teach each-other, both the teacher and the student gain, with the former solidifying their conceptual understanding and the latter gaining knowledge. Given the ease at which education is shared, but the difficulty in which it is generated without collaboration, the most effective classrooms are ones in which the students can learn from each-other.<\/p>\n\n\n\n<p>Grades artificially destroy this natural and important dynamic by forming a link between education and capitalism. Under the system of grades, achieving a better grade results in a higher future income. Since the accumulation of wealth is competitive, education inevitably also becomes competitive. The end result is a cutthroat classroom culture that needlessly stresses students, and is less effective. The students who excel academically gradually alienate themselves from those who do not, similarly to how those in different socioeconomic classes distance themselves from each-other. Those with better grades lose their empathy for fellow classmates, believing them to be lazier and dumber. This environment creates the further desire to distance one from the rest, resulting in an insatiable need to show off one&#8217;s intellectual feats. Similar to how the capitalist must buy expensive watches and suits to increase their social standing, the student brags about their lack of sleep and number of credits.<\/p>\n\n\n\n<p>Can&#8217;t you simply assign a lot of group work? It is no secret that many students despise group work. Yet the root cause of this detest, grades, seems to never be questioned. Group work causes students to feel that they are unfairly dragged down by those they consider to be intellectually lesser than them. On the other hand, students who are paired with a student known for doing well in the class may feel relieved, and contribute less to the project in order to maximize their own grade. It can often result in a situation where no students are willing to contribute to the group because they know that by not doing anything, someone else will be forced to pick up the slack. Thus, while group work under a system of grades is alluring, all it achieves is students who pretend to collaborate while finding ways to secretly compete with each-other. By abolishing grades, collaboration will no longer be rare, but become the default state. <\/p>\n\n\n\n<h2>Why can&#8217;t this wait?<\/h2>\n\n\n\n<p>&#8220;We should do more studies! We can&#8217;t make such a drastic change so quickly!&#8221; What you may not have known is that hundreds, if not thousands, of studies on the question of rewards and abolishing grades have already been published. For the most part, they find that while grades encourage learning in the short term, they undermine intrinsic motivation and the passion for learning in the long term. Moreover, students are less creative and more stressed under a system of grades.<\/p>\n\n\n\n<p>Georgetown is at a unique point in time where students have tuned into the conversation of grades and equity. There is a growing movement of students to pass Double A after Covid-19 exposed some of the more obvious issues with grades. There may not be another time where students are so focused on conversations of grades and fairness. On the other hand, if Georgetown is bold enough to institute universal A, it would give a large and overwhelming advantage to Georgetown students who have to compete with students from other schools for opportunities. Lest they see their own schools become uncompetitive with Georgetown, other universities would be forced to follow suit. Covid-19 is the perfect excuse &#8211; and perhaps the catalyst &#8211; for the first meaningful educational change since the invention of schools. In just the past few decades, education has seen constant changes to the curriculum, and policies such as common core have been shown to be ineffective. Perhaps instead of changing what we teach, we should change how we teach. <\/p>\n\n\n\n<h3>Update: <\/h3>\n\n\n\n<p>In a run-off poll among Georgetown students with 7 options, Universal A made it to the 5th round of voting with 293 votes. Double A was the ultimate winner, with 1,191 votes (this poll was conducted by Georgetown&#8217;s student council). Neither system was implemented, as Georgetown&#8217;s administration opted for an optional pass-fail system.<\/p>\n\n\n\n<p>Additionally, you can read some examples of universities that abolished grades and replaced them with narrative evaluation <a href=\"https:\/\/jorgezhang.com\/2020\/04\/20\/narrative-evaluation-to-replace-letter-grades\/\"><span style=\"color:#0693e3\" class=\"tadv-color\">here<\/span><\/a>.<\/p>\n\n\n\n<h2>A few finer points<\/h2>\n\n\n\n<p>What about math class?<\/p>\n\n\n\n<ul><li>In a vacuum, grades would work pretty well for subjects where technical ability is the only thing that counts. After all, there is &#8220;only one right answer to a math problem,&#8221; which should completely mitigate the arbitrary nature of grades. Unfortunately, bad teachers and curriculums exist. What often happens is a student gets a terrible math teacher early on &#8211; perhaps they fail Algebra &#8211; and then decide that they hate math forever. This has contributed to a more general culture of &#8220;math hatred&#8221; that stems from math being crammed down people&#8217;s throats rather than learned naturally.<\/li><\/ul>\n\n\n\n<p>What about Montessori? <\/p>\n\n\n\n<ul><li>Montessori is great! That being said, I would argue that the abolishment of grades does not require a Montessori style of education. In fact, many classrooms can likely proceed in the same exact way that they have in the past, with the key distinction of there being no transcript waiting for each student at the end of the tunnel.<\/li><\/ul>\n\n\n\n<p>What to do about students who truly don&#8217;t care?<\/p>\n\n\n\n<ul><li>I don&#8217;t see this as an issue. Georgetown should continue to collect their tuition dollars until they quit or graduate. The reward for paying attention to your classes is the learning and education you receive, not the piece of paper that says you graduated, nor the GPA you get. It is also conceivable that other things &#8211; like sports and other extracurriculars &#8211; are undervalued because we are all so focused on classes. Students who &#8220;don&#8217;t care&#8221; might actually deeply care about other things that are, in reality, as important as doing well in classes.<\/li><\/ul>\n\n\n\n<p>What if a bad student gets the job I want?<\/p>\n\n\n\n<ul><li>One of the side-effects of grades is that we tend to underestimate our peers with lower grades than us. But even then, there is a good chance that someone who truly did not learn anything in college will get filtered out after they bomb the interview, or demonstrably can&#8217;t do their job. Unfortunately, and perhaps a bit pessimistically, getting a job is not exactly a meritocracy and the impression I get is that unqualified people get the job all the time anyway.<\/li><\/ul>\n\n\n\n<p>What about the students who do well under grades?<\/p>\n\n\n\n<ul><li>Congrats to them! They will likely do just as well, if not better, under a system without grades.<\/li><\/ul>\n\n\n\n<p>Why Universal A and not something like Universal Pass (but no fail)?<\/p>\n\n\n\n<ul><li>Universal A will encourage other universities to pass similar policies because A&#8217;s look better than P&#8217;s. <\/li><\/ul>\n\n\n\n<p>Students might still work, but they will work less hard than they would under grades.<\/p>\n\n\n\n<ul><li>This could be true in some situations, especially if a teacher cannot set clear expectations for the course without resorting to the threat of grades. Yet, I would argue that even if students work harder under grades, this has the unseen (and potentially disastrous) cost of harming their long-term motivation. Teachers can still assign &#8220;mandatory&#8221; assignments without grades, and if a student chooses not to do them then they do so at the risk of harming the student-professor relationship (and any requests for a letter of rec).<\/li><\/ul>\n\n\n\n<p>How will I know if I am doing well in a class or not?<\/p>\n\n\n\n<ul><li>Feedback is extremely important, and I am 100% against abolishing feedback! This is a common misconception about abolishing grades, as you can definitely still have feedback without a GPA. That said, I am against using positive feedback as a reward by allocating opportunities (such as job positions) to students with higher GPAs.<\/li><\/ul>\n\n\n\n<p>This sounds great. But isn&#8217;t this kind of like communism? <\/p>\n\n\n\n<ul><li>Universal A is founded on similar principles, but the nature of education make Universal A much more realistic than communism. As communists point out, wage-labor alienates workers from their work and necessitates the exploitation of workers. Similarly, grades alienate students from the work that they do, and exploits them for their labor through tuition payments that don&#8217;t reflect the actual cost of education (similar to how the amount a worker is paid is always less than the value that they are worth to the company). Communism failed spectacularly because it required large amounts of totalitarian authority, and allowed for a &#8220;free-rider&#8221; problem where some citizens realized that they could get away with not working. Neither of these apply to Universal A because it would be easy and free to abolish grades. Additionally, students would work more and harder in the long run. <\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>What do you think about Universal A? Do you agree? Let me know in the comments below, and thanks for reading as always!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2>A quote from <em>Punished By Rewards <\/em>by Alfie Kohn<\/h2>\n\n\n\n<p>I personally found this quote very illustrative, and something that I could personally relate to, and so I decided to share it here at the end of this post. Kohn is describing students who attend one of the most elite prep school in the country, saying about them, &#8220;I spoke, by coincidence, during the cruelest week in April, when the seniors were receiving their college acceptances and rejections. I talked to them about the desperate race they were joining. Already, I knew, they had learned to put aside books that appealed to them so they could prepare for the college boards. They were joining clubs that held no interest for them because they thought their membership would look good on transcripts. They were finding their friendships strained by the struggle for scarce slots in the Ivy League.<\/p>\n\n\n\n<p>This they knew. What some of them failed to realize was that none of this ends when they finally got to college. It starts all over again: they will scan the catalogue for courses that promise easy A&#8217;s, sign up for new extracurriculars to round out their resumes, and react with gratitude rather than outrage when professors tell them exactly what they need to know for exams so they can ignore everything else. They will define themselves as premed, prelaw, prebusiness &#8211; the prefix pre- indicating that everything they are doing now is irrelevant except insofar as it contributes to what they will be doing later.<\/p>\n\n\n\n<p>Nor does this mode of existence end at college graduation. The horizon never comes any closer. Now they must struggle for the next set of rewards so they can snag the best residences, the choicest clerkships, the fast-track positions in the corporate world. Then come the most prestigious appointments, partnerships, vice presidencies, and so on, working harder, nose stuck into the future, ever more frantic. And then, well into middle age, they will wake up suddenly in the middle of the night and wonder what happened to their lives.&#8221; (p. 204)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What do we do about grades in the wake of Covid-19? We have to consider equity- for disadvantaged students, students applying to graduate schools, and anyone who cannot participate in class to their full ability due to the extreme circumstances. At Georgetown University, most students are in favor of &#8220;Double A,&#8221; which limits the grades &#8230; <a title=\"Universities Must Adopt Permanent and Universal A&#8217;s\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2020\/03\/universities-must-adopt-permanent-and-universal-as\/\" aria-label=\"More on Universities Must Adopt Permanent and Universal A&#8217;s\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":5388,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[38],"tags":[42,41],"jetpack_featured_media_url":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/03\/a.png?fit=714%2C720&ssl=1","jetpack-related-posts":[{"id":5432,"url":"https:\/\/jorgezhang.com\/2020\/04\/narrative-evaluation-to-replace-letter-grades\/","url_meta":{"origin":5378,"position":0},"title":"Narrative Evaluation to Replace Letter Grades","date":"April 20, 2020","format":false,"excerpt":"A few weeks ago, I outlined why I believe that grades need to be abolished. The main argument is that grades have alienated students from the real purpose of education. Rather than learn, students obey their teacher's instructions as closely as possible to maximize their grade. Abolishing grades might actually…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/04\/narrative-evaluation.jpg?fit=800%2C800&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5710,"url":"https:\/\/jorgezhang.com\/2020\/06\/why-is-walter-payton-college-preps-student-matriculation-into-top-tier-universities-so-strong\/","url_meta":{"origin":5378,"position":1},"title":"Why is Walter Payton College Prep's Student Matriculation into top tier Universities so Strong?","date":"June 20, 2020","format":false,"excerpt":"Why is Walter Payton College Prep's student matriculation into top tier universities consistently strong, especially in comparison to other high schools in Illinois? Conventional wisdom suggests that this is the result of an extremely competitive environment, or the result of extraordinarily wealthy students. Yet, Payton is nowhere close to the…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/06\/IMG_20160212_110219-scaled.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":10860,"url":"https:\/\/jorgezhang.com\/2020\/09\/should-students-choose-their-classes-university-design-problem-part-1\/","url_meta":{"origin":5378,"position":2},"title":"Should Students Choose Their Classes? (University Design Problem Part 1)","date":"September 11, 2020","format":false,"excerpt":"I am taking a class called \"University Design Problem: Georgetown 2030.\" It is an ambitious class: by the end of it, we hope to make a proposal to Georgetown that will create some lasting change in its educational policy. Part of this process is engaging the community, and getting everyone's…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-11-at-12.15.25-AM.png?fit=427%2C366&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5498,"url":"https:\/\/jorgezhang.com\/2020\/05\/an-easy-way-to-permanently-end-academic-dishonesty\/","url_meta":{"origin":5378,"position":3},"title":"An Easy Way to Permanently End Academic Dishonesty","date":"May 27, 2020","format":false,"excerpt":"There are few beliefs that we (as a society) hold as sacredly as academic honesty. We pretend that cheating does not happen frequently, and that it is an unacceptable behavior. Yet, students are cheating all the time. The following study found that 68% of undergraduates cheated at some point in…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/cheating-bean.jpeg?fit=400%2C300&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":5378,"position":4},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":1460,"url":"https:\/\/jorgezhang.com\/2019\/04\/on-senioritis-guest-article\/","url_meta":{"origin":5378,"position":5},"title":"On Senioritis (Guest Article)","date":"April 8, 2019","format":false,"excerpt":"Guest article by Liam Schumm; I blog at https:\/\/liamschumm.com about coding and life. I've had a peculiar experience with \"senioritis\". Freshman year I took calculus, a class with many seniors. Many of my friends graduated in the next couple years, and I felt like I got early-onset senioritis. As somebody…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/Screen-Shot-2019-04-07-at-8.47.22-PM.png?fit=877%2C722&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5378"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=5378"}],"version-history":[{"count":13,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5378\/revisions"}],"predecessor-version":[{"id":5459,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5378\/revisions\/5459"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/5388"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=5378"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=5378"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=5378"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}