{"id":5498,"date":"2020-05-27T18:00:31","date_gmt":"2020-05-27T23:00:31","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=5498"},"modified":"2020-05-27T18:00:45","modified_gmt":"2020-05-27T23:00:45","slug":"an-easy-way-to-permanently-end-academic-dishonesty","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2020\/05\/an-easy-way-to-permanently-end-academic-dishonesty\/","title":{"rendered":"An Easy Way to Permanently End Academic Dishonesty"},"content":{"rendered":"\n<p>There are few beliefs that we (as a society) hold as sacredly as academic honesty. We pretend that cheating does not happen frequently, and that it is an unacceptable behavior. Yet, students are cheating all the time. The following study found that 68% of undergraduates cheated at some point in college:<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img data-attachment-id=\"5640\" data-permalink=\"https:\/\/jorgezhang.com\/2020\/05\/an-easy-way-to-permanently-end-academic-dishonesty\/percentage-of-students-who-admitted-to-cheating\/#main\" data-orig-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?fit=725%2C411&amp;ssl=1\" data-orig-size=\"725,411\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Percentage-of-students-who-admitted-to-cheating\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?fit=300%2C170&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?fit=725%2C411&amp;ssl=1\" loading=\"lazy\" width=\"725\" height=\"411\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?resize=725%2C411&#038;ssl=1\" alt=\"\" class=\"wp-image-5640\" srcset=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?w=725&amp;ssl=1 725w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?resize=300%2C170&amp;ssl=1 300w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/Percentage-of-students-who-admitted-to-cheating.png?resize=600%2C340&amp;ssl=1 600w\" sizes=\"(max-width: 725px) 100vw, 725px\" data-recalc-dims=\"1\" \/><figcaption><a href=\"https:\/\/unicheck.com\/blog\/academic-cheating-statistics\">Source<\/a><\/figcaption><\/figure>\n\n\n\n<p>68% percent is a staggering number- especially given that academic dishonesty is a societal taboo (it is worth noting that some other sources <a href=\"https:\/\/www.edutopia.org\/article\/why-students-cheat-and-what-do-about-it\">put this figure as high as 95%<\/a>). Why are so many students cheating? We assume it is for selfish reasons, and have not thought deeply at all about the root causes of academic dishonesty: grades. <strong>Cheating is a rational behavior. It is low-risk, yet highly rewarding.<\/strong> The truth is that students get completely screwed over if they are honest. Even straight-A students benefit from cheating, because the time saved not studying translates into more time available to do other activities. The <em>only<\/em> way to permanently end academic dishonesty is to abolish grades (If you have not already read <a href=\"https:\/\/jorgezhang.com\/2020\/03\/29\/universities-must-adopt-permanent-and-universal-as\/\">my extended thoughts on abolishing grades<\/a>, you should do so before proceeding).<\/p>\n\n\n\n<h2>What is academic dishonesty?<\/h2>\n\n\n\n<p>Academic dishonesty ranges from cheating on tests to falsifying data and plagiarism. According to the <a href=\"https:\/\/honorcouncil.georgetown.edu\/system\/policies\/standards-of-conduct\/\">Georgetown Honor Code<\/a>, &#8220;submitting work for multiple purposes&#8221; and &#8220;contract cheating&#8221; (doing\/receiving someone else&#8217;s homework) also fall under this umbrella. <\/p>\n\n\n\n<h3>The honor code is terribly designed <\/h3>\n\n\n\n<p>Straight from Georgetown&#8217;s honor code, &#8220;It is the responsibility of the student to consult with the professor concerning what constitutes permissible collaboration.&#8221; Thus, academic dishonesty basically means whatever the professor wants it to mean. Not only that, but it is on the burden of the student to figure out whether they are cheating or not. That&#8217;s as if everything were illegal, except for what the government permitted. The problem with this system is that pretty much anything can be construed to be &#8220;illegal.&#8221; Did you eat potato salad for lunch? Well, nothing in the law says that you can eat potato salad, so you might be going to jail for that. A professor can simply trump up fake charges by claiming a seemingly innocuous action (perhaps, a student study group or using google to look up something) was in fact against the rules. It gets worse, because &#8220;plagiarism can be said to have occurred without any affirmative showing that a student’s use of another’s work was intentional.&#8221; Thus, proof of intention is not required to prosecute a student.<\/p>\n\n\n\n<p>You would expect such a draconian code to discourage cheating, since it allows offenders to be easily prosecuted. But the opposite actually occurs: since &#8220;academic dishonesty&#8221; is ill-defined, it becomes meaningless. A complete lack of clarity about what constitutes cheating makes it easy for students to begin cheating, and continue to cheat once they figure out that cheaters are rarely ever caught. <\/p>\n\n\n\n<p>From the point of view of professors, a lack of clarity results in a lot more work for the professor to report cheating. According to this professor, <a href=\"https:\/\/community.chronicle.com\/news\/2280-why-we-don-t-report-all-of-the-cheating-we-detect\">the reporting process is difficult and time-consuming<\/a>. This is probably because it is the duty of the professor to produce evidence, justify their standards, and define cheating. Additionally, the lack of any predetermined punishments mean that professors worry that the administration will deal out an unjust punishment to the student. <\/p>\n\n\n\n<h2>How often are cheaters caught?<\/h2>\n\n\n\n<p>Pretty much never. Among a survey of 54 Canadian universities, <a href=\"https:\/\/www.cbc.ca\/news\/canada\/manitoba\/cheating-students-punished-by-the-1000s-but-many-more-go-undetected-1.2549621\">less than 1% of students were disciplined for cheating<\/a>. Given that 68% of students cheat, a conservative estimate is that 1\/68 students who cheat are caught (1.5%). Compare this to t<a href=\"https:\/\/www.kansascity.com\/news\/local\/crime\/article12355319.html\">he chance that one gets caught robbing a bank, which is roughly 54%<\/a> &#8211; and the average amount stolen was $6,000.<\/p>\n\n\n\n<h2>What are the benefits of cheating?<\/h2>\n\n\n\n<p>Way more than $6,000. According to a CollegeHumor survey of 30,000 (original source taken down), <a href=\"https:\/\/www.iac.com\/media-room\/press-releases\/cheaters-open-season-begins-colleges-prepare-finals-week-collegehumorcom\">Cheaters had an average GPA of 3.41 while non-cheaters had an average GPA of 2.85<\/a>. This is only correlation and not causation, and it could be the case that people with higher GPAs tend to cheat more. That said, it seems fairly obvious that cheating will raise one&#8217;s GPA, and this gives us a good starting point to quantify this effect- approximately .56 GPA points, or about half of a letter grade. According to this study, after controlling for other various factors such as major choice, <a href=\"https:\/\/digitalcommons.iwu.edu\/cgi\/viewcontent.cgi?article=1098&amp;context=econ_honproj\">half of a letter grade results in a $2,000\/year higher salary<\/a>. Assuming a career is 50 years, this translates into an expected value of $100,000, whereas the expected value of robbing a bank is about $3,000 (and half the time, you&#8217;ll go to jail for up to 20 years). <\/p>\n\n\n\n<p>The penalties for cheating are generally small, and vary from university to university. It ranges from nothing, a decrease of 1 letter grade in the particular course, an automatic fail, and expulsion. In fact, even if cheaters had to pay a $6.5 million dollar fine upon being caught, it would still be worth it to cheat:<\/p>\n\n\n\n<p class=\"has-text-align-center\">$100,000 (benefit of cheating when you get away with it) x 98.5% (chance of not getting caught) + -$6.5 million dollars (paying a 6.5 million dollar fine) x 1.5% (chance of getting caught)=  $1,000 (expected value of cheating). <\/p>\n\n\n\n<p>Thus, even if students were fined 6.5 million dollars for cheating, it would still be a rational choice. While being expelled sucks, it certainly isn&#8217;t a 6.5 million dollar loss. This goes to show that if you aren&#8217;t cheating, you are cheating yourself out of up to $100,000 in lifetime earnings. <\/p>\n\n\n\n<h2>Why do we care about academic honesty anyway?<\/h2>\n\n\n\n<p>There are a lot of benefits to a culture of academic honesty, and perhaps you came up with some of these reasons yourself:<\/p>\n\n\n\n<ol><li>Fairness for students who deserve high GPAs<\/li><li>Protect the value and reputation of a degree<\/li><li>Unqualified people get good jobs<\/li><li>Academic dishonesty undermines the learning of the cheater<\/li><\/ol>\n\n\n\n<p>Cheating is often framed as hurting your fellow students. While getting a higher GPA won&#8217;t decrease the GPA of your peers (unless there is a curve), in the long run it may devalue the worth of a degree. If <em>everyone<\/em> cheated, then this would certainly be true: the grade would become meaningless, except for distinguishing the better cheaters from the lousy cheaters. Yet, what is fascinating about this argument is that it assumes that obtaining a high GPA, graduating, and getting a good job are the most important things about attending school. What ever happened to learning? Person A&#8217;s cheating does not affect or impact person B&#8217;s learning. And if the reason people attend university is to learn, then nobody should care at all about people who cheat. This forces us to confront a reality: &#8220;academic honesty&#8221; exists to perpetuate and enforce a system of grades and a sorting mechanism for the job market. Academic honesty policies would not be necessary if grades were abolished.<\/p>\n\n\n\n<p>That brings us to argument number 4, which is that the person who cheats is not learning the material. Yet, this presents an interesting chicken-or-the-egg scenario. It is arguable that the inability to learn causes cheating, rather than the other way around. Moreover, even if we assume that people have the choice between actually learning the material and cheating, it further reinforces the notion that these students value a high GPA more than they value learning. <\/p>\n\n\n\n<h2>The Solution<\/h2>\n\n\n\n<p>The obvious, clear, and only solution is to abolish grades. As shown earlier, draconian penalties don&#8217;t work, and never will (barring a 7+ million dollar fine). The only way to get rid of cheating is to eliminate the reward. This can be done by making the cheater and non-cheater indistinguishable from each-other when they apply to jobs. Won&#8217;t this penalize honest students who get good grades despite not cheating? Actually, I think the opposite will occur. Without being able to use GPA as a metric, companies will have to figure out how much a student actually learned from university. Honest students who know the material in and out will have a large advantage in these cases.<\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>I was partially inspired by this article that argues that <a href=\"https:\/\/www.wired.com\/2015\/01\/think-students-allowed-cheat\/\">students should cheat<\/a>. Soling argues that students are forced to attend school against their will, and that they are justified in cheating because they don&#8217;t want to be there. Yet, I think students are justified for a different reason: because it is a rational choice to cheat. There is something deeply undesirable about this. After all, it interferes with meritocracy and interferes with true learning. This is a clear sign that the system is broken, and yet another reason that grades should be abolished.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are few beliefs that we (as a society) hold as sacredly as academic honesty. We pretend that cheating does not happen frequently, and that it is an unacceptable behavior. Yet, students are cheating all the time. The following study found that 68% of undergraduates cheated at some point in college: 68% percent is a &#8230; <a title=\"An Easy Way to Permanently End Academic Dishonesty\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2020\/05\/an-easy-way-to-permanently-end-academic-dishonesty\/\" aria-label=\"More on An Easy Way to Permanently End Academic Dishonesty\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":5643,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[38],"tags":[41],"jetpack_featured_media_url":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/cheating-bean.jpeg?fit=400%2C300&ssl=1","jetpack-related-posts":[{"id":536,"url":"https:\/\/jorgezhang.com\/2018\/07\/cheating-in-games\/","url_meta":{"origin":5498,"position":0},"title":"Cheating in games","date":"July 21, 2018","format":false,"excerpt":"Recently, I found an interesting post on the game design reddit page (here), and made a quick comment. Essentially, the poster wanted to know whether cheating in games was a failure of design. Here is what I posted in response: \"Funny story. I had a group of friends and we…","rel":"","context":"In &quot;Game Design&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/07\/IMG_20180720_231740.jpg?fit=900%2C1200&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5432,"url":"https:\/\/jorgezhang.com\/2020\/04\/narrative-evaluation-to-replace-letter-grades\/","url_meta":{"origin":5498,"position":1},"title":"Narrative Evaluation to Replace Letter Grades","date":"April 20, 2020","format":false,"excerpt":"A few weeks ago, I outlined why I believe that grades need to be abolished. The main argument is that grades have alienated students from the real purpose of education. Rather than learn, students obey their teacher's instructions as closely as possible to maximize their grade. Abolishing grades might actually…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/04\/narrative-evaluation.jpg?fit=800%2C800&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5378,"url":"https:\/\/jorgezhang.com\/2020\/03\/universities-must-adopt-permanent-and-universal-as\/","url_meta":{"origin":5498,"position":2},"title":"Universities Must Adopt Permanent and Universal A's","date":"March 29, 2020","format":false,"excerpt":"What do we do about grades in the wake of Covid-19? We have to consider equity- for disadvantaged students, students applying to graduate schools, and anyone who cannot participate in class to their full ability due to the extreme circumstances. At Georgetown University, most students are in favor of \"Double…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/03\/a.png?fit=714%2C720&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5710,"url":"https:\/\/jorgezhang.com\/2020\/06\/why-is-walter-payton-college-preps-student-matriculation-into-top-tier-universities-so-strong\/","url_meta":{"origin":5498,"position":3},"title":"Why is Walter Payton College Prep's Student Matriculation into top tier Universities so Strong?","date":"June 20, 2020","format":false,"excerpt":"Why is Walter Payton College Prep's student matriculation into top tier universities consistently strong, especially in comparison to other high schools in Illinois? Conventional wisdom suggests that this is the result of an extremely competitive environment, or the result of extraordinarily wealthy students. Yet, Payton is nowhere close to the…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/06\/IMG_20160212_110219-scaled.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":693,"url":"https:\/\/jorgezhang.com\/2018\/08\/influence-cards-pt-2\/","url_meta":{"origin":5498,"position":4},"title":"Influence Cards (Pt. 2)","date":"August 11, 2018","format":false,"excerpt":"Today we will be looking at the Red Bullying Influence Cards! These cards cost Friends to purchase, and tend to hurt other players.   This card and Nasty Rumors have gone under a significant change, which is that they now are not immediate effects. This card used to remove 4…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/Nasty-Rumors.png?fit=857%2C1200&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":10860,"url":"https:\/\/jorgezhang.com\/2020\/09\/should-students-choose-their-classes-university-design-problem-part-1\/","url_meta":{"origin":5498,"position":5},"title":"Should Students Choose Their Classes? (University Design Problem Part 1)","date":"September 11, 2020","format":false,"excerpt":"I am taking a class called \"University Design Problem: Georgetown 2030.\" It is an ambitious class: by the end of it, we hope to make a proposal to Georgetown that will create some lasting change in its educational policy. Part of this process is engaging the community, and getting everyone's…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-11-at-12.15.25-AM.png?fit=427%2C366&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5498"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=5498"}],"version-history":[{"count":9,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5498\/revisions"}],"predecessor-version":[{"id":5644,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5498\/revisions\/5644"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/5643"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=5498"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=5498"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=5498"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}