{"id":5689,"date":"2020-06-08T15:05:03","date_gmt":"2020-06-08T20:05:03","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=5689"},"modified":"2020-06-08T16:19:35","modified_gmt":"2020-06-08T21:19:35","slug":"actually-abolishing-the-police-this-could-be-a-really-bad-idea","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2020\/06\/actually-abolishing-the-police-this-could-be-a-really-bad-idea\/","title":{"rendered":"Abolish the Police? This could be a really bad idea"},"content":{"rendered":"\n<p>This is an extremely emotional time for America, and it is important to let our country heal after great tragedy. Yet, we must also recognize that it is extremely dangerous if our policies are made based on feelings and emotions. Yesterday, the <a href=\"https:\/\/www.nytimes.com\/2020\/06\/07\/us\/minneapolis-police-abolish.html\">Minneapolis City Council announced a plan to abolish the Minneapolis police department<\/a>, though did not go into details on what a suitable replacement to the police would look like. What does abolishing the police entail, and is it a feasible option? It is true, the judicial system is far from ideal. Yet, there are a lot of issues with abolishing the police that should not be glossed over. I haven&#8217;t cohesively formed my thoughts yet, and so this post is instead a collection of separate arguments, both for and against abolishing the police, that is meant to generate discussion. I am eager to hear your thoughts, so please let me know what you think in the comments!<\/p>\n\n\n\n<h2>Ineffectiveness of the Judicial System<\/h2>\n\n\n\n<p>I have always been skeptical of the &#8220;eye-for-an-eye&#8221; justice system that solves the issue of crime by re-inflicting the crime upon the criminal. Putting someone in jail will often only make them angry at the system, and not teach them any moral lessons. If the justice system has worked, it has worked because people are afraid of punishment, and not out of moral or conscientious citizens. What if we replaced the police with social workers? Those who commit crimes would be reformed into good citizens rather than incarcerated. They would be given social support and help finding superior alternatives to committing crimes (which are often dangerous and not very lucrative). <\/p>\n\n\n\n<p>What about over-policing? There is a popular theory called &#8220;broken window theory.&#8221; This theory suggests that letting small infractions (vandalism, etc.) go results in people becoming bolder over time and committing more serious crimes in the future &#8211; similar to how one broken window in a house quickly results in the rest of the windows being broken. Yet, we should be highly skeptical of this. It could lead to people, who believe themselves to be innocent, to feel like they are being unfairly prosecuted. If people feel like it does not matter whether they are innocent or guilty &#8211; they will be punished all the same &#8211; then the disincentive to commit crimes disappears. Broken windows theory set the groundwork for increasing police patrols and &#8220;stop and frisk,&#8221; but <a href=\"https:\/\/www.npr.org\/2016\/11\/01\/500104506\/broken-windows-policing-and-the-origins-of-stop-and-frisk-and-how-it-went-wrong\">evidence that this theory works is mixed<\/a>, and can quickly lead to abuse.<\/p>\n\n\n\n<h2>Why are there Bad cops?<\/h2>\n\n\n\n<p>The short answer is that cops enjoy a lot of unreasonable legal protection from scrutiny. This is actually an intention design feature. In 1967, the supreme court created &#8220;<a href=\"https:\/\/theappeal.org\/qualified-immunity-explained\/\">qualified immunity<\/a>.&#8221; The intention was to allow police to do their jobs &#8220;in good faith,&#8221; without having to worry about being sued. For some inexplicable reason, qualified immunity was later expanded so that good faith was no longer a requirement to fall under qualified immunity. Thus, even a cop acting maliciously can enjoy immunity. This means that the mechanism to remove bad cops &#8211; suing them &#8211; is broken. <\/p>\n\n\n\n<p>This brings us to one of the core arguments for abolishing the police, which is that, &#8220;All cops are bad.&#8221; I think this is a vastly over-simplified story. It is true, all cops are capable of doing bad things, yet this is hardly a feasible standard for judging human cops, and completely ignores all the good that order and lawfulness creates- which cops are arguably necessary for. <\/p>\n\n\n\n<p>Another question to ask should be, &#8220;who even wants to be a cop?&#8221; After all, the job is dangerous and <a href=\"https:\/\/www.bls.gov\/ooh\/protective-service\/police-and-detectives.htm#tab-5\">the pay<\/a> is only marginally <a href=\"https:\/\/www.bls.gov\/news.release\/pdf\/wkyeng.pdf\">above average<\/a>. Applicants need a college degree, to pass a strict background test, pass the a 6-month police academy, and then pass probation. Everything included, it takes about 2-3 years <a href=\"https:\/\/www.policeofficer.education\/how-long-does-it-take-to-become-a-police-officer\/\">to become a police officer<\/a>. If we were dealing with failing schools, we would be talking about raising teacher salaries to attract brighter and better teachers. It is the same with police officers- if nobody wants to be a police officer, then you are going to be left with an untalented pool of applicants to fill police positions with. Frankly, you are going to get bad cops. This is another fundamental problem with defunding the police: you are actually going to exacerbate the problem as police salaries fall and talented cops decide to quit the force in pursuit of better opportunities.<\/p>\n\n\n\n<h2>No need for Firemen&#8230; until you do<\/h2>\n\n\n\n<p>Nobody likes paying for things that they don&#8217;t use, and we don&#8217;t call firemen on a day-to-day basis. In rural Tennessee, <a href=\"http:\/\/www.nbcnews.com\/id\/39516346\/ns\/us_news-life\/t\/no-pay-no-spray-firefighters-let-home-burn\/\">a family did not pay the $75 firemen fee<\/a>. When their house was burning, the firemen arrived: to spray the neighboring houses. This resulted in the entire house burning to the ground, and the family lost all of their possessions.<\/p>\n\n\n\n<p>This story is powerful because it shows that even though we might think we do not need the police, when we do we are very glad that they are there. This explains why, across race and gender, people who call 911 are overwhelmingly satisfied with the police:<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/pbs.twimg.com\/media\/EZ8GDxDWsAg_WAP?format=jpg&amp;name=large\" alt=\"Image\"\/><figcaption>Chart taken from <a href=\"https:\/\/twitter.com\/DKThomp\/status\/1269741020717121536\">here<\/a><\/figcaption><\/figure><\/div>\n\n\n\n<p>To abolish a service that is so popular among those who use it would be a disservice to them.<\/p>\n\n\n\n<h2>Centralization is good for the user<\/h2>\n\n\n\n<p>Think about why you use Amazon. Amazon does not always have the best price, and quality is a concern because third-party sellers can sell fakes that are difficult to detect. Amazon offers 1-day shipping, but so does Walmart and other competitors. What makes Amazon stand out? The fact that Amazon has everything. This is a frustration for a lot of board game companies, who would prefer to sell games straight from their website to avoid giving Amazon a cut. Yet, they can&#8217;t do that since nobody goes to their website (despite being cheaper and more reliable than Amazon). After all, most of their orders are from Amazon.<\/p>\n\n\n\n<p>Now think about something like to the police. It is true, most situations involving police do not require firearms. Wouldn&#8217;t it be better if we replaced those situations with unarmed social workers? Perhaps in theory, but in practice it would mean that the user would need to memorize multiple phone numbers for different situations, and be able to differentiate easily between them in case they accidentally call the wrong one. It is also true that you could have an unarmed force that specializes and just enforces, say, traffic violations. Yet, what if these officers encounter a situation where they need a firearm? This is surely inefficient, and could create a massive bureaucracy problem, especially if different agencies need to quickly share information with each-other.<\/p>\n\n\n\n<h2>Reform<\/h2>\n\n\n\n<p>Finally, a strong argument for abolishing police is that police reform has not worked- specifically the implementation of body cameras. The death of George Floyd shows that being on camera does not really prevent bad behavior by police officers (though it can be a tool for achieving justice). All this said, I don&#8217;t think we should rule out reform just yet. The studies on body camera effectiveness still aren&#8217;t conclusive, and not all police departments have them. Loopholes, like a cop being able to turn the body camera off, should be closed before passing a full judgement. While this sounds insensitive, the truth is that reform takes a long time, and we might not see the effects of reform for many years. To pin our hopes on body cameras after the shooting of Michael Brown was much too optimistic.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Do you have any thoughts on abolishing police? Let me know in the comments, and thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is an extremely emotional time for America, and it is important to let our country heal after great tragedy. Yet, we must also recognize that it is extremely dangerous if our policies are made based on feelings and emotions. Yesterday, the Minneapolis City Council announced a plan to abolish the Minneapolis police department, though &#8230; <a title=\"Abolish the Police? This could be a really bad idea\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2020\/06\/actually-abolishing-the-police-this-could-be-a-really-bad-idea\/\" aria-label=\"More on Abolish the Police? This could be a really bad idea\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":5692,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[9],"tags":[],"jetpack_featured_media_url":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/06\/abolish-the-police.jpg?fit=640%2C335&ssl=1","jetpack-related-posts":[{"id":5378,"url":"https:\/\/jorgezhang.com\/2020\/03\/universities-must-adopt-permanent-and-universal-as\/","url_meta":{"origin":5689,"position":0},"title":"Universities Must Adopt Permanent and Universal A's","date":"March 29, 2020","format":false,"excerpt":"What do we do about grades in the wake of Covid-19? We have to consider equity- for disadvantaged students, students applying to graduate schools, and anyone who cannot participate in class to their full ability due to the extreme circumstances. At Georgetown University, most students are in favor of \"Double…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/03\/a.png?fit=714%2C720&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5432,"url":"https:\/\/jorgezhang.com\/2020\/04\/narrative-evaluation-to-replace-letter-grades\/","url_meta":{"origin":5689,"position":1},"title":"Narrative Evaluation to Replace Letter Grades","date":"April 20, 2020","format":false,"excerpt":"A few weeks ago, I outlined why I believe that grades need to be abolished. The main argument is that grades have alienated students from the real purpose of education. Rather than learn, students obey their teacher's instructions as closely as possible to maximize their grade. Abolishing grades might actually…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/04\/narrative-evaluation.jpg?fit=800%2C800&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5710,"url":"https:\/\/jorgezhang.com\/2020\/06\/why-is-walter-payton-college-preps-student-matriculation-into-top-tier-universities-so-strong\/","url_meta":{"origin":5689,"position":2},"title":"Why is Walter Payton College Prep's Student Matriculation into top tier Universities so Strong?","date":"June 20, 2020","format":false,"excerpt":"Why is Walter Payton College Prep's student matriculation into top tier universities consistently strong, especially in comparison to other high schools in Illinois? Conventional wisdom suggests that this is the result of an extremely competitive environment, or the result of extraordinarily wealthy students. Yet, Payton is nowhere close to the…","rel":"","context":"In &quot;Other&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/06\/IMG_20160212_110219-scaled.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5498,"url":"https:\/\/jorgezhang.com\/2020\/05\/an-easy-way-to-permanently-end-academic-dishonesty\/","url_meta":{"origin":5689,"position":3},"title":"An Easy Way to Permanently End Academic Dishonesty","date":"May 27, 2020","format":false,"excerpt":"There are few beliefs that we (as a society) hold as sacredly as academic honesty. We pretend that cheating does not happen frequently, and that it is an unacceptable behavior. Yet, students are cheating all the time. The following study found that 68% of undergraduates cheated at some point in…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/05\/cheating-bean.jpeg?fit=400%2C300&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":2133,"url":"https:\/\/jorgezhang.com\/2019\/11\/change-up-review\/","url_meta":{"origin":5689,"position":4},"title":"Change Up Review","date":"November 27, 2019","format":false,"excerpt":"Change Up was an interesting game for us to review as it is a memory game. People in our club ended up liking the game overall- with 5 people voting it as a decent game in our anonymous poll, with no downvotes. Change Up Rules In Change Up, players take…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/11\/IMG_20190817_202056.jpg?fit=900%2C1200&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1903,"url":"https:\/\/jorgezhang.com\/2019\/09\/villagers-group-review\/","url_meta":{"origin":5689,"position":5},"title":"Villagers- Group Review","date":"September 22, 2019","format":false,"excerpt":"Villagers was a very solid game that our group really enjoyed! We tried something new for this review by filming a portion of our game, which you can find here once it uploads: https:\/\/youtu.be\/Iewv5AbgDgo. We plan to make many more videos of us playing games, so if you enjoy this…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/09\/IMG_20190921_190141.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5689"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=5689"}],"version-history":[{"count":2,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5689\/revisions"}],"predecessor-version":[{"id":5693,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/5689\/revisions\/5693"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/5692"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=5689"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=5689"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=5689"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}