{"id":720,"date":"2018-08-14T04:35:22","date_gmt":"2018-08-14T04:35:22","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=720"},"modified":"2018-08-14T04:35:22","modified_gmt":"2018-08-14T04:35:22","slug":"twilight-imperium-3rd-edition-review","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2018\/08\/twilight-imperium-3rd-edition-review\/","title":{"rendered":"Twilight Imperium 3rd Edition Review"},"content":{"rendered":"<p>I&#8217;ve talked about other board games before, but this is my first official board game review. Today I will be reviewing the longest board game I have ever played: Twilight Imperium 3rd Edition.<\/p>\n<p>I played in a five player game that took place over the course of 2 days and a playing period of about 16 hours. Three of us, including me, were new to the game. Because of this, most of us were unwilling to engage in combat. Throughout the entire game, peace was only broken a couple of times, and even then, the battles were conservatively fought. However, in the very last turn, I saw an opportunity to break this peace. E<span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">veryone except me and my neighbor, the Jol Nar, had passed. My other neighbor, the Mentak, had been my ally for the entire game. The Mentak had accumulated almost every single trade good in the supply at the cost of military strength: they were easy to invade, but wouldn&#8217;t be for much longer. I knew that they had<\/span><span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\"> 3 planets with different technology tags, which I could invade to gain a victory point. Combined with my secret objective and an artifact planet within reach, I decided to go for my 10 VP to win the game. My War Suns pushed into Mentak territory, easily occupying the home system and two systems bordering it.<\/span><span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\"> This invasion was the mistake that would lead to my own undoing. While I was busy focusing on my invasion, the Jol Nar formed his own plans. <\/span><span style=\"font-family: -apple-system, BlinkMacSystemFont, Segoe UI, Roboto, Oxygen-Sans, Ubuntu, Cantarell, Helvetica Neue, sans-serif;\">He sprung at the opportunity to capture the much-fought over planet Star Point, as well as a couple other key planets, and won the game that very turn. The culmination of 16 hours of posturing and negotiating ended in a very bloody and brief moment, <\/span>surprising<span style=\"font-family: -apple-system, BlinkMacSystemFont, Segoe UI, Roboto, Oxygen-Sans, Ubuntu, Cantarell, Helvetica Neue, sans-serif;\"> almost everyone at the table (or in this case, floor).<\/span><\/p>\n<p>For anyone unfamiliar with Twilight Imperium, it is a political galactic domination game. The rulers of the galaxy are looking for one faction to inherit the position of galactic leader, and they decide to appoint that faction based off of several public and secret objectives. By completing these objectives, a player gains victory points that represent how much influence with the rulers of the galaxy they have. By getting 10 VP, that player wins. While a strong military is necessary to accomplish some of the objectives, such as my secret objective to take control of another player&#8217;s home system, many rely on gaining technological or economic advances. Some objectives require players to spend trade goods, or money. Others may depend on building enough of a certain type of building or ship.<\/p>\n<p>This brings me to the first of three great things about Twilight Imperium 3:<\/p>\n<ol>\n<li>Winning the game requires adaptive strategies<\/li>\n<li>Strategy card drafting<\/li>\n<li>Extremely political<\/li>\n<\/ol>\n<p>Because of the fact that the objectives of each game are different, players have to do different things in order to gain victory points. In one game you could be trying to build up a strong military and conquer everyone else. In others, you might need to create a strong economy, or the most technological advances. This keeps every game interesting and introduces a lot more skill. It somewhat prevents dominant strategies from appearing since the &#8220;dominant strategy&#8221; depends on the situation. I really like this element of Twilight Imperium because it rewards players that can identify what they need to do to adapt to a certain situation. I only wish that these were even more of a thing: often times the early public objectives seemed like things that were always going to happen. For example, one of these objectives was &#8220;build 3 Space docks&#8221;. Space docks are really important because without them you can&#8217;t build any other units. Because everyone built 3 Space docks eventually, it was as if this objective didn&#8217;t exist.<\/p>\n<p>Strategy cards are, in my opinion, the real meat of the game. At the beginning of each round every player takes a Strategy card that they have to play on one of their turns before passing. They are aptly named Strategy Cards because these cards facilitate different strategies. For example, the Trade card allows players trade with others and create economic profits. The Warfare card is used for expansion and, well, war. Depending on your strategy, you need to pick a strategy card that suits your needs. If someone else picks the strategy card that you wanted first then it is tough luck. You either have to pick the Initiative strategy, allowing you to make the first play and also giving you first pick the next time around, or adapt your turn to a different strategy card.<\/p>\n<p>One of my favorite moments of the game was when I threatened the Jol Nar to not pick the Imperial Card. I told him that if he picked it, because I had a higher initiative, I would attack his outpost on Mecatol Rex before he could get a turn. While he could have taken the card anyway, a war at this time would have set back his economy due to him losing crucial ships. He also wanted to hold onto Mecatol Rex as it was a strategically important system.<\/p>\n<p>Since there are 8 Strategy cards in total, there will always be some left-over. It is also no secret that some strategy cards are garbage most of the time, such as the Diplomacy strategy card. These unwanted strategy cards accumulate bonuses that can be exchanged for command counters or trade goods for each turn they are not taken, incentivizing players to take them in the future. This simple mechanic might be my favorite part of strategy cards: at some point, a certain strategy card will be worth it for its bonuses even if it isn&#8217;t actually that useful at the moment. Every single strategy card was drafted at some point with regular frequency.<\/p>\n<p>Finally, it goes without saying that Twilight Imperium is a very political game. I think that there should be a distinction made between a political game and a negotiation game (as I define them). While Twilight Imperium has a lot of negotiation elements, private conversations and secret deals are rare. Unlike games such as Diplomacy, where players talk to each-other about their future plans, Twilight Imperium creates a situation where players talk about things that just happened. Maybe the Jol Nar just got their 7th victory point, and now the galactic community has to do something about it. Or maybe the Sardakk N&#8217;orr have occupied the home system of another player, and the galactic community has to decide whether this is good (because players who have occupied home systems cannot gain VP) or bad (as now the Sardakk N&#8217;orr have shown their aggression). There is even a mechanic that allows players to vote on new &#8220;laws&#8221; that can change the rules of the game. This was a very interesting mechanic that resulted in several hour-long segways. Ultimately though, none of the &#8220;laws&#8221; ended up changing anything because players would go back and forth until compromise was made (the compromises were always to keep the status quo). I never felt more like I was in congress than when I was voting on these galactic laws.<\/p>\n<p>After the game, we decided that the game was a lot like the cold war. In order to keep up with everyone else, one had to make expensive technology advances and build stronger units. However, ultimately it was almost never beneficial to actually use those units in combat. Instead, using them to make deals and threats was often times a lot more useful.<\/p>\n<p>And I think that really sums up the game. It is extraordinarily long, but only because the vast majority of it is talking about what is happening, and each player trying to negotiate themselves to victory. If players couldn&#8217;t talk, the game would be a lot shorter. It also probably wouldn&#8217;t be fun.<\/p>\n<p>I can see why this game would be a hit or miss depending on what type of games you and your group enjoy. So here is a guide you can use to get your own rating:<\/p>\n<p>+1 point if you enjoy games that can involve betrayal<\/p>\n<p>+1 point if you like space themed games<\/p>\n<p>+1 point if you enjoy managing an economy<\/p>\n<p>+1 point if you enjoy war games<\/p>\n<p>+1 point if you are competitive about winning over all else<\/p>\n<p>+1 point if you are not very susceptible to &#8220;analysis paralysis&#8221;<\/p>\n<p>+2 points if you enjoy games that involve heavy negotiation elements<\/p>\n<p>+3 points if you can play a board game for over 10 hours if necessary (often times to the bitter end)<\/p>\n<p>+5 points if you control Mecatol Rex<\/p>\n<p>If you got 7 points or more, you should definitely consider this game!<\/p>\n<p>Let me know what you thought of this review by leaving a comment. Thanks for reading, and make sure to subscribe if you enjoy this content!<\/p>\n<p>&nbsp;<\/p>\n<p>Here is a picture of our game right after we started to clean up (Oops. Next time I will try to take a picture sooner):<\/p>\n<p><img data-attachment-id=\"721\" data-permalink=\"https:\/\/jorgezhang.com\/2018\/08\/twilight-imperium-3rd-edition-review\/img_20180811_211613\/#main\" data-orig-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?fit=4608%2C3456&amp;ssl=1\" data-orig-size=\"4608,3456\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;LEX727&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1534022173&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;4.04&quot;,&quot;iso&quot;:&quot;885&quot;,&quot;shutter_speed&quot;:&quot;0.04&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"IMG_20180811_211613\" data-image-description=\"\" data-medium-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?fit=300%2C225&amp;ssl=1\" data-large-file=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?fit=1024%2C768&amp;ssl=1\" loading=\"lazy\" class=\"alignnone size-full wp-image-721\" src=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?resize=1200%2C900&#038;ssl=1\" alt=\"\" width=\"1200\" height=\"900\" srcset=\"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?w=4608&amp;ssl=1 4608w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?resize=300%2C225&amp;ssl=1 300w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?resize=768%2C576&amp;ssl=1 768w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?resize=1024%2C768&amp;ssl=1 1024w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?w=2400&amp;ssl=1 2400w, https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?w=3600&amp;ssl=1 3600w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" data-recalc-dims=\"1\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>I&#8217;ve talked about other board games before, but this is my first official board game review. Today I will be reviewing the longest board game I have ever played: Twilight Imperium 3rd Edition. I played in a five player game that took place over the course of 2 days and a playing period of about 16 &#8230; <a title=\"Twilight Imperium 3rd Edition Review\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2018\/08\/twilight-imperium-3rd-edition-review\/\" aria-label=\"More on Twilight Imperium 3rd Edition Review\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":721,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[6],"tags":[],"jetpack_featured_media_url":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180811_211613.jpg?fit=4608%2C3456&ssl=1","jetpack-related-posts":[{"id":841,"url":"https:\/\/jorgezhang.com\/2018\/08\/twilight-struggle-review\/","url_meta":{"origin":720,"position":0},"title":"Twilight Struggle Review","date":"August 31, 2018","format":false,"excerpt":"Hey everyone! Recently, I had a chance to play one of my favorite games of all time, Twilight Struggle. Before playing Twilight Struggle, I had decided that all two-player games were not very fun. My theory was that a game like Chess was fun purely because of the logical deductions and…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180830_182724.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1786,"url":"https:\/\/jorgezhang.com\/2019\/06\/interview-with-the-friendly-boardgamer\/","url_meta":{"origin":720,"position":1},"title":"Interview with the Friendly Boardgamer","date":"June 6, 2019","format":false,"excerpt":"The Friendly Boardgamer just released an interview featuring me! You can check out the original article here: https:\/\/thefriendlyboardgamer.wordpress.com\/2019\/06\/05\/jorge-zhang-daggers-highschool\/ Here is the article: This interview is with Jorge Zhang who is the designer of Daggers Highschool, a game about bribing your way in to the best University. We also talked about…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/08\/IMG_20180812_233808.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":1096,"url":"https:\/\/jorgezhang.com\/2019\/02\/daggers-high-at-polar-vortex-2019\/","url_meta":{"origin":720,"position":2},"title":"Daggers High at Polar Vortex 2019","date":"February 1, 2019","format":false,"excerpt":"Daggers High at the 2019 Polar Vortex convention.","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/02\/3p-January-Polar-Vortex.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":2163,"url":"https:\/\/jorgezhang.com\/2019\/11\/manhattan-project-energy-empire-review\/","url_meta":{"origin":720,"position":3},"title":"Manhattan Project: Energy Empire Review","date":"November 30, 2019","format":false,"excerpt":"Manhattan Project: Energy Empire is a worker placement Euro game that also serves as an interesting commentary on climate change. 3 out of 3 members who rated this game rated it as a good game. Us playing Energy Empire Rules: In Energy Empire, each player takes the role of a…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/11\/IMG_20191012_141957.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1470,"url":"https:\/\/jorgezhang.com\/2019\/04\/what-makes-wingspan-soar-discussion-and-review\/","url_meta":{"origin":720,"position":4},"title":"What makes Wingspan Soar? Discussion and Review","date":"April 9, 2019","format":false,"excerpt":"Hi everyone. Before I bring you this post, I wanted to mention that I am now a contributor for the Meeple Times. Because of that, you can also find this article onto the Meeple times website. You can find it here: https:\/\/meepletimes.com\/opinions\/what-makes-wingspan-soar-discussion-and-review\/ Hey everyone! Today I wanted to talk a…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/wingspan.jpg?fit=550%2C550&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1488,"url":"https:\/\/jorgezhang.com\/2019\/07\/shasn-rulebook-review-a-game-where-you-are-the-politician\/","url_meta":{"origin":720,"position":5},"title":"Shasn Rulebook Review: A Game Where You are the Politician","date":"July 16, 2019","format":false,"excerpt":"Hey everyone. Today, I am here with a Rulebook Review of Shasn. This review will be split into two sections: First, I will talk about the rulebook quality. In the second section, I will talk a bit about the gameplay and theme. Please keep in mind that the first portion…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/shasn.jpg?fit=1030%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/720"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=720"}],"version-history":[{"count":6,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/720\/revisions"}],"predecessor-version":[{"id":733,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/720\/revisions\/733"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/721"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=720"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=720"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=720"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}