{"id":939,"date":"2018-11-11T02:13:20","date_gmt":"2018-11-11T02:13:20","guid":{"rendered":"https:\/\/jorgezhang.com\/?p=939"},"modified":"2019-03-09T04:36:50","modified_gmt":"2019-03-09T04:36:50","slug":"wdc-2018-aar","status":"publish","type":"post","link":"https:\/\/jorgezhang.com\/2018\/11\/wdc-2018-aar\/","title":{"rendered":"WDC 2018 AAR"},"content":{"rendered":"<p>A few weeks ago, I traveled to DC for the 2018 world championships of Diplomacy. The tournament featured 4 rounds, and so I thought I&#8217;d share a bit about each round, including several of the mistakes I made on several of my boards. I also want to talk a little bit about why I made some of the choices that I decided to make. I wish I could go beyond a couple of seasons with screenshots, but I didn&#8217;t take any pictures of the games and have forgotten the exact movements. I&#8217;ve provided pictures if I remembered them.<\/p>\n<p><strong>Round 1, Board 8<\/strong><\/p>\n<p style=\"font-weight: 400;\">Austria: Jorge Zhang<\/p>\n<p style=\"font-weight: 400;\">England: Jordan Connors<\/p>\n<p style=\"font-weight: 400;\">France: Vanessa Smith<\/p>\n<p style=\"font-weight: 400;\">Germany: Pierre Khawaja<\/p>\n<p style=\"font-weight: 400;\">Italy: Patrick Oathout<\/p>\n<p style=\"font-weight: 400;\">Russia: Bernard Andrioli<\/p>\n<p style=\"font-weight: 400;\">Turkey: Victor Degliame<\/p>\n<p>&nbsp;<\/p>\n<p>I knew Bernard Andrioli\/Russia from a previous game where we had a key lepanto type of deal. I didn&#8217;t remember too many of the details, but I thought we had worked pretty well together and so I decided to talk to him out of the gate. I was pretty enthusiastic in talking with Bernard, but he seemed pretty distant which made me wonder if he could really be trusted. He also seemed to remember us not working together in our previous game, which added to my doubt. Still, I negotiated a DMZ in Galicia with him due to the fact that neither of us knew the other 5 players and they were all online players.<\/p>\n<p>After talking with Italy, I got a really good feeling about him as he swore that he was not going to Trieste. Very few people can say that with a straight face with direct eye contact and lie about it. So I figured I didn&#8217;t have to worry about Trieste. I also talked with Turkey, who wasn&#8217;t very interested in opening to Armenia. I think he actually admitted in our conversation that he wanted to work with Russia. This started making me really worry about Bernard opening to Galicia.<\/p>\n<p>So, I make what is probably my largest mistake all weekend: Vienna-Galicia. I end up making it. Italy holds in Venice and Turkey opens pretty standard. While it seems minor, what it did was antagonize my relationship with Bernard and prevent me from easily blocking Trieste in the fall. I think this is why Italy decides to stab me the next year despite us having a decent understanding in spring 01. What I should have done is ask Bernard for a bounce in Galicia. That would have prevented me from damaging our relations and also would completely change the dynamic between Italy and I.<\/p>\n<p>(bear with me as I am recreating this from memory a week after the fact, and only remember my region).<\/p>\n<p><img data-attachment-id=\"940\" data-permalink=\"https:\/\/jorgezhang.com\/2018\/11\/wdc-2018-aar\/screen-shot-2018-10-11-at-3-11-46-pm\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.11.46-PM.png?fit=410%2C394&amp;ssl=1\" data-orig-size=\"410,394\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Screen Shot 2018-10-11 at 3.11.46 PM\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.11.46-PM.png?fit=300%2C288&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.11.46-PM.png?fit=410%2C394&amp;ssl=1\" loading=\"lazy\" class=\"size-full wp-image-940 aligncenter\" src=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.11.46-PM.png?resize=410%2C394&#038;ssl=1\" alt=\"\" width=\"410\" height=\"394\" srcset=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.11.46-PM.png?w=410&amp;ssl=1 410w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.11.46-PM.png?resize=300%2C288&amp;ssl=1 300w\" sizes=\"(max-width: 410px) 100vw, 410px\" data-recalc-dims=\"1\" \/><\/p>\n<p>Ok. I go apologize to Bernard immediately. I really want to patch things up with him because otherwise I am waiting to be killed. I tell him that he can do whatever he wants me to do with Galicia and I offer to support him to Rumania. Instead, he tells me to go to Vienna. I write that order.<\/p>\n<p>I then rush over to Italy and get another confirmation that he will not go to Trieste. I figure he might go for it, but I also figure that if he does I can build A Budapest and it won&#8217;t be a big deal. I talk with Turkey but it is clear he is uninterested in going after Russia in the slightest. I make another mistake here. I should have connected the dots before heading into the fall moves, which are a catastrophe.<\/p>\n<p><img data-attachment-id=\"941\" data-permalink=\"https:\/\/jorgezhang.com\/2018\/11\/wdc-2018-aar\/screen-shot-2018-10-11-at-3-17-55-pm\/#main\" data-orig-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.17.55-PM.png?fit=409%2C392&amp;ssl=1\" data-orig-size=\"409,392\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Screen Shot 2018-10-11 at 3.17.55 PM\" data-image-description=\"\" data-medium-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.17.55-PM.png?fit=300%2C288&amp;ssl=1\" data-large-file=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.17.55-PM.png?fit=409%2C392&amp;ssl=1\" loading=\"lazy\" class=\"size-full wp-image-941 aligncenter\" src=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.17.55-PM.png?resize=409%2C392&#038;ssl=1\" alt=\"\" width=\"409\" height=\"392\" srcset=\"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.17.55-PM.png?w=409&amp;ssl=1 409w, https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.17.55-PM.png?resize=300%2C288&amp;ssl=1 300w\" sizes=\"(max-width: 409px) 100vw, 409px\" data-recalc-dims=\"1\" \/><\/p>\n<p>At first I am shocked by the moves which leave me at 0 builds. I couldn&#8217;t understand why Turkey would try to help Italy into Greece and risk him getting to five builds. I&#8217;m a bit disoriented, but I don&#8217;t have time to think about it so I go to Russia and tell him that we need to work together and pointed out my move from Gal to Vie. I get a very mild response from him, so I drop the big question, &#8220;Are you going to Galicia?&#8221;. He reluctantly tells me that he has to go to Galicia because it is the only move that makes sense for him.<\/p>\n<p>This is when the puzzle pieces come together for me. It&#8217;s a Russia-Turkey Alliance, which is why Turkey wanted to support Italy into Greece. Turkey never intended for Italy to be in Greece at all- he just wanted us to bounce there for the steamroller! I rush over to Italy and tell him that it&#8217;s a RT and that he has to support Serbia to hold and move to the Aegean Sea. I also talk with England and convince him to start making his way over to St Petersburg to hit Russia as well.<\/p>\n<p><img data-attachment-id=\"942\" data-permalink=\"https:\/\/jorgezhang.com\/2018\/11\/wdc-2018-aar\/screen-shot-2018-10-11-at-3-27-58-pm\/#main\" data-orig-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?fit=402%2C364&amp;ssl=1\" data-orig-size=\"402,364\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Screen Shot 2018-10-11 at 3.27.58 PM\" data-image-description=\"\" data-medium-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?fit=300%2C272&amp;ssl=1\" data-large-file=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?fit=402%2C364&amp;ssl=1\" loading=\"lazy\" class=\"size-full wp-image-942 aligncenter\" src=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?resize=402%2C364&#038;ssl=1\" alt=\"\" width=\"402\" height=\"364\" srcset=\"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?w=402&amp;ssl=1 402w, https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?resize=300%2C272&amp;ssl=1 300w\" sizes=\"(max-width: 402px) 100vw, 402px\" data-recalc-dims=\"1\" \/><\/p>\n<p>Something like this happens, which changes the dynamic in the south. I&#8217;m pretty confident in my Italian ally and that he understands the threat of the RT, so I don&#8217;t spend a lot of time talking to him. This is a mistake because he ends up stabbing me. I also talk with Russia and Turkey and try to get one of them to turn on the other.<\/p>\n<p>Instead of supporting me, Italy ends up supporting Russia into Budapest. So, I immediately grab him and try to figure out why he would be helping Russia, especially with the RT still very strong. He apologizes, and we make a plan to put him into Budapest. I also talk with Turkey at this point, who is now interested in attacking Russia. We all follow through, and things are starting to finally look good for me.<\/p>\n<p>The next few years unfortunately do not go very well. I keep asking Italy to give me back a home supply center, which he agrees to, and then doesn&#8217;t follow through with. Unfortunately, I can&#8217;t force him to give me back a home supply center, so I ask Turkey to help me out. Turkey stabs me too, and I end up on one supply center in Budapest. At this point in the game, I thought I would be eliminated as it was pretty clear that Italy and Turkey were solid allies. I think though that Italy felt really bad about stabbing me so often. So when I pitched him on attacking Turkey, he jumped on board despite me secretly knowing that it would probably not work. I felt though that it was my only chance of survival, so I suppressed those complaints and tried my best to get Italy and Turkey to fight.<\/p>\n<p>It ends up disastrously for Italy, who actually ends up losing supply centers after the stab. It also wastes precious time because by now England has reigned supreme over the West: controlling almost all of Germany and northern Russia. So I get both Italy and Turkey together and tell them that if they don&#8217;t work together, then England will solo the board. The rest of the game is pretty boring- we get to the stalemate lines and I end up getting Warsaw, getting to 2 supply centers.<\/p>\n<p>England makes a pretty good pitch to me here, which is that I am just helping the guys who screwed me over all game. I heavily considered throwing a solo, but I decided that it was a bit early in the tournament to throw a solo (and I also really wanted to eat). So I decided to stick to the stalemate line. We call a draw vote soon after, and everyone votes for the draw.<\/p>\n<p>Thinking back on this round though, I think I could have easily vetoed this draw and gotten away with it. Everyone on the board was exhausted of playing- we were one of the last boards still going. In addition, I had a build after taking Warsaw and was thus completely behind Turkey\/Italy&#8217;s lines. It would have been very easy to convince Italy to keep pressing England with his fleets through the MAO and Turkey to keep pressing northern Russia and Germany, while taking back my home centers. I don&#8217;t know if they would have let me get away with it- but reflectively 2 supply centers is a very low amount of points, and I might as well have tried since I had nothing to lose.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Round 3, Board 4<\/strong><\/p>\n<p style=\"font-weight: 400;\">Round 3, Board 4<\/p>\n<p style=\"font-weight: 400;\">Austria: Doc Binder<\/p>\n<p style=\"font-weight: 400;\">England: John Avina<\/p>\n<p style=\"font-weight: 400;\">France: Jorge Zhang<\/p>\n<p style=\"font-weight: 400;\">Germany: Christian Pedone<\/p>\n<p style=\"font-weight: 400;\">Italy: Tim Richardson<\/p>\n<p style=\"font-weight: 400;\">Russia: Peter McNamara<\/p>\n<p style=\"font-weight: 400;\">Turkey: Mike McMillie<\/p>\n<p>&nbsp;<\/p>\n<p>That was a really long AAR! So I&#8217;m going to keep the rest of them short to save time.<\/p>\n<p>I ended up skipping round 2 since everyone had a mandatory drop round, and two of my friends had agreed to try out my game. So, the next day I had this board.<\/p>\n<p>Here&#8217;s the story. I talked with England and asked for a DMZ in the Channel, which he agreed to. I then talked with Germany, who told me that England was going to the Channel. Hmmmm. So, I talked to England again and confronted him about it. &#8220;Are you going to the Channel,&#8221; I asked. England kept being shifty and not giving me a clear answer, which was a pretty dead giveaway to me that he would be going to the Channel. I felt like this was very odd though, and I suspected an attack on Burgundy by Christian. The thing was, I didn&#8217;t want to make him upset by ending up in Burgundy. Thus, I settled on the mediocre Par-Bur, Mar-Bur, Bre-Eng.<\/p>\n<p>This ends up being very, very bad. Italy is in Piedmont, Germany does not go to Burgundy, and England bounces me in the Channel. Germany\/Christian actually talks to me here and tells me how much of a blunder it was. He brings up a very good point, which is that he wouldn&#8217;t have told me that England was going to the Channel if he had planned on going to Burgundy. I apologize, and I meant it since it is looking like I will not get any builds this year. My only hope is to convince Italy to not take Marseilles.<\/p>\n<p>I spend most of this season talking to Italy. I tell him that while he could take Marseilles, he wouldn&#8217;t be able to keep it. And that me not getting any builds would throw the board balance off- with Christian getting three builds and then having the ability to roll over me and be a runaway board leader, especially with England insisting on going to the Channel every turn. In return for not taking Marseilles, I promise that I would help him however I could for the rest of the game, and also that he would be able to decide what I built.<\/p>\n<p>Italy buys my argument, and he lets me keep Marseilles, instead sending his army back to Venice. I walk into Burgundy and bounce the Channel again, and build a unit in Paris. After this event though, the game actually becomes pretty boring. There is an eastern triple of Austria\/Turkey\/Russia, and in response, Germany is able to convince both me and England to go to the lines to stop them. I send my fleets to Italy to help to repay him for letting me build in 01. I have several good opportunities to stab, but I think that would have been a bad move as both Germany and England were threatening to throw if one of them were betrayed. In addition, I would have had to pull me fleets back from helping Italy, which I didn&#8217;t really want to do.<\/p>\n<p>Despite my help, Italy gets eliminated because of several bad guesses. And the game is now stalled at a 7\/6\/6\/5\/5\/5, and the draw actually passes. It was pretty frustrating because it wasn&#8217;t a good result for anyone. Afterwards, Germany told me that he probably would have given me a supply center to put me from 6 to 7, since Austria was on 7 and might have broken up his alliances if he was no longer the board top. Unfortunately, I didn&#8217;t think of this argument and so it didn&#8217;t happen. It&#8217;s something I will keep in mind for future games though.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"font-weight: 400;\"><strong>Round 4, Board 8<\/strong><\/p>\n<p style=\"font-weight: 400;\">Austria: Nicolas Sahuguet<\/p>\n<p style=\"font-weight: 400;\">England: Brian Ecton<\/p>\n<p style=\"font-weight: 400;\">France: Edi Birsan<\/p>\n<p style=\"font-weight: 400;\">Germany: Michael Topczewski<\/p>\n<p style=\"font-weight: 400;\">Italy: Dan Wang<\/p>\n<p style=\"font-weight: 400;\">Russia: Rachael Storey<\/p>\n<p style=\"font-weight: 400;\">Turkey: Jorge Zhang<\/p>\n<p>&nbsp;<\/p>\n<p>This game was pretty disastrous as I ended up repeatedly being my worst enemy throughout the game. This is in part due to a meta-game shift: as this was the last round before the top board, I (and most other players) would need a large score to win. Anyway, my initial negotiations went really well. Russia immediately offered to DMZ the Black Sea and bounce in Armenia. Now, I normally would be very cautious about this type of deal as Russia could theoretically break the DMZ. However, I&#8217;ve actually been secretly interested in trying an opening where Russia and Turkey DMZ the Black Sea in FTF for a long time, and my read on Russia was that this was a sincere offer. This decision was solidified by my neighboring powers. Austria was a player I had played with several times, and is very good at diplomacy. Italy on the other hand was dead set on attacking France to the point of being very difficult to negotiate with. <span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">This set up could go out of hand quickly if I didn&#8217;t move to check Austria.<\/span><\/p>\n<p>I spent most of my time talking to Italy, which was pretty much a mistake since it drained very valuable time that I could have used to find out the rest of the board dynamics. I eventually got him to agree to move to Trieste though. I also got Russia to move to Galicia- and I make a huge mistake here which is I tell her in the last few minutes before the deadline to scrap the plan and move Sevastopol to Rumania. I was thinking that the bounce in Armenia would be a wasted move, but it ends up biting me back later. Anyway, I am very frustrated by the opening moves: Austria uses Budapest to bounce Gal and Vienna to bounce Trieste, and is able to get his fleet into Albania. Moreover, Russia moves Moscow to St Petersburg, which is not terrible but it also makes it difficult to attack Austria.<\/p>\n<p>I do some investigating and it turns out both Russia and Italy spilled the beans about their moves to Austria, which is pretty frustrating since I had been lying to Austria over the turn to not arouse his suspicions. Moreover, Italy moves his fleet to the Tyrhenian Sea, which makes it impossible for me to try and convince him to move to Greece and bounce the Austrian fleet in Albania. Regardless, here I know that I need to bounce Serbia as it would just incentivize Austria and Russia too much to attack me if he ended up in Serbia\/Greece and 2 builds. This way, I also know that I can guarantee the capture Greece in the next year. Italy moves further west- heading to Piedmont and convoying an army to Tunis. He&#8217;s completely out of position now. I do end up in the Aegean Sea and bounce Serbia as expected.<\/p>\n<p>Here is the problem that I mentioned earlier. Due to my insistence of sending Sevastopol to Rumania, it creates a situation where the only way to get Russia&#8217;s newly built A Sevastopol to Rumania is to let the fleet in Rumania head to the Black Sea. This is very suboptimal for me as it means that Russia can stab me brutally at any time. In fact, had I spent less time talking to Italy and more time thinking through basic opening strategy, the right moves would have been to have Russia move to Ukraine and Galicia, and bounce in Armenia so that we could support Ukraine to Rumania.<\/p>\n<p>I tell Russia that she can go to the Black Sea anyway though, after some careful calculation. I figure that if I refuse to let her into the Black Sea, there&#8217;s a very high chance that she will go there anyway and work with Austria. I also know that we need the army in Rumania to have any shot of defeating Austria, and so I take the gamble. It pays off- Russia never stabs me for the rest of the game despite many players telling her to. Props to her. However, it also boxes me in and I actually spent the vast majority of the game a few supply centers behind Russia.<\/p>\n<p>I also figure that the best way to deal with Italy is to encourage him to fight France at this point, as it&#8217;s clear that it is what he unconditionally wants to do. We actually end up working very well together here, and I forgo taking Tunis or Naples to help him against France. He never fully trusts me though, which is a bummer since if we were working perfectly I think there would have been a decent chance of taking a French supply center. Unfortunately, we get stuck and I have to stab him at the end of the game.<\/p>\n<p>Anyway, a few years pass and Austria is on 2 centers and decides to join the Russia\/Turkey alliance. We have Germany surrounded and can take Munich\/Berlin, and Russia has fleets all the way in the North Sea. Here is a critical point in the game where I make a few diplomatic missteps. Firstly, Germany, Russia, and I have a discussion on what we want out of the game. Russia just wants a shared board top. Germany wants a good result. I say here that I just want a decent result as well, but Germany starts questioning my previous games and what result I needed to get on the top board. What I should have done here is say that I had two very mediocre results (it was true) and that I was just looking to have fun. I said instead something along the lines of, &#8220;well, if I got a solo I would get on the top board.&#8221; It&#8217;s a slip up that I regretted as soon as I said it, but it immediately turns both Germany and Russia against me, and for the rest of the game they become pretty dead set on not letting me get anywhere above 8 supply centers. I try to cover it up by saying that my only goal in the game is to end up higher than Edi Bersan, who was playing France, and that I&#8217;d draw if we took most of his centers and eliminated him. This works for about one season: Russia decides to essentially hold all of her units in place, but Germany ends up stabbing France by entering Burgundy. He backs out however, likely due to one of my other diplomatic\/tactical slip-ups.<\/p>\n<p>This one is a bit nuanced, but Austria had been extremely loyal to me once he hit 2 supply centers. He wrote whatever orders I requested without any questions. However, during this turn he was set to gain a supply center and get a build. I really didn&#8217;t want Nicolas to have a build because I knew this could very quickly snowball and get out of hand. So I stab him by taking one of his home centers, which prevents him from building. This removed any incentive for him to keep working with me, since he realized that I was never going to let him grow. Nicholas is pretty upset, and demands an explanation for why I stabbed him. I goof here and basically tell him the truth, which is that he&#8217;s a really good player and that I don&#8217;t want him to ever be a threat to me- if he&#8217;s out of the equation than I can likely finish with a strong result and possibly solo. That&#8217;s not what he wants to hear. <span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">He joins the Germany\/Russia anti-Turkey coalition to stop me from getting above 8 supply centers, and it&#8217;s very dangerous since he&#8217;s a very strong tactician. <\/span>I could have done couple things to stop this situation, and I probably shouldn&#8217;t have stabbed him in the first place. I think that I could have likely talked him into not getting a build had I confronted him about it in advance. I could have also let him get a build- there was a good chance he would have kept working with me.<\/p>\n<p>At this point, inside I know that I&#8217;ve been completely defeated. With the looming threat of Germany, Austria, and Russia taking my centers if I ever grow, and also the stalemated Med, it&#8217;s clear that I won&#8217;t ever do any better than 8 supply centers. Worse, I continue vetoing draws, which allows France and Germany to grow to 8 and 7 supply centers and only reduces my score further. It also results in everyone being increasingly upset, as someone at the table is preventing everyone from going to bed for some reason. Honestly, the only reason I kept denying the draw was out of a denial to believe I had been beaten, and the false hope that someone would shake up the board. According to the TD, the game auto-draws if 3 seasons pass without any supply centers changing hands. This occurs, and the game finally ends.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"font-weight: 400;\"><strong>Round 5, Board 2<\/strong><\/p>\n<p style=\"font-weight: 400;\">Austria: Nicholas  DeLateur<\/p>\n<p style=\"font-weight: 400;\">England: Adam Silverman<\/p>\n<p style=\"font-weight: 400;\">France: Rob Cienki<\/p>\n<p style=\"font-weight: 400;\">Germany: Sven Vasseur<\/p>\n<p style=\"font-weight: 400;\">Italy: Jorge Zhang<\/p>\n<p style=\"font-weight: 400;\">Russia: Jonathan Frank<\/p>\n<p style=\"font-weight: 400;\">Turkey: Pat Kelly<\/p>\n<p>&nbsp;<\/p>\n<p>There isn&#8217;t actually a lot to say about this game because for 95% of the game, I was best buddies with Nicholas Delateur and we stomped all over the board. The other 5% of the time, I was stabbing Nicholas Delateur unsuccessfully, and then begging for forgiveness the next season. Towards the end of the game, England pitches that the three of us work together to three-way board top, and we all agree. In the end, the game gets drawn 9-9-10, and we all get pretty decent scores.<\/p>\n<p>One notable moment was spring 01. One of the things I floated early on in my negotiations with Nicholas was the idea of him giving me Trieste. When I play Italy, the biggest question for me is how I can get the crucial fifth build. Nicholas wanted to ally with me out of the gate because of the dynamic of him and Russia\/Turkey, but I also felt that it would be incredibly easy for him to leave me on 4 supply centers since he was pretty adamant about not giving me Trieste. So, I decided to take it anyway.<\/p>\n<p>In our conversation afterwards, Nicholas was pretty clear that this was not the type of alliance he wanted to have, and requested Trieste back. However, I knew that there was no way for him to safely kick me out of Trieste (he was in Vienna and Serbia, and if he did I would be able to retreat to Budapest). With no reason to make up with Nicholas just yet, I decided to take a risk by trying to get Turkey to support my convoy into Greece. Turkey doesn&#8217;t follow through though, and causes me and Austria to bounce. It doesn&#8217;t end up being a big deal for me and Austria because we are able to negotiate a way for him to move me through to Serbia and take Greece for himself- and then grab Bulgaria. From then on, it is very easy to take out Turkey, and I then make short work of France with England while Nicholas takes on Germany and Russia. I stab Nicholas again at a later point in the game as I expected it to be a 3 supply center stab- it ends up failing as Nicholas predicts it perfectly and it is only a one dot stab. Instead of blowing each-other&#8217;s results up, we work it out again and end on pretty comfy scores.<\/p>\n<p>&nbsp;<\/p>\n<p>Whew- that was a lot! I hope you enjoyed reading these AARs. They were mostly to help me process through the games I played, but you may have found them interesting. Let me know what you think in the comments, and make sure to subscribe for more content like this.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A few weeks ago, I traveled to DC for the 2018 world championships of Diplomacy. The tournament featured 4 rounds, and so I thought I&#8217;d share a bit about each round, including several of the mistakes I made on several of my boards. I also want to talk a little bit about why I made some &#8230; <a title=\"WDC 2018 AAR\" class=\"read-more\" href=\"https:\/\/jorgezhang.com\/2018\/11\/wdc-2018-aar\/\" aria-label=\"More on WDC 2018 AAR\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":942,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[11],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/10\/Screen-Shot-2018-10-11-at-3.27.58-PM.png?fit=402%2C364&ssl=1","jetpack-related-posts":[{"id":812,"url":"https:\/\/jorgezhang.com\/2018\/09\/54th-post\/","url_meta":{"origin":939,"position":0},"title":"54th post","date":"September 4, 2018","format":false,"excerpt":"Hey everyone! About a month and a half ago I decided to try out blogging by making a blog post every day. It's been great so far and I am planning on continuing daily posts- but I have made the decision to not make posts on weekends. This way the…","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2018\/09\/IMG_20180903_225651-1.jpg?fit=900%2C1200&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5225,"url":"https:\/\/jorgezhang.com\/2020\/02\/bill-hackenbracht-wins-gud-con-2020\/","url_meta":{"origin":939,"position":1},"title":"Bill Hackenbracht wins GUD Con 2020","date":"February 17, 2020","format":false,"excerpt":"After several months of planning and anticipation, Georgetown Board Games hosted GUD Con 2020, a 3-round, 2-day Diplomacy tournament. Most of the 24 attendees were relatively new to the game, and some had never played before. Also present were several highly experienced \"Tournament Sharks,\" but this time around they weren't…","rel":"","context":"In &quot;Georgetown University&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2020\/02\/GUD-CON-Bill-1-1-e1581914554250.jpeg?fit=845%2C750&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1096,"url":"https:\/\/jorgezhang.com\/2019\/02\/daggers-high-at-polar-vortex-2019\/","url_meta":{"origin":939,"position":2},"title":"Daggers High at Polar Vortex 2019","date":"February 1, 2019","format":false,"excerpt":"Daggers High at the 2019 Polar Vortex convention.","rel":"","context":"In &quot;Daggers High&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/02\/3p-January-Polar-Vortex.jpg?fit=1200%2C900&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1717,"url":"https:\/\/jorgezhang.com\/2019\/05\/pope-or-nope-review\/","url_meta":{"origin":939,"position":3},"title":"Pope or Nope Review","date":"May 22, 2019","format":false,"excerpt":"I recently had the chance to review another game from my Rulebook Preview series, which you can find here. After writing the preview, I really wanted to try out the game to see if it would work in the way that I thought it would. Special thanks to the creators…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/pope-or-nope-1.jpg?fit=900%2C506&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1629,"url":"https:\/\/jorgezhang.com\/2019\/05\/colour-chess-rulebook-review\/","url_meta":{"origin":939,"position":4},"title":"Colour Chess Rulebook Review","date":"May 7, 2019","format":false,"excerpt":"Colour Chess is a great variant that I enjoy even more than base Chess. As it turns out, \"Colour Chess\" is actually about 7 unique chess variants all packed into one. The flexibility of the components allow you to create non-standard boards and use non-standard chess pieces. If that was…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/05\/colour-chess.jpg?fit=579%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":1488,"url":"https:\/\/jorgezhang.com\/2019\/07\/shasn-rulebook-review-a-game-where-you-are-the-politician\/","url_meta":{"origin":939,"position":5},"title":"Shasn Rulebook Review: A Game Where You are the Politician","date":"July 16, 2019","format":false,"excerpt":"Hey everyone. Today, I am here with a Rulebook Review of Shasn. This review will be split into two sections: First, I will talk about the rulebook quality. In the second section, I will talk a bit about the gameplay and theme. Please keep in mind that the first portion…","rel":"","context":"In &quot;Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/jorgezhang.com\/wp-content\/uploads\/2019\/04\/shasn.jpg?fit=1030%2C772&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/939"}],"collection":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/comments?post=939"}],"version-history":[{"count":4,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/939\/revisions"}],"predecessor-version":[{"id":962,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/posts\/939\/revisions\/962"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media\/942"}],"wp:attachment":[{"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/media?parent=939"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/categories?post=939"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jorgezhang.com\/wp-json\/wp\/v2\/tags?post=939"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}